#### ParameterTypeId Members

---

|  |
| --- |
| ParameterTypeId Class   Properties   See Also |

The  ParameterTypeId  type exposes the following members.

# Properties

|  | Name | Description |
| --- | --- | --- |
| Public property Static member | ActualMaxRidgeHeightParam | "Maximum Ridge Height" |
| Public property Static member | AlignmentStationLabelDistance | "Distance": Currently not in use |
| Public property Static member | AlignmentStationLabelIncludeStation | "Include Station" |
| Public property Static member | AlignmentStationLabelIndStation | "Station Indicator" |
| Public property Static member | AlignmentStationLabelSetEndStation | "Alignment Label Set End Station" |
| Public property Static member | AlignmentStationLabelSetInterval | "Alignment Station Label Set Interval": The text is not used directly anywhere in the UI, instead the XAML specifies its own string for the value's label. |
| Public property Static member | AlignmentStationLabelSetOffset | "Alignment Station Label Set Offset": The text is not used directly anywhere in the UI, instead the XAML specifies its own string for the value's label. |
| Public property Static member | AlignmentStationLabelSetStartStation | "Alignment Label Set Start Station" |
| Public property Static member | AlignmentStationLabelStationValue | "Station Value" |
| Public property Static member | AlignmentStationPrefix | "Station Prefix" |
| Public property Static member | AlignmentStationSuffix | "Station Suffix" |
| Public property Static member | AllGridRotationForDivisionRule | "All Grid Rotation" |
| Public property Static member | AllModelDescription | "Description" |
| Public property Static member | AllModelImage | "Image" |
| Public property Static member | AllModelInstanceComments | "Comments" |
| Public property Static member | AllModelManufacturer | "Manufacturer" |
| Public property Static member | AllModelModel | "Model" |
| Public property Static member | AllModelTypeComments | "Type Comments" |
| Public property Static member | AllModelTypeImage | "Type Image" |
| Public property Static member | AllModelUrl | "URL" |
| Public property Static member | AllowAutoEmbed | "Automatically Embed" |
| Public property Static member | AlternateUnits | "Alternate Units" |
| Public property Static member | AlternateUnitsPrefix | "Alternate Units Prefix" |
| Public property Static member | AlternateUnitsSuffix | "Alternate Units Suffix" |
| Public property Static member | AlwaysZeroLength | "Base Offset" |
| Public property Static member | AnalyticalAbsorptance | "Absorptance" |
| Public property Static member | AnalyticalAdjacentSpace | "Adjacent Analytical Space" |
| Public property Static member | AnalyticalDefineThermalPropertiesBy | "Define Thermal Properties by" |
| Public property Static member | AnalyticalElementHasAssociation | "Has Association": Used for Analytical Member, Analytical Panel, Structural Columns, Structural Framing, Floors, Walls, Structural Foundation |
| Public property Static member | AnalyticalElementPhysicalAsset | "Physical Material Asset": Used for Analytical Elements. |
| Public property Static member | AnalyticalElementStructuralRole | "Structural Role": Used for Analytical Elements |
| Public property Static member | AnalyticalGeometryIsValid | "Analytical Model Correct" |
| Public property Static member | AnalyticalHeatTransferCoefficient | "Heat Transfer Coefficient (U)" |
| Public property Static member | AnalyticalLinkReleaseRotationX | "X Rotation" |
| Public property Static member | AnalyticalLinkReleaseRotationY | "Y Rotation" |
| Public property Static member | AnalyticalLinkReleaseRotationZ | "Z Rotation" |
| Public property Static member | AnalyticalLinkReleaseTranslationX | "X Translation" |
| Public property Static member | AnalyticalLinkReleaseTranslationY | "Y Translation" |
| Public property Static member | AnalyticalLinkReleaseTranslationZ | "Z Translation" |
| Public property Static member | AnalyticalMemberForceEndAllNonZero | "All non 0 forces at end" |
| Public property Static member | AnalyticalMemberForceEndFx | "End Fx" |
| Public property Static member | AnalyticalMemberForceEndFy | "End Fy" |
| Public property Static member | AnalyticalMemberForceEndFz | "End Fz" |
| Public property Static member | AnalyticalMemberForceEndMx | "End Mx" |
| Public property Static member | AnalyticalMemberForceEndMy | "End My" |
| Public property Static member | AnalyticalMemberForceEndMz | "End Mz" |
| Public property Static member | AnalyticalMemberForceStartAllNonZero | "All non 0 forces at start" |
| Public property Static member | AnalyticalMemberForceStartFx | "Start Fx" |
| Public property Static member | AnalyticalMemberForceStartFy | "Start Fy" |
| Public property Static member | AnalyticalMemberForceStartFz | "Start Fz" |
| Public property Static member | AnalyticalMemberForceStartMx | "Start Mx" |
| Public property Static member | AnalyticalMemberForceStartMy | "Start My" |
| Public property Static member | AnalyticalMemberForceStartMz | "Start Mz" |
| Public property Static member | AnalyticalMemberRotation | "Cross-Section Rotation": Used for Analytical Member |
| Public property Static member | AnalyticalMemberSectionType | "Section Type": The id of the type from the structural Family assigned to the analytical member. |
| Public property Static member | AnalyticalModelArea | "Area": The Area of Analytical Model |
| Public property Static member | AnalyticalModelBaseAlignmentMethod | "Base Alignment Method" |
| Public property Static member | AnalyticalModelBaseExtensionMethod | "Base Extension Method" |
| Public property Static member | AnalyticalModelBaseYProjection | "Base y Projection" |
| Public property Static member | AnalyticalModelBaseZProjection | "Base z Projection" |
| Public property Static member | AnalyticalModelCodeChecking | "Code Checking": Used for Analytical wall, Analytical beam, Analytical column, Analytical floor, Analytical wall foundations, Analytical isolated foundations, Analytical foundations slab, Anaytical brace |
| Public property Static member | AnalyticalModelColumnBaseExtension | "Base x Projection" |
| Public property Static member | AnalyticalModelColumnTopExtension | "Top x Projection" |
| Public property Static member | AnalyticalModelEndAlignmentMethod | "End Alignment Method" |
| Public property Static member | AnalyticalModelEndProjectionOrthogonal | "End Projection Orthogonal" |
| Public property Static member | AnalyticalModelEndYProjection | "End y Projection" |
| Public property Static member | AnalyticalModelEndZProjection | "End z Projection" |
| Public property Static member | AnalyticalModelFloorAlignmentMethod | "Alignment Method" |
| Public property Static member | AnalyticalModelFloorProjection | "z Projection" |
| Public property Static member | AnalyticalModelFoundationsMark | "Foundation Number": Used for isolated, wall foundations |
| Public property Static member | AnalyticalModelLength | "Length": The length of Analytical Model |
| Public property Static member | AnalyticalModelManuallyAdjusted | "Manually Adjusted" |
| Public property Static member | AnalyticalModelNodesMark | "Node Number": Used for nodes |
| Public property Static member | AnalyticalModelPerimeter | "Perimeter": The Perimeter of Analytical Model |
| Public property Static member | AnalyticalModelPhysicalType | "Family Type": the Family Type of the physical element associated with the Analytical Model |
| Public property Static member | AnalyticalModelRotation | "Cross-Section Rotation": The rotation of Analytical Model |
| Public property Static member | AnalyticalModelSketchAlignmentMethod | "Alignment Method" |
| Public property Static member | AnalyticalModelSketchProjection | "In-Plane Projection" |
| Public property Static member | AnalyticalModelStartAlignmentMethod | "Start Alignment Method" |
| Public property Static member | AnalyticalModelStartProjectionOrthogonal | "Start Projection Orthogonal" |
| Public property Static member | AnalyticalModelStartYProjection | "Start y Projection" |
| Public property Static member | AnalyticalModelStartZProjection | "Start z Projection" |
| Public property Static member | AnalyticalModelStickElementsMark | "Member Number": Used for beams, braces, columns |
| Public property Static member | AnalyticalModelSurfaceElementsMark | "Surface Number": Used for floors, slabs, walls |
| Public property Static member | AnalyticalModelTopAlignmentMethod | "Top Alignment Method" |
| Public property Static member | AnalyticalModelTopExtensionMethod | "Top Extension Method" |
| Public property Static member | AnalyticalModelTopYProjection | "Top y Projection" |
| Public property Static member | AnalyticalModelTopZProjection | "Top z Projection" |
| Public property Static member | AnalyticalModelWallAlignmentMethod | "Alignment Method" |
| Public property Static member | AnalyticalModelWallBaseProjection | "Base y Projection" |
| Public property Static member | AnalyticalModelWallProjection | "z Projection" |
| Public property Static member | AnalyticalModelWallTopProjection | "Top y Projection" |
| Public property Static member | AnalyticalNodeConnectionStatus | "Connection Status" |
| Public property Static member | AnalyticalPanelThickness | "Thickness": Used for Analytical Panel |
| Public property Static member | AnalyticalRoughness | "Roughness" |
| Public property Static member | AnalyticalSolarHeatGainCoefficient | "Solar Heat Gain Coefficient" |
| Public property Static member | AnalyticalSpace | "Analytical Space" |
| Public property Static member | AnalyticalThermalMass | "Thermal Mass" |
| Public property Static member | AnalyticalThermalResistance | "Thermal Resistance (R)" |
| Public property Static member | AnalyticalVisualLightTransmittance | "Visual Light Transmittance" |
| Public property Static member | AnalyticConstruction | "Analytic Construction" |
| Public property Static member | AnalyticConstructionGbxmlTypeid | "Construction Type Id" |
| Public property Static member | AnalyticConstructionLookupTable | "Analytic Construction" |
| Public property Static member | AnyPatternIdParam | "Fill Pattern" |
| Public property Static member | AnyPatternIdParamNoNo | "Fill Pattern" |
| Public property Static member | ArcCenterMark | "Center Marks" |
| Public property Static member | ArcLeaderParam | "Arc Leaders" |
| Public property Static member | ArcWallCntrMrkVisible | "Center Mark Visible" |
| Public property Static member | AreaSchemeId | "Area Scheme Id" |
| Public property Static member | AreaSchemeName | "Name" |
| Public property Static member | AreaType | "Area Type" |
| Public property Static member | AreaTypeText | "Area Type" |
| Public property Static member | ArrowCentered | "Tick Mark Centered" |
| Public property Static member | ArrowClosed | "Arrow Closed" |
| Public property Static member | ArrowFilled | "Fill Tick" |
| Public property Static member | ArrowheadEndAtRiser | "End at Riser" |
| Public property Static member | ArrowheadType | "Arrowhead Type" |
| Public property Static member | ArrowSize | "Tick Size" |
| Public property Static member | ArrowType | "Arrow Style" |
| Public property Static member | AssemblyName | "Assembly Name" |
| Public property Static member | AssemblyNamingCategory | "Naming Category" |
| Public property Static member | AssemblyPrecastFreeze | "Disable Precast Updates" |
| Public property Static member | AssignTemplateOnViewCreation | "New views are dependent on template" |
| Public property Static member | AssociatedLevel | "Associated Level": The level associated with this cell. |
| Public property Static member | AssociatedLevelOffset | "Associated Level Offset": The offset from the associated level. |
| Public property Static member | AutoJoinCondition | "Join Condition" |
| Public property Static member | AutoJoinConditionWall | "Join Condition" |
| Public property Static member | AutoMullionBorder1Grid1 | "Border 1 Type" |
| Public property Static member | AutoMullionBorder1Grid2 | "Border 1 Type" |
| Public property Static member | AutoMullionBorder1Horiz | "Border 1 Type" |
| Public property Static member | AutoMullionBorder1Vert | "Border 1 Type" |
| Public property Static member | AutoMullionBorder2Grid1 | "Border 2 Type" |
| Public property Static member | AutoMullionBorder2Grid2 | "Border 2 Type" |
| Public property Static member | AutoMullionBorder2Horiz | "Border 2 Type" |
| Public property Static member | AutoMullionBorder2Vert | "Border 2 Type" |
| Public property Static member | AutoMullionInteriorGrid1 | "Interior Type" |
| Public property Static member | AutoMullionInteriorGrid2 | "Interior Type" |
| Public property Static member | AutoMullionInteriorHoriz | "Interior Type" |
| Public property Static member | AutoMullionInteriorVert | "Interior Type" |
| Public property Static member | AutoPanel | "Curtain Panel" |
| Public property Static member | AutoPanelWall | "Curtain Panel" |
| Public property Static member | Azimuth | "Azimuth" |
| Public property Static member | BackgroundDraftPatternIdParam | "Background Fill Pattern" |
| Public property Static member | BackgroundPatternColorParam | "Background Pattern Color" |
| Public property Static member | BaselineDimOffset | "Baseline Offset" |
| Public property Static member | BasepointAngletonParam | "Angle to True North" |
| Public property Static member | BasepointEastwestParam | "E/W" |
| Public property Static member | BasepointElevationParam | "Elev" |
| Public property Static member | BasepointLatitudeParam | "Lat" |
| Public property Static member | BasepointLongitudeParam | "Lon" |
| Public property Static member | BasepointNorthsouthParam | "N/S" |
| Public property Static member | BeamHJustification | "Lateral Justification" |
| Public property Static member | BeamSystem3dParam | "3D" |
| Public property Static member | BeamSystemTagInstParamAngle | "Beam System Tag Direction" |
| Public property Static member | BeamSystemTagParamLeft | "Left" |
| Public property Static member | BeamSystemTagParamRight | "Right" |
| Public property Static member | BeamVJustification | "z-Direction Justification" |
| Public property Static member | BeamVJustificationOtherValue | "z-Direction Offset Value" |
| Public property Static member | BentFabricParamBendDirection | "Bend Direction": Direction in which FabricSheet is bent. |
| Public property Static member | BentFabricParamLongitudinalCutLength | "Longitudinal Cut Length": Bent fabric longitudinal cut length. |
| Public property Static member | BentFabricParamStraightWiresLocation | "Straight Wires Location": Location of straight wires in a bent fabric. |
| Public property Static member | BlendEndParam | "Second End" |
| Public property Static member | BlendStartParam | "First End" |
| Public property Static member | BoundaryAreaRestraintX | "X Spring Modulus" |
| Public property Static member | BoundaryAreaRestraintY | "Y Spring Modulus" |
| Public property Static member | BoundaryAreaRestraintZ | "Z Spring Modulus" |
| Public property Static member | BoundaryBearing | "Bearing" |
| Public property Static member | BoundaryConditionsIsExt | "Is Boundary Conditions External?" |
| Public property Static member | BoundaryConditionsType | "Boundary Conditions Type" |
| Public property Static member | BoundaryDirectionRotX | "X Rotation" |
| Public property Static member | BoundaryDirectionRotY | "Y Rotation" |
| Public property Static member | BoundaryDirectionRotZ | "Z Rotation" |
| Public property Static member | BoundaryDirectionX | "X Translation" |
| Public property Static member | BoundaryDirectionY | "Y Translation" |
| Public property Static member | BoundaryDirectionZ | "Z Translation" |
| Public property Static member | BoundaryDistance | "Distance" |
| Public property Static member | BoundaryLinearRestraintRotX | "X Spring Modulus" |
| Public property Static member | BoundaryLinearRestraintX | "X Spring Modulus" |
| Public property Static member | BoundaryLinearRestraintY | "Y Spring Modulus" |
| Public property Static member | BoundaryLinearRestraintZ | "Z Spring Modulus" |
| Public property Static member | BoundaryParamPreset | "State" |
| Public property Static member | BoundaryParamPresetArea | "State" |
| Public property Static member | BoundaryParamPresetLinear | "State" |
| Public property Static member | BoundaryRadius | "Radius" |
| Public property Static member | BoundaryRestraintRotX | "X Spring Modulus" |
| Public property Static member | BoundaryRestraintRotY | "Y Spring Modulus" |
| Public property Static member | BoundaryRestraintRotZ | "Z Spring Modulus" |
| Public property Static member | BoundaryRestraintX | "X Spring Modulus" |
| Public property Static member | BoundaryRestraintY | "Y Spring Modulus" |
| Public property Static member | BoundaryRestraintZ | "Z Spring Modulus" |
| Public property Static member | BoundaryXRotationFixed | "X Rotation - Fixed" |
| Public property Static member | BoundaryXRotationSpring | "X Rotation - Spring" |
| Public property Static member | BoundaryXTranslationFixed | "X Translation - Fixed" |
| Public property Static member | BoundaryXTranslationSpring | "X Translation - Spring" |
| Public property Static member | BoundaryYRotationFixed | "Y Rotation - Fixed" |
| Public property Static member | BoundaryYRotationSpring | "Y Rotation - Spring" |
| Public property Static member | BoundaryYTranslationFixed | "Y Translation - Fixed" |
| Public property Static member | BoundaryYTranslationSpring | "Y Translation - Spring" |
| Public property Static member | BoundaryZRotationFixed | "Z Rotation - Fixed" |
| Public property Static member | BoundaryZRotationSpring | "Z Rotation - Spring" |
| Public property Static member | BoundaryZTranslationFixed | "Z Translation - Fixed" |
| Public property Static member | BoundaryZTranslationSpring | "Z Translation - Spring" |
| Public property Static member | BrOrgFilter | "Filter" |
| Public property Static member | BrOrgFolders | "Folders" |
| Public property Static member | BuildingClosingTimeParam | "Closing Time" |
| Public property Static member | BuildingCurveGstyle | "Line Style" |
| Public property Static member | BuildingCurveGstylePlusInvisible | "Subcategory" |
| Public property Static member | BuildingOpeningTimeParam | "Opening Time" |
| Public property Static member | BuildingpadHeightabovelevelParam | "Height Offset From Level" |
| Public property Static member | BuildingpadThickness | "Thickness" |
| Public property Static member | BuildingUnoccupiedCoolingSetPointParam | "Unoccupied Cooling Set Point" |
| Public property Static member | BuilidingPadStructureIdParam | "Structure" |
| Public property Static member | CabletrayMinbendmultiplierParam | "Bend Radius Multiplier" |
| Public property Static member | CalloutAttrHeadTag | "Callout Head" |
| Public property Static member | CalloutCornerSheetRadius | "Corner Radius" |
| Public property Static member | CalloutSyncronizeBoundOffsetFar | "Far Clip Settings" |
| Public property Static member | CalloutTag | "Callout Tag" |
| Public property Static member | CeilingAttrDefaultHeightParam | "Default Height above level" |
| Public property Static member | CeilingAttrPatternParam | "Pattern" |
| Public property Static member | CeilingAttrSpacing1Param | "Spacing Axis 1" |
| Public property Static member | CeilingAttrSpacing2Param | "Spacing Axis 2" |
| Public property Static member | CeilingAttrSystemnameParam | "System" |
| Public property Static member | CeilingHasThicknessParam | "Has Thickness" |
| Public property Static member | CeilingHeightabovelevelParam | "Height Offset From Level" |
| Public property Static member | CeilingStructureIdParam | "Structure" |
| Public property Static member | CeilingThickness | "Thickness" |
| Public property Static member | CeilingThicknessParam | "Thickness" |
| Public property Static member | CenterMarkSize | "Center Mark Size" |
| Public property Static member | CircMullionRadius | "Radius" |
| Public property Static member | CircuitLoadClassificationAbbreviationParam | "Load Classification Abbreviation" |
| Public property Static member | CircuitLoadClassificationParam | "Load Classification" |
| Public property Static member | CircuitPhaseParam | "Phase Label" |
| Public property Static member | CircuitWaysParam | "Ways" |
| Public property Static member | CircularFramingDiameter | "Circular Diameter" |
| Public property Static member | ClearCover | "Rebar Cover" |
| Public property Static member | ClearCoverBottom | "Rebar Cover - Bottom Face" |
| Public property Static member | ClearCoverExterior | "Rebar Cover - Exterior Face" |
| Public property Static member | ClearCoverInterior | "Rebar Cover - Interior Face" |
| Public property Static member | ClearCoverOther | "Rebar Cover - Other Faces" |
| Public property Static member | ClearCoverTop | "Rebar Cover - Top Face" |
| Public property Static member | ClientName | "Client Name" |
| Public property Static member | ClineSubcategory | "Subcategory" |
| Public property Static member | CoarseScaleFillPatternColor | "Coarse Scale Fill Color" |
| Public property Static member | CoarseScaleFillPatternIdParam | "Coarse Scale Fill Pattern" |
| Public property Static member | ColorFillFilteredParam | "Values Displayed" |
| Public property Static member | ColorFillSwatchHeightParam | "Swatch Height" |
| Public property Static member | ColorFillSwatchWidthParam | "Swatch Width" |
| Public property Static member | ColorSchemeLocation | "Color Scheme Location" |
| Public property Static member | ColumnBaseAttachCutParam | "Base Attachment Cut" |
| Public property Static member | ColumnBaseAttachedParam | "Base is Attached" |
| Public property Static member | ColumnBaseAttachJustificationParam | "Attachment Justification At Base" |
| Public property Static member | ColumnBaseAttachmentOffsetParam | "Offset From Attachment At Base" |
| Public property Static member | ColumnLocationMark | "Column Location Mark" |
| Public property Static member | ColumnTopAttachCutParam | "Top Attachment Cut" |
| Public property Static member | ColumnTopAttachedParam | "Top is Attached" |
| Public property Static member | ColumnTopAttachJustificationParam | "Attachment Justification At Top" |
| Public property Static member | ColumnTopAttachmentOffsetParam | "Offset From Attachment At Top" |
| Public property Static member | ConceptualConstructionMaterial | "Graphical Appearance" |
| Public property Static member | ConduitStandardTypeParam | "Standard" |
| Public property Static member | ConnectorAngle | "Angle" |
| Public property Static member | ConnectorAngleOfDeflection | "Angle of Deflection" |
| Public property Static member | ConnectorDiameter | "Diameter" |
| Public property Static member | ConnectorEngagementLength | "Engagement Length" |
| Public property Static member | ConnectorGenderType | "Connector Gender Type" |
| Public property Static member | ConnectorHeight | "Height" |
| Public property Static member | ConnectorIndex | "Index" |
| Public property Static member | ConnectorInsideDiameter | "Inside Diameter" |
| Public property Static member | ConnectorJointType | "Connector Joint Type" |
| Public property Static member | ConnectorLength | "Length" |
| Public property Static member | ConnectorProfileType | "Shape" |
| Public property Static member | ConnectorRadius | "Radius" |
| Public property Static member | ConnectorReferenceIndex | "Link Connector Index" |
| Public property Static member | ConnectorUtilityParam | "Utility" |
| Public property Static member | ConnectorVisibleSize | "Size on screen" |
| Public property Static member | ConnectorWidth | "Width" |
| Public property Static member | ConstraintFixedOffset | "Fixed offset" |
| Public property Static member | ContinuousFootingBearingWidth | "Width" |
| Public property Static member | ContinuousFootingBottomHeel | "Bottom Heel Length" |
| Public property Static member | ContinuousFootingBottomToe | "Bottom Toe Length" |
| Public property Static member | ContinuousFootingBreakAtInsertsDisable | "Do Not Break At Inserts" |
| Public property Static member | ContinuousFootingDefaultEndExtensionLength | "Default End Extension Length" |
| Public property Static member | ContinuousFootingEccentricity | "Eccentricity" |
| Public property Static member | ContinuousFootingLength | "Length" |
| Public property Static member | ContinuousFootingStructuralUsage | "Structural Usage" |
| Public property Static member | ContinuousFootingTopHeel | "Heel Length" |
| Public property Static member | ContinuousFootingTopToe | "Toe Length" |
| Public property Static member | ContinuousFootingWidth | "Width" |
| Public property Static member | ContinuousrailBeginningTerminationAttachmentParam | "Extension Style" |
| Public property Static member | ContinuousrailBeginningTerminationTypeParam | "Beginning/Bottom Termination" |
| Public property Static member | ContinuousrailDefaultJoinTypeParam | "Default Join" |
| Public property Static member | ContinuousrailEndExtensionLengthParam | "Length" |
| Public property Static member | ContinuousrailEndTerminationAttachmentParam | "Extension Style" |
| Public property Static member | ContinuousrailEndTerminationTypeParam | "End/Top Termination" |
| Public property Static member | ContinuousrailExtensionLengthParam | "Length" |
| Public property Static member | ContinuousrailFilletRadiusParam | "Fillet Radius" |
| Public property Static member | ContinuousrailJoinTypeParam | "Rail Path Join" |
| Public property Static member | ContinuousrailLengthParam | "Length" |
| Public property Static member | ContinuousrailMaterialsParam | "Material" |
| Public property Static member | ContinuousrailPlusTreadDepthParam | "Plus Tread Depth" |
| Public property Static member | ContinuousrailProfileTypeParam | "Profile" |
| Public property Static member | ContinuousrailTransitionTypeParam | "Transitions" |
| Public property Static member | ContourElevation | "Elevation" |
| Public property Static member | ContourElevationStep | "Increment" |
| Public property Static member | ContourLabelsElevBaseType | "Elevation Base" |
| Public property Static member | ContourLabelsLinearUnits | "Units Format" |
| Public property Static member | ContourLabelsPrimaryOnly | "Label primary contours only" |
| Public property Static member | ContourLabelsRelativeBase | "Relative Base" |
| Public property Static member | ContourSubcategoryId | "Subcategory" |
| Public property Static member | CouplerCode | "Part Number" |
| Public property Static member | CouplerCoupledBarSize | "Bar Size 2" |
| Public property Static member | CouplerCoupledEndtreatment | "End Treatment 2" |
| Public property Static member | CouplerCoupledEngagement | "Bar Engagement 2" |
| Public property Static member | CouplerLength | "Total Length" |
| Public property Static member | CouplerMainBarSize | "Bar Size 1" |
| Public property Static member | CouplerMainEndtreatment | "End Treatment 1" |
| Public property Static member | CouplerMainEngagement | "Bar Engagement 1" |
| Public property Static member | CouplerMark | "Schedule Mark" |
| Public property Static member | CouplerNumber | "Coupler Number" |
| Public property Static member | CouplerQuantity | "Quantity" |
| Public property Static member | CouplerRotationAngle | "Coupler Rotation" |
| Public property Static member | CouplerWeight | "Mass" |
| Public property Static member | CouplerWidth | "External Diameter" |
| Public property Static member | CoverTypeLength | "Length" |
| Public property Static member | CoverTypeName | "Name" |
| Public property Static member | CurtaingridAdjustBorderHoriz | "Adjust for Mullion Size" |
| Public property Static member | CurtaingridAdjustBordern1 | "Adjust for Mullion Size" |
| Public property Static member | CurtaingridAdjustBordern2 | "Adjust for Mullion Size" |
| Public property Static member | CurtaingridAdjustBorderU | "Adjust for Mullion Size" |
| Public property Static member | CurtaingridAdjustBorderV | "Adjust for Mullion Size" |
| Public property Static member | CurtaingridAdjustBorderVert | "Adjust for Mullion Size" |
| Public property Static member | CurtaingridAngleHoriz | "Angle" |
| Public property Static member | CurtaingridAnglen1 | "Angle" |
| Public property Static member | CurtaingridAnglen2 | "Angle" |
| Public property Static member | CurtaingridAngleU | "Grid Rotation" |
| Public property Static member | CurtaingridAngleV | "Grid Rotation" |
| Public property Static member | CurtaingridAngleVert | "Angle" |
| Public property Static member | CurtainGridBaseOrientation | "Grid Base Orientation" |
| Public property Static member | CurtaingridBeltHoriz | "Measurement Line" |
| Public property Static member | CurtaingridBeltn1 | "Measurement Line" |
| Public property Static member | CurtaingridBeltn2 | "Measurement Line" |
| Public property Static member | CurtaingridBeltRation1 | "Measurement Line" |
| Public property Static member | CurtaingridBeltRation2 | "Measurement Line" |
| Public property Static member | CurtaingridBeltRatioU | "Belt Measurement" |
| Public property Static member | CurtaingridBeltRatioV | "Belt Measurement" |
| Public property Static member | CurtaingridBeltU | "Belt Measurement" |
| Public property Static member | CurtaingridBeltV | "Belt Measurement" |
| Public property Static member | CurtaingridBeltVert | "Measurement Line" |
| Public property Static member | CurtaingridOriginHoriz | "Offset" |
| Public property Static member | CurtaingridOriginn1 | "Offset" |
| Public property Static member | CurtaingridOriginn2 | "Offset" |
| Public property Static member | CurtaingridOriginU | "Offset" |
| Public property Static member | CurtaingridOriginV | "Offset" |
| Public property Static member | CurtaingridOriginVert | "Offset" |
| Public property Static member | CurtaingridUseCurveDist | "Use Curve Distance" |
| Public property Static member | CurtaingridUseCurveDistHoriz | "Use Curve Distance" |
| Public property Static member | CurtaingridUseCurveDistn1 | "Use Curve Distance" |
| Public property Static member | CurtaingridUseCurveDistn2 | "Use Curve Distance" |
| Public property Static member | CurtaingridUseCurveDistU | "Use Curve Distance" |
| Public property Static member | CurtaingridUseCurveDistV | "Use Curve Distance" |
| Public property Static member | CurtaingridUseCurveDistVert | "Use Curve Distance" |
| Public property Static member | CurtainVersionParam | "Curtain version" |
| Public property Static member | CurtainWallPanelHostId | "Host Id" |
| Public property Static member | CurtainWallPanelsHeight | "Height" |
| Public property Static member | CurtainWallPanelsWidth | "Width" |
| Public property Static member | CurtainWallSyspanelOffset | "Offset" |
| Public property Static member | CurtainWallSyspanelThickness | "Thickness" |
| Public property Static member | CurveBottomLevel | "Bottom Level" |
| Public property Static member | CurveByPointsProjectionType | "Projection Type" |
| Public property Static member | CurveDeterminesOrientation | "Determines Orientation" |
| Public property Static member | CurveEdgeOffset | "Wall offset" |
| Public property Static member | CurveElemArcEndAngle | "Angle 2" |
| Public property Static member | CurveElemArcRadius | "Radius" |
| Public property Static member | CurveElemArcRange | "Range" |
| Public property Static member | CurveElemArcStartAngle | "Angle 1" |
| Public property Static member | CurveElemDefinesSlope | "Defines Beam System Slope" |
| Public property Static member | CurveElemLength | "Length" |
| Public property Static member | CurveElemLineAngle | "Angle" |
| Public property Static member | CurveHeightOffset | "Offset From Base" |
| Public property Static member | CurveIsDetail | "Detail Line" |
| Public property Static member | CurveIsFilled | "Filled" |
| Public property Static member | CurveIsReferenceLine | "Is Reference Line" |
| Public property Static member | CurveIsSlopeDefining | "Defines Slope" |
| Public property Static member | CurveLevel | "Level" |
| Public property Static member | CurveNumberOfSegments | "Number of Full Segments" |
| Public property Static member | CurveParamConcreteCantilever | "Concrete Cantilever" |
| Public property Static member | CurveParamSteelCantilever | "Steel Cantilever" |
| Public property Static member | CurveSupportOffset | "Wall offset" |
| Public property Static member | CurveTopLevel | "Top Level" |
| Public property Static member | CurveVisibilityParam | "Visibility/Graphics Overrides" |
| Public property Static member | CurveWallOffset | "Wall offset" |
| Public property Static member | CurveWallOffsetRoofs | "Overhang" |
| Public property Static member | CustMullionThick | "Thickness" |
| Public property Static member | CustMullionWidth1 | "Width on side 1" |
| Public property Static member | CustMullionWidth2 | "Width on side 2" |
| Public property Static member | CutLineAngle | "Cut Line Angle" |
| Public property Static member | CutLineDistance | "Cut Line Distance" |
| Public property Static member | CutLineExtension | "Cut Line Extension" |
| Public property Static member | CutLineType | "Cut Line Type" |
| Public property Static member | CutMarkSymbol | "Cut Mark Symbol" |
| Public property Static member | CutMarkSymbolSize | "Cut Mark Symbol Size" |
| Public property Static member | CwpAddGridPrefix | "Add prefix to Grid Name" |
| Public property Static member | CwpAddGridSuffix | "Add suffix to Grid Name" |
| Public property Static member | CwpAddLevelPrefix | "Add prefix to Level Name" |
| Public property Static member | CwpAddLevelSuffix | "Add suffix to Level Name" |
| Public property Static member | CwpCopyFloorInserts | "Copy openings/inserts" |
| Public property Static member | CwpCopyRoofInserts | "Copy openings" |
| Public property Static member | CwpCopyWallInserts | "Copy windows/doors/openings" |
| Public property Static member | CwpLevelOffset | "Offset Level" |
| Public property Static member | CwpLinkedRoomParams | "Parameters" |
| Public property Static member | CwpLinkedRoomPhases | "Phases" |
| Public property Static member | CwpReuseExistingGrids | "Reuse matching Grids" |
| Public property Static member | CwpReuseExistingLevels | "Reuse matching Levels" |
| Public property Static member | CwpReuseGridsSameName | "Reuse Grids with the same name" |
| Public property Static member | CwpReuseLevelsSameName | "Reuse Levels with the same name" |
| Public property Static member | CwpSplitColumnsAtLevels | "Split Columns by Levels" |
| Public property Static member | DatumBubbleEndn1 | "Symbol at End 1 Default" |
| Public property Static member | DatumBubbleEndn2 | "Symbol at End 2 Default" |
| Public property Static member | DatumBubbleLocationInElev | "Non-Plan View Symbols (Default)" |
| Public property Static member | DatumPlaneDefinesOrigin | "Defines Origin" |
| Public property Static member | DatumPlaneDefinesWallClosure | "Wall Closure" |
| Public property Static member | DatumText | "Name" |
| Public property Static member | DatumVolumeOfInterest | "Scope Box" |
| Public property Static member | DebugtabDataboundcontrolsdemoBoolean | "Boolean" |
| Public property Static member | DebugtabDataboundcontrolsdemoDouble | "Double" |
| Public property Static member | DebugtabDataboundcontrolsdemoEnum | "Options" |
| Public property Static member | DebugtabDataboundcontrolsdemoInteger | "Integer" |
| Public property Static member | DecalAttributes | "Decal Attributes" |
| Public property Static member | DecalHeight | "Height" |
| Public property Static member | DecalLockProportions | "Lock Proportions" |
| Public property Static member | DecalSubcategoryId | "Subcategory" |
| Public property Static member | DecalWidth | "Width" |
| Public property Static member | DefaultConstructionExtWallUnderground | "Mass Exterior Wall - Underground" |
| Public property Static member | DefaultConstructionMassExteriorWall | "Mass Exterior Wall" |
| Public property Static member | DefaultConstructionMassFloor | "Mass Floor" |
| Public property Static member | DefaultConstructionMassGlazing | "Mass Glazing" |
| Public property Static member | DefaultConstructionMassInteriorWall | "Mass Interior Wall" |
| Public property Static member | DefaultConstructionMassOpening | "Mass Opening" |
| Public property Static member | DefaultConstructionMassRoof | "Mass Roof" |
| Public property Static member | DefaultConstructionMassShade | "Mass Shade" |
| Public property Static member | DefaultConstructionMassSkylight | "Mass Skylight" |
| Public property Static member | DefaultConstructionMassSlab | "Mass Slab" |
| Public property Static member | DefaultViewTemplate | "View Template applied to new views" |
| Public property Static member | DefinesConstantHeight | "Defines Constant Height" |
| Public property Static member | DesignOptionId | "Design Option" |
| Public property Static member | DesignOptionParam | "Design Option" |
| Public property Static member | DiameterSymbolLocation | "Diameter Symbol Location" |
| Public property Static member | DiameterSymbolText | "Diameter Symbol Text" |
| Public property Static member | DimDisplayEq | "Equality Display" |
| Public property Static member | DimIsreporting | "Is Reporting" |
| Public property Static member | DimLabel | "Label" |
| Public property Static member | DimLabelGpShow | "Show Label in View" |
| Public property Static member | DimLabelIsInstance | "Is Instance Parameter" |
| Public property Static member | DimLeader | "Leader" |
| Public property Static member | DimLeaderArrowhead | "Tick Mark" |
| Public property Static member | DimLeaderDisplayCondition | "Show Leader When Text Moves" |
| Public property Static member | DimLeaderShoulderLength | "Shoulder Length" |
| Public property Static member | DimLeaderType | "Leader Type" |
| Public property Static member | DimLineExtension | "Dimension Line Extension" |
| Public property Static member | DimNotModifiable | "Non-modifiable" |
| Public property Static member | DimPrefix | "Dimension Prefix" |
| Public property Static member | DimReferenceCount | "Count" |
| Public property Static member | DimStyleAngularUnits | "Units Format" |
| Public property Static member | DimStyleAngularUnitsAlt | "Alternate Units Format" |
| Public property Static member | DimStyleCenterlinePattern | "Centerline Pattern" |
| Public property Static member | DimStyleCenterlineSymbol | "Centerline Symbol" |
| Public property Static member | DimStyleCenterlineTickMark | "Centerline Tick Mark" |
| Public property Static member | DimStyleDimLineSnapDist | "Dimension Line Snap Distance" |
| Public property Static member | DimStyleFlippedDimLineExtension | "Flipped Dimension Line Extension" |
| Public property Static member | DimStyleInteriorTickMark | "Interior Tick Mark" |
| Public property Static member | DimStyleLeaderTickMark | "Leader Tick Mark" |
| Public property Static member | DimStyleLinearUnits | "Units Format" |
| Public property Static member | DimStyleLinearUnitsAlt | "Alternate Units Format" |
| Public property Static member | DimStyleReadConvention | "Read Convention" |
| Public property Static member | DimStyleShowOpeningHt | "Show Opening Height" |
| Public property Static member | DimStyleSuppressSpaces | "Suppress Spaces" |
| Public property Static member | DimSuffix | "Dimension Suffix" |
| Public property Static member | DimTextBackground | "Text Background" |
| Public property Static member | DimTextLocationForLeader | "Text Location" |
| Public property Static member | DimToInserts | "Dimension To Openings" |
| Public property Static member | DimToInsertType | "Dimension To Opening Type" |
| Public property Static member | DimToIntersectingGrids | "Dimension To Intersecting Grids" |
| Public property Static member | DimToIntersectingWalls | "Dimension To Intersecting Walls" |
| Public property Static member | DimTotalLength | "Total Length" |
| Public property Static member | DimValueAngle | "Value" |
| Public property Static member | DimValueLength | "Value" |
| Public property Static member | DimWitnsLineCntrl | "Witness Line Control" |
| Public property Static member | DimWitnsLineExtensionBelow | "Witness Line Length" |
| Public property Static member | Directcontext3dApplicationId | "ApplicationId" |
| Public property Static member | Directcontext3dLoaded | "Loaded" |
| Public property Static member | Directcontext3dName | "Name" |
| Public property Static member | Directcontext3dServerId | "ServerId" |
| Public property Static member | Directcontext3dSourceId | "Path" |
| Public property Static member | DisplacedElementDisplacementX | "X Displacement" |
| Public property Static member | DisplacedElementDisplacementY | "Y Displacement" |
| Public property Static member | DisplacedElementDisplacementZ | "Z Displacement" |
| Public property Static member | DisplacementPathDepth | "Depth" |
| Public property Static member | DisplacementPathStyle | "Style" |
| Public property Static member | DistanceToCutMark | "Distance to Cut Mark" |
| Public property Static member | DividedpathBeginningIndent | "Beginning Indent" |
| Public property Static member | DividedpathDisplayNodeNumbers | "Show Node Numbers" |
| Public property Static member | DividedpathDisplayNodes | "Display Nodes" |
| Public property Static member | DividedpathDisplayReferenceCurves | "Display Path" |
| Public property Static member | DividedpathDistance | "Distance" |
| Public property Static member | DividedpathEndIndent | "End Indent" |
| Public property Static member | DividedpathFlipDirection | "Flip Direction" |
| Public property Static member | DividedpathJustification | "Justification" |
| Public property Static member | DividedpathLayout | "Layout" |
| Public property Static member | DividedpathLayoutFixedNumPoint | "Number" |
| Public property Static member | DividedpathMaxDistance | "Maximum Distance" |
| Public property Static member | DividedpathMeasurementType | "Measurement Type" |
| Public property Static member | DividedpathMergedPointNum | "Total Number of Nodes" |
| Public property Static member | DividedpathMinDistance | "Minimum Distance" |
| Public property Static member | DividedpathTotalPathLength | "Path Length" |
| Public property Static member | DividedSurfaceAllGridRotation | "All Grid Rotation" |
| Public property Static member | DividedSurfaceAllPoints | "Show all points" |
| Public property Static member | DividedSurfaceComponentTrimType | "Component Trim" |
| Public property Static member | DividedSurfaceCoverFaceCompletely | "Cover face completely" |
| Public property Static member | DividedSurfaceDisplayComponents | "Components" |
| Public property Static member | DividedSurfaceDisplayDiscardeddivisionlines | "Discarded Division Lines" |
| Public property Static member | DividedSurfaceDisplayGridlines | "Gridlines" |
| Public property Static member | DividedSurfaceDisplayNodes | "Nodes" |
| Public property Static member | DividedSurfaceDisplayOriginalSurface | "Surface" |
| Public property Static member | DividedSurfaceDisplayPatternFill | "Pattern Fill" |
| Public property Static member | DividedSurfaceDisplayPatternLines | "Pattern Lines" |
| Public property Static member | DividedSurfaceDisplaySurfaceOption | "Display Surface Option" |
| Public property Static member | DividedSurfaceEdgeNumber | "Edge number" |
| Public property Static member | DividedSurfaceFacetNumber | "Facet number" |
| Public property Static member | DividedSurfaceGridlinesStyle | "Gridlines Style" |
| Public property Static member | DividedSurfaceGridOptionParamn1 | "Option 1" |
| Public property Static member | DividedSurfaceGridOptionParamn2 | "Option 2" |
| Public property Static member | DividedSurfaceOffsetFromSurface | "Offset from surface" |
| Public property Static member | DividedSurfaceOriginalSurfaceMaterial | "Surface Material" |
| Public property Static member | DividedSurfacePattern | "Tile Pattern" |
| Public property Static member | DividedSurfacePatternFillMaterial | "Pattern Fill Material" |
| Public property Static member | DividedSurfacePatternFlip | "Component Flip" |
| Public property Static member | DividedSurfacePatternIndentn1 | "Indent 1" |
| Public property Static member | DividedSurfacePatternIndentn2 | "Indent 2" |
| Public property Static member | DividedSurfacePatternLinesStyle | "Pattern Lines Style" |
| Public property Static member | DividedSurfacePatternMirror | "Component Mirror" |
| Public property Static member | DividedSurfacePatternRotationAngle | "Component Rotation" |
| Public property Static member | DividedSurfacePointNumber | "Point number" |
| Public property Static member | DividedSurfaceRule1Suspension | "Is grid 1 suspended?" |
| Public property Static member | DividedSurfaceRule2Suspension | "Is grid 2 suspended?" |
| Public property Static member | DividedSurfaceSurfaceArea | "Divided Surface Area" |
| Public property Static member | DividedSurfaceTileBorder | "Border Tile" |
| Public property Static member | DividedSurfaceTotalEdgeLength | "Total edge length" |
| Public property Static member | DivisionPattern | "Division Pattern" |
| Public property Static member | DivisionProfileWidth | "Width": Width |
| Public property Static member | DivisionRuleParam | "Division Rule" |
| Public property Static member | DivisionSketchCurveDivisionParamsOverrideParam | "Profile Override" |
| Public property Static member | DivisionSketchCurveExtentdToSilhParam | "Extend to Silhouette" |
| Public property Static member | DoorConstructionType | "Construction Type" |
| Public property Static member | DoorCost | "Cost" |
| Public property Static member | DoorEvacuationExitType | "Exit Access" |
| Public property Static member | DoorFinish | "Finish" |
| Public property Static member | DoorFrameMaterial | "Frame Material" |
| Public property Static member | DoorFrameType | "Frame Type" |
| Public property Static member | DoorNumber | "Mark" |
| Public property Static member | DoorOperationType | "Operation" |
| Public property Static member | DpartAreaComputed | "Area" |
| Public property Static member | DpartBaseLevel | "Base Level" |
| Public property Static member | DpartBaseLevelByOriginal | "Base Level By Original" |
| Public property Static member | DpartCanHostRebar | "Can host rebar" |
| Public property Static member | DpartExcluded | "Excluded" |
| Public property Static member | DpartHeightComputed | "Height" |
| Public property Static member | DpartLayerConstruction | "Construction" |
| Public property Static member | DpartLayerFunction | "Layer Function" |
| Public property Static member | DpartLayerIndex | "Layer Index" |
| Public property Static member | DpartLayerWidth | "Thickness" |
| Public property Static member | DpartLengthComputed | "Length" |
| Public property Static member | DpartMaterialByOriginal | "Material By Original" |
| Public property Static member | DpartMaterialIdParam | "Material" |
| Public property Static member | DpartOriginalCategory | "Original Category" |
| Public property Static member | DpartOriginalCategoryId | "Original Category" |
| Public property Static member | DpartOriginalFamily | "Original Family" |
| Public property Static member | DpartOriginalType | "Original Type" |
| Public property Static member | DpartPhaseCreatedByOriginal | "Phase Created By Original" |
| Public property Static member | DpartPhaseDemolishedByOriginal | "Phase Demolished By Original" |
| Public property Static member | DpartShapeModified | "Shape is modified" |
| Public property Static member | DpartVolumeComputed | "Volume" |
| Public property Static member | DrawForEachRun | "Draw for Each Run" |
| Public property Static member | DuctTerminalEngagementLength | "Engagement Length" |
| Public property Static member | EdgeLinework | "Line Style" |
| Public property Static member | EditedBy | "Edited by" |
| Public property Static member | ElecticalEquipVoltage | "Voltage" |
| Public property Static member | ElecticalEquipWattage | "Wattage" |
| Public property Static member | ElemCategoryParam | "Category" |
| Public property Static member | ElemCategoryParamMt | "Category" |
| Public property Static member | ElemDeletableInFamily | "Deletable" |
| Public property Static member | ElementIsCutting | "Solid/Void" |
| Public property Static member | ElementLockedParam | "Locked" |
| Public property Static member | ElemFamilyAndTypeParam | "Family and Type" |
| Public property Static member | ElemFamilyParam | "Family" |
| Public property Static member | ElemIsReference | "Reference" |
| Public property Static member | ElemPartitionParam | "Workset" |
| Public property Static member | ElemReferenceName | "Is Reference" |
| Public property Static member | ElemReferenceName2dXz | "Is Reference" |
| Public property Static member | ElemRoomId | "Room Id" |
| Public property Static member | ElemRoomName | "Room Name" |
| Public property Static member | ElemRoomNumber | "Room Number" |
| Public property Static member | ElemTypeLabel | "Label" |
| Public property Static member | ElemTypeParam | "Type" |
| Public property Static member | ElevArrowAngle | "Arrow Angle" |
| Public property Static member | ElevArrowFilled | "Filled" |
| Public property Static member | ElevAssocDatum | "Associated Datum" |
| Public property Static member | ElevatnTag | "Elevation Tag" |
| Public property Static member | ElevReferenceLabelPos | "Reference Label Position" |
| Public property Static member | ElevShape | "Shape" |
| Public property Static member | ElevShowViewName | "Show View Name" |
| Public property Static member | ElevSymbolId | "Elevation Mark" |
| Public property Static member | ElevTextPos | "Text Position" |
| Public property Static member | ElevViewNamePos | "View Name Position" |
| Public property Static member | ElevWidth | "Width" |
| Public property Static member | EllipseFocusMrkVisible | "Focus Marks Visible" |
| Public property Static member | EllipseXParam | "X-Radius Value for Ellipse (for Use with XAML Data Template example)" |
| Public property Static member | EllipseYParam | "Y-Radius Value for Ellipse (for Use with XAML Data Template example)" |
| Public property Static member | EndExtension | "End Extension" |
| Public property Static member | EndJoinCutback | "End Join Cutback" |
| Public property Static member | EndTreatment | "End Treatment" |
| Public property Static member | EndYJustification | "End y Justification" |
| Public property Static member | EndYOffsetValue | "End y Offset Value" |
| Public property Static member | EndZJustification | "End z Justification" |
| Public property Static member | EndZOffsetValue | "End z Offset Value" |
| Public property Static member | EnergyAnalysisAdvancedOptions | "Other Options" |
| Public property Static member | EnergyAnalysisBuildingOperatingSchedule | "Building Operating Schedule" |
| Public property Static member | EnergyAnalysisConceptualConstruction | "Conceptual Types" |
| Public property Static member | EnergyAnalysisCreateAnalyticalModel | "Create Energy Model" |
| Public property Static member | EnergyAnalysisGlazingIsShaded | "Glazing is Shaded" |
| Public property Static member | EnergyAnalysisHorizontalVoidThreshold | "Horizontal Void/Chase Area Threshold" |
| Public property Static member | EnergyAnalysisHvacSystem | "HVAC System" |
| Public property Static member | EnergyAnalysisMasszoneCoreoffset | "Perimeter Zone Depth" |
| Public property Static member | EnergyAnalysisMasszoneDivideperimeter | "Perimeter Zone Division" |
| Public property Static member | EnergyAnalysisMasszoneUseenergydatasettings | "Use Energy Data" |
| Public property Static member | EnergyAnalysisMassZoning | "Mass Zoning" |
| Public property Static member | EnergyAnalysisOutdoorAirInformationParam | "Outdoor Air Information" |
| Public property Static member | EnergyAnalysisPercentageGlazing | "Target Percentage Glazing" |
| Public property Static member | EnergyAnalysisPercentageSkylights | "Target Percentage Skylights" |
| Public property Static member | EnergyAnalysisProjectPhase | "Phase" |
| Public property Static member | EnergyAnalysisShadeDepth | "Shade Depth" |
| Public property Static member | EnergyAnalysisSillHeight | "Target Sill Height" |
| Public property Static member | EnergyAnalysisSkylightWidth | "Skylight Width & Depth" |
| Public property Static member | EnergyAnalysisSpaceBoundingParam | "Analytical Space Bounding" |
| Public property Static member | EnergyAnalysisVerticalVoidThreshold | "Average Vertical Void Height Threshold" |
| Public property Static member | EqualityFormula | "Equality Formula" |
| Public property Static member | EqualityTextForAngularDim | "Equality Text" |
| Public property Static member | EqualityTextForContinuousLinearDim | "Equality Text" |
| Public property Static member | EqualityWitnessDisplay | "Equality Witness Display" |
| Public property Static member | ExtrusionAutoParams | "Auto ends" |
| Public property Static member | ExtrusionEndParam | "Extrusion End" |
| Public property Static member | ExtrusionLength | "Depth" |
| Public property Static member | ExtrusionStartParam | "Extrusion Start" |
| Public property Static member | FabricationBottomElevationIncludeInsulationOfPart | "Bottom Elevation with Insulation" |
| Public property Static member | FabricationBottomElevationOfPart | "Bottom Elevation" |
| Public property Static member | FabricationBottomOfPart | "Lower End Bottom of Insulation Elevation" |
| Public property Static member | FabricationBranchSize | "Size of Primary Branch End" |
| Public property Static member | FabricationChangeServiceParam | "Change Service" |
| Public property Static member | FabricationDoublewallMaterialAbbreviation | "Double Wall Material Abbreviation" |
| Public property Static member | FabricationEndOffsetParam | "End Middle Elevation" |
| Public property Static member | FabricationEndSize | "Size of Connector End" |
| Public property Static member | FabricationFittingDescription | "Fabrication Fitting Description" |
| Public property Static member | FabricationInsulationAbbreviation | "Insulation Abbreviation" |
| Public property Static member | FabricationInsulationMaterialFinish | "Insulation Material" |
| Public property Static member | FabricationInsulationSpec | "Insulation Specification" |
| Public property Static member | FabricationInsulationSpecificationAbbreviation | "Insulation Specification Abbreviation" |
| Public property Static member | FabricationLevelParam | "Reference Level" |
| Public property Static member | FabricationMaterialAbbreviation | "Material Abbreviation" |
| Public property Static member | FabricationOffsetParam | "Middle Elevation" |
| Public property Static member | FabricationPartAlias | "Alias" |
| Public property Static member | FabricationPartAngle | "Angle" |
| Public property Static member | FabricationPartAngleOption | "Angle Option" |
| Public property Static member | FabricationPartBoughtOut | "Bought Out" |
| Public property Static member | FabricationPartCutType | "Cut Type" |
| Public property Static member | FabricationPartDepthIn | "Main Primary Depth" |
| Public property Static member | FabricationPartDepthInOption | "Main Primary Depth Option" |
| Public property Static member | FabricationPartDepthOut | "Main Secondary Depth" |
| Public property Static member | FabricationPartDepthOutOption | "Main Secondary Depth Option" |
| Public property Static member | FabricationPartDiameterIn | "Main Primary Diameter" |
| Public property Static member | FabricationPartDiameterInOption | "Main Primary Diameter Option" |
| Public property Static member | FabricationPartDiameterOut | "Main Secondary Diameter" |
| Public property Static member | FabricationPartDiameterOutOption | "Main Secondary Diameter Option" |
| Public property Static member | FabricationPartDoublewallMaterial | "Double Wall Material" |
| Public property Static member | FabricationPartDoublewallMaterialArea | "Double Wall Material Area" |
| Public property Static member | FabricationPartDoublewallMaterialThickness | "Double Wall Material Thickness" |
| Public property Static member | FabricationPartInsulationArea | "Insulation Area" |
| Public property Static member | FabricationPartItemNumber | "Item Number" |
| Public property Static member | FabricationPartLength | "Length" |
| Public property Static member | FabricationPartLengthOption | "Length Option" |
| Public property Static member | FabricationPartLiningArea | "Lining Area" |
| Public property Static member | FabricationPartMaterial | "Part Material" |
| Public property Static member | FabricationPartMaterialThickness | "Part Material Thickness" |
| Public property Static member | FabricationPartNotes | "Fabrication Notes" |
| Public property Static member | FabricationPartPatNo | "Part Pattern Number" |
| Public property Static member | FabricationPartSheetmetalArea | "Part Sheet Metal Area" |
| Public property Static member | FabricationPartTakeoffDialogParam | "More Parameters" |
| Public property Static member | FabricationPartWeight | "Weight" |
| Public property Static member | FabricationPartWidthIn | "Main Primary Width" |
| Public property Static member | FabricationPartWidthInOption | "Main Primary Width Option" |
| Public property Static member | FabricationPartWidthOut | "Main Secondary Width" |
| Public property Static member | FabricationPartWidthOutOption | "Main Secondary Width Option" |
| Public property Static member | FabricationPipeInvertElevation | "Pipe Invert Elevation": This parameter is obsolete. It exists only for compatibility. |
| Public property Static member | FabricationPrimarySize | "Size of Primary End" |
| Public property Static member | FabricationProductCode | "Product Code" |
| Public property Static member | FabricationProductDataFinishDescription | "Product Finish Description" |
| Public property Static member | FabricationProductDataInstallType | "Install Type" |
| Public property Static member | FabricationProductDataItemDescription | "Product Short Description" |
| Public property Static member | FabricationProductDataLongDescription | "Product Long Description" |
| Public property Static member | FabricationProductDataMaterialDescription | "Product Material Description" |
| Public property Static member | FabricationProductDataOem | "OEM" |
| Public property Static member | FabricationProductDataProduct | "Product Name" |
| Public property Static member | FabricationProductDataRange | "Product Range" |
| Public property Static member | FabricationProductDataSizeDescription | "Product Size Description" |
| Public property Static member | FabricationProductDataSpecification | "Product Specification Description" |
| Public property Static member | FabricationProductEntry | "Product Entry" |
| Public property Static member | FabricationRelativeFilename | "Relative File Name" |
| Public property Static member | FabricationRoutingSolutionsUiParam | "x of XX" |
| Public property Static member | FabricationSecondarySize | "Size of Secondary End" |
| Public property Static member | FabricationServiceAbbreviation | "Fabrication Service Abbreviation" |
| Public property Static member | FabricationServiceName | "Fabrication Service Name" |
| Public property Static member | FabricationServiceParam | "Fabrication Service" |
| Public property Static member | FabricationSetUpDownTag | "SU/SD from Top" |
| Public property Static member | FabricationSetUpDownTagFromBottom | "SU/SD from Bottom" |
| Public property Static member | FabricationSlopeParam | "Slope" |
| Public property Static member | FabricationSpecification | "Specification" |
| Public property Static member | FabricationSpecificationAbbreviation | "Specification Abbreviation" |
| Public property Static member | FabricationStartOffsetParam | "Start Middle Elevation" |
| Public property Static member | FabricationTopElevationIncludeInsulationOfPart | "Top Elevation with Insulation" |
| Public property Static member | FabricationTopElevationOfPart | "Top Elevation" |
| Public property Static member | FabricationTopOfPart | "Upper End Top of Insulation Elevation" |
| Public property Static member | FabricationVendor | "Vendor" |
| Public property Static member | FabricationVendorCode | "Vendor Code" |
| Public property Static member | FabricBendDiameter | "Bend Diameter": Standard Bend Diameter of Fabric Wire. |
| Public property Static member | FabricNumber | "Fabric Number" |
| Public property Static member | FabricParamCoverOffset | "Additional Cover Offset": Additional cover offset of the fabric distribution. |
| Public property Static member | FabricParamCutByHost | "Cut by Host Cover": Single Fabric Sheet is cut or not cut by the Host Cover. |
| Public property Static member | FabricParamCutOverallLength | "Cut Overall Length": Provides a real sheet Length after definition |
| Public property Static member | FabricParamCutOverallWidth | "Cut Overall Width": Provides a real sheet Width after definition |
| Public property Static member | FabricParamCutSheetMass | "Cut Sheet Mass": Calculated cut sheet mass [Sheet Mass per Unit Area \* (Cut Overall Length \* Cut Overall Width)] |
| Public property Static member | FabricParamLapsplicePosition | "Lap Splice Position": Fabric lap splice position in the fabric distribution |
| Public property Static member | FabricParamLocationGeneric | "Location": Fabric location in the host. |
| Public property Static member | FabricParamLocationSlab | "Location": Fabric location in the slab |
| Public property Static member | FabricParamLocationWall | "Location": Fabric location in the wall |
| Public property Static member | FabricParamMajorLapspliceLength | "Major Lap Splice Length": Fabric lap splice length in major direction in the fabric distribution. |
| Public property Static member | FabricParamMinorLapspliceLength | "Minor Lap Splice Length": Fabric lap splice length in minor direction in the fabric distribution. |
| Public property Static member | FabricParamRounding | "Rounding Overrides" |
| Public property Static member | FabricParamSharedFamilyKey | "Shared family key" |
| Public property Static member | FabricParamSheetType | "Fabric Sheet": List all Fabric Sheet types |
| Public property Static member | FabricParamSpanSymBottom | "Bottom" |
| Public property Static member | FabricParamSpanSymDBottom | "D\_Bottom" |
| Public property Static member | FabricParamSpanSymDLeft | "D\_Left" |
| Public property Static member | FabricParamSpanSymDRight | "D\_Right" |
| Public property Static member | FabricParamSpanSymDTop | "D\_Top" |
| Public property Static member | FabricParamSpanSymLeft | "Left" |
| Public property Static member | FabricParamSpanSymRight | "Right" |
| Public property Static member | FabricParamSpanSymTop | "Top" |
| Public property Static member | FabricParamSpanTagComponentReference | "Tag Component Reference" |
| Public property Static member | FabricParamTagView | "Tag new members in view": List of all Plan Views and None. |
| Public property Static member | FabricParamTotalSheetMass | "Total Sheet Mass": Calculated all sheet mass: Volume of Wire \* Unit Weight. |
| Public property Static member | FabricSheetDefaultMajorLapspliceLength | "Default Major Lap Splice Length": Default Major Lap Splice Length |
| Public property Static member | FabricSheetDefaultMinorLapspliceLength | "Default Minor Lap Splice Length": Default Minor Lap Splice Length |
| Public property Static member | FabricSheetLength | "Length": Length |
| Public property Static member | FabricSheetMajorDirectionWireType | "Major Direction Wire Type": Major Direction Wire Type |
| Public property Static member | FabricSheetMajorEndOverhang | "Major End Overhang": Major End Overhang |
| Public property Static member | FabricSheetMajorLayoutPattern | "Major Layout Pattern": Major Layout Pattern |
| Public property Static member | FabricSheetMajorNumberOfWires | "Major Number of Wires": Major Number of Wires |
| Public property Static member | FabricSheetMajorReinforcementArea | "Major Reinforcement Area": Major Reinforcement Area |
| Public property Static member | FabricSheetMajorSpacing | "Major Spacing": Major Spacing |
| Public property Static member | FabricSheetMajorStartOverhang | "Major Start Overhang": Major Start Overhang |
| Public property Static member | FabricSheetMass | "Sheet Mass": Sheet Mass |
| Public property Static member | FabricSheetMassunit | "Sheet Mass per Unit Area": Structural Sheet Mass per Unit Area [Sheet Mass / (Overall Length \* Overall Width)] |
| Public property Static member | FabricSheetMinorDirectionWireType | "Minor Direction Wire Type": Minor Direction Wire Type |
| Public property Static member | FabricSheetMinorEndOverhang | "Minor End Overhang": Minor End Overhang |
| Public property Static member | FabricSheetMinorLayoutPattern | "Minor Layout Pattern": Minor Layout Pattern |
| Public property Static member | FabricSheetMinorNumberOfWires | "Minor Number of Wires": Minor Number of Wires |
| Public property Static member | FabricSheetMinorReinforcementArea | "Minor Reinforcement Area": Minor Reinforcement Area |
| Public property Static member | FabricSheetMinorSpacing | "Minor Spacing": Minor Spacing |
| Public property Static member | FabricSheetMinorStartOverhang | "Minor Start Overhang": Minor Start Overhang |
| Public property Static member | FabricSheetOverallLength | "Overall Length": Overall Length |
| Public property Static member | FabricSheetOverallWidth | "Overall Width": Overall Width |
| Public property Static member | FabricSheetPhysicalMaterialAsset | "Physical Material Asset": Physical Material Asset |
| Public property Static member | FabricSheetWidth | "Width": Width |
| Public property Static member | FabricWireDiameter | "Nominal Diameter": Nominal Diameter of Fabric Wire. |
| Public property Static member | FabricWireDistance | "Wire distance": The distance between wires |
| Public property Static member | FabricWireLength | "Wire length": The wire length |
| Public property Static member | FabricWireOffset | "Offset along wire direction": Offset along wire direction |
| Public property Static member | FabricWireType | "Wire type": The wire type assigned |
| Public property Static member | FaceroofLevelParam | "Reference Level" |
| Public property Static member | FaceroofOffsetParam | "Level Offset" |
| Public property Static member | FamilyAllowCutWithVoids | "Cut with Voids When Loaded" |
| Public property Static member | FamilyAlwaysVertical | "Always vertical" |
| Public property Static member | FamilyAutojoin | "Automatically joins geometry to walls" |
| Public property Static member | FamilyBaseLevelOffsetParam | "Base Offset" |
| Public property Static member | FamilyBaseLevelParam | "Base Level" |
| Public property Static member | FamilyCanHostRebar | "Can host rebar" |
| Public property Static member | FamilyCategoryPseudoParam | "Category" |
| Public property Static member | FamilyContentPartType | "Part Type" |
| Public property Static member | FamilyCurveAttachmentProportion | "Attachment Point" |
| Public property Static member | FamilyCurveGstyleFor2010Mass | "Subcategory" |
| Public property Static member | FamilyCurveGstylePlusInvisible | "Subcategory" |
| Public property Static member | FamilyCurveGstylePlusInvisibleMinusAnalytical | "Subcategory" |
| Public property Static member | FamilyCurveGstylePlusInvisiblePlusStickSym | "Subcategory" |
| Public property Static member | FamilyCurveGstylePlusInvisiblePlusStickSymMinusAnalytical | "Subcategory" |
| Public property Static member | FamilyElectricalMaintainAnnotationOrientation | "Maintain Annotation Orientation" |
| Public property Static member | FamilyElemSubcategory | "Subcategory" |
| Public property Static member | FamilyEnableCuttingInViews | "Enable Cutting in Views" |
| Public property Static member | FamilyExportAsGeometry | "Always export as geometry" |
| Public property Static member | FamilyFreeinstDefaultElevation | "Default Elevation" |
| Public property Static member | FamilyHeightParam | "Height" |
| Public property Static member | FamilyHostingBehavior | "Host" |
| Public property Static member | FamilyIsElevationMarkBody | "Elevation Mark Use" |
| Public property Static member | FamilyIsParametric | "Is parametric" |
| Public property Static member | FamilyKeepTextReadable | "Keep text readable" |
| Public property Static member | FamilyKeyExtParam | "Filter Parameter" |
| Public property Static member | FamilyKeywordProtected | "Content protection enabled" |
| Public property Static member | FamilyLevelParam | "Level" |
| Public property Static member | FamilyLineLengthParam | "Length" |
| Public property Static member | FamilyNamePseudoParam | "Family" |
| Public property Static member | FamilyRenderingType | "Render Appearance Source" |
| Public property Static member | FamilyRfaPathPseudoParam | "File Path" |
| Public property Static member | FamilyRotateTextWithComponent | "Rotate text with component" |
| Public property Static member | FamilyRotateWithComponent | "Rotate with component" |
| Public property Static member | FamilyRoughHeightParam | "Rough Height" |
| Public property Static member | FamilyRoughWidthParam | "Rough Width" |
| Public property Static member | FamilyRoundconnectorDimensiontype | "Round Connector Dimension" |
| Public property Static member | FamilySelfOrienting | "Align to View" |
| Public property Static member | FamilyShared | "Shared" |
| Public property Static member | FamilyStructFootingUseCapTop | "Cap" |
| Public property Static member | FamilyStructMaterialType | "Material for Model Behavior" |
| Public property Static member | FamilySymbolicRep | "Symbolic Representation" |
| Public property Static member | FamilyThicknessParam | "Thickness" |
| Public property Static member | FamilyTopLevelOffsetParam | "Top Offset" |
| Public property Static member | FamilyTopLevelParam | "Top Level" |
| Public property Static member | FamilyUsagePseudoParam | "Usage" |
| Public property Static member | FamilyUsePrecutShape | "Show family pre-cut in plan views" |
| Public property Static member | FamilyWidthParam | "Width" |
| Public property Static member | FamilyWindowInsetParam | "Inset" |
| Public property Static member | FamilyWorkPlaneBased | "Work Plane-Based" |
| Public property Static member | FamilyWpbDefaultElevation | "Default Elevation" |
| Public property Static member | FamProfileDefinition | "Profile Definition" |
| Public property Static member | FamProfileUsage | "Profile Usage" |
| Public property Static member | FasciaDepthParam | "Fascia Depth" |
| Public property Static member | FasciaMaterialParam | "Material" |
| Public property Static member | FasciaProfileParam | "Profile" |
| Public property Static member | FbxAssetType | "Light Source" |
| Public property Static member | FbxLightAtADistance | "At a distance" |
| Public property Static member | FbxLightBallastLoss | "Ballast Loss" |
| Public property Static member | FbxLightColorFilter | "Color Filter" |
| Public property Static member | FbxLightDimmingLightColor | "Dimming Lamp Color Temperature Shift" |
| Public property Static member | FbxLightEfficacy | "Efficacy" |
| Public property Static member | FbxLightEmitCircleDiameter | "Emit from Circle Diameter" |
| Public property Static member | FbxLightEmitLineLength | "Emit from Line Length" |
| Public property Static member | FbxLightEmitRectangleLength | "Emit from Rectangle Length" |
| Public property Static member | FbxLightEmitRectangleWidth | "Emit from Rectangle Width" |
| Public property Static member | FbxLightEmitShapeVisible | "Emit Shape Visible in Rendering" |
| Public property Static member | FbxLightIlluminance | "Illuminance" |
| Public property Static member | FbxLightInitialColorCtrl | "Initial Color" |
| Public property Static member | FbxLightInitialColorName | "Temperature Color" |
| Public property Static member | FbxLightInitialColorTemperature | "Initial Color Temperature" |
| Public property Static member | FbxLightInitialIntensity | "Initial Intensity" |
| Public property Static member | FbxLightInitialIntensityInputMethod | "Initial Light Intensity Input Method" |
| Public property Static member | FbxLightLampLumenDepr | "Lamp Lumen Depreciation" |
| Public property Static member | FbxLightLampTiltLoss | "Lamp Tilt Loss" |
| Public property Static member | FbxLightLimunousFlux | "Luminous Flux" |
| Public property Static member | FbxLightLimunousIntensity | "Luminous Intensity" |
| Public property Static member | FbxLightLossFactorCtrl | "Light Loss Factor" |
| Public property Static member | FbxLightLossFactorMethod | "Light Loss Input Method" |
| Public property Static member | FbxLightLumenaireDirt | "Luminaire Dirt Depreciation" |
| Public property Static member | FbxLightPhotometricFile | "Photometric Web File" |
| Public property Static member | FbxLightPhotometricFileCache | "None" |
| Public property Static member | FbxLightPhotometrics | "Light Source Definition" |
| Public property Static member | FbxLightPhotometricsFam | "Light Source Definition (family)" |
| Public property Static member | FbxLightSourceDiameter | "Light Source Symbol Size" |
| Public property Static member | FbxLightSourceLength | "Light Source Symbol Length" |
| Public property Static member | FbxLightSpotBeamAngle | "Spot Beam Angle" |
| Public property Static member | FbxLightSpotFieldAngle | "Spot Field Angle" |
| Public property Static member | FbxLightSpotTiltAngle | "Tilt Angle" |
| Public property Static member | FbxLightSurfaceLoss | "Surface Depreciation Loss" |
| Public property Static member | FbxLightTemperatureLoss | "Temperature Loss" |
| Public property Static member | FbxLightTotalLightLoss | "Total Light Loss Factor" |
| Public property Static member | FbxLightVoltageLoss | "Voltage Loss" |
| Public property Static member | FbxLightWattage | "Wattage" |
| Public property Static member | FilledRegionMasking | "Masking" |
| Public property Static member | FillPatternIdParam | "Cut fill pattern" |
| Public property Static member | FillPatternIdParamNoNo | "Fill Pattern" |
| Public property Static member | FireRating | "Fire Rating" |
| Public property Static member | FixedRotation | "Fixed Rotation" |
| Public property Static member | FlexibleInstanceFlip | "Flip" |
| Public property Static member | FloorAttrDefaultHeightParam | "Default Height above level" |
| Public property Static member | FloorAttrDefaultThicknessParam | "Default Thickness" |
| Public property Static member | FloorAttrThicknessParam | "Thickness" |
| Public property Static member | FloorHeightabovelevelParam | "Height Offset From Level" |
| Public property Static member | FloorParamIsStructural | "Structural" |
| Public property Static member | FloorParamSpanDirection | "Span Direction" |
| Public property Static member | FloorStructureIdParam | "Structure" |
| Public property Static member | FollowSurface | "Follow Surface" |
| Public property Static member | ForegroundAnyPatternIdParam | "Foreground Fill Pattern" |
| Public property Static member | ForegroundDraftPatternIdParam | "Foreground Fill Pattern" |
| Public property Static member | ForegroundPatternColorParam | "Foreground Pattern Color" |
| Public property Static member | FramingLengthRoundoff | "Structural Framing Length Roundoff" |
| Public property Static member | FramingShapeClassification | "Framing Shape" |
| Public property Static member | FunctionParam | "Function" |
| Public property Static member | GbxmlEditDataParam | "Energy Settings" |
| Public property Static member | GenericDepth | "Depth" |
| Public property Static member | GenericZoneName | "Name" |
| Public property Static member | GeoLocation | "Shared Site" |
| Public property Static member | GeomVisibilityParam | "Visibility/Graphics Overrides" |
| Public property Static member | GraphicDisplayOptions | "Graphic Display Options" |
| Public property Static member | GraphicDisplayOptionsBackground | "Background" |
| Public property Static member | GraphicDisplayOptionsFog | "Depth Cueing" |
| Public property Static member | GraphicDisplayOptionsLighting | "Lighting" |
| Public property Static member | GraphicDisplayOptionsModel | "Model Display" |
| Public property Static member | GraphicDisplayOptionsPhotoExposure | "Photographic Exposure" |
| Public property Static member | GraphicDisplayOptionsShadows | "Shadows" |
| Public property Static member | GraphicDisplayOptionsSketchyLines | "Sketchy Lines" |
| Public property Static member | GraphicDisplayOptionsSsIntensity | "Sun and Shadow Intensity" |
| Public property Static member | GridBankColNum | "Column" |
| Public property Static member | GridBankColWidth | "Column Distance" |
| Public property Static member | GridBankRowHeight | "Row Distance" |
| Public property Static member | GridBankRowNum | "Row" |
| Public property Static member | GridBubbleEndn1 | "Plan View Symbols End 1 (Default)" |
| Public property Static member | GridBubbleEndn2 | "Plan View Symbols End 2 (Default)" |
| Public property Static member | GridBubbleLinePen | "Bubble Weight Number\n" |
| Public property Static member | GridCenterSegmentColor | "Center Segment Color" |
| Public property Static member | GridCenterSegmentPattern | "Center Segment Pattern" |
| Public property Static member | GridCenterSegmentStyle | "Center Segment" |
| Public property Static member | GridCenterSegmentWeight | "Center Segment Weight" |
| Public property Static member | GridEndSegmentColor | "End Segment Color" |
| Public property Static member | GridEndSegmentPattern | "End Segment Pattern" |
| Public property Static member | GridEndSegmentsLength | "End Segments Length" |
| Public property Static member | GridEndSegmentWeight | "End Segment Weight" |
| Public property Static member | GridHeadTag | "Symbol" |
| Public property Static member | GridlineSpecStatus | "Type Association" |
| Public property Static member | GridNetLocationMark | "Location Mark": Provides grid system association information |
| Public property Static member | GroupAllowedViewTypes | "Allowed View Types" |
| Public property Static member | GroupAttachedParentName | "Attached to" |
| Public property Static member | GroupLevel | "Reference Level" |
| Public property Static member | GroupnameParam | "Group Name for Ribbon Combo Items (for Use with XAML)" |
| Public property Static member | GroupOffsetFromLevel | "Origin Level Offset" |
| Public property Static member | GuideGridNameParam | "Name" |
| Public property Static member | GuideGridSpacingParam | "Guide Spacing" |
| Public property Static member | GutterMaterialParam | "Material" |
| Public property Static member | GutterProfileParam | "Profile" |
| Public property Static member | HandrailHandClearanceParam | "Hand Clearance" |
| Public property Static member | HandrailHeightParam | "Height" |
| Public property Static member | HandrailProjectionParam | "Projection" |
| Public property Static member | HandrailSupportsJustificationParam | "Justification" |
| Public property Static member | HandrailSupportsLayoutParam | "Layout" |
| Public property Static member | HandrailSupportsNumberParam | "Number" |
| Public property Static member | HandrailSupportsSpacingParam | "Spacing" |
| Public property Static member | HandrailSupportsTypeParam | "Family" |
| Public property Static member | HeadOnPlacementMethod | "Draw in Foreground" |
| Public property Static member | HeavyEndPen | "Heavy End Pen Weight" |
| Public property Static member | HeavyTickMarkPen | "Heavy End Pen Weight" |
| Public property Static member | HighestAssociatedLevel | "Highest Associated Level": The highest level associated with this Analytical Element. |
| Public property Static member | HostAreaComputed | "Area" |
| Public property Static member | HostIdParam | "Host Id" |
| Public property Static member | HostPanelScheduleAsPanelParam | "Categorize as" |
| Public property Static member | HostPerimeterComputed | "Perimeter" |
| Public property Static member | HostSseCurvedEdgeConditionParam | "Curved Edge Condition" |
| Public property Static member | HostVolumeComputed | "Volume" |
| Public property Static member | IconIndexParam | "Index Into Image File Name Array (for Use with XAML)" |
| Public property Static member | IdParam | "Id" |
| Public property Static member | IfcApplicationName | "IfcApplicationName" |
| Public property Static member | IfcApplicationVersion | "IfcApplicationVersion" |
| Public property Static member | IfcBuildingGuid | "IfcBuilding GUID" |
| Public property Static member | IfcExportElement | "Export to IFC" |
| Public property Static member | IfcExportElementAs | "Export to IFC As" |
| Public property Static member | IfcExportElementType | "Export Type to IFC" |
| Public property Static member | IfcExportElementTypeAs | "Export Type to IFC As" |
| Public property Static member | IfcExportPredefinedtype | "IFC Predefined Type" |
| Public property Static member | IfcExportPredefinedtypeType | "Type IFC Predefined Type" |
| Public property Static member | IfcGuid | "IfcGUID" |
| Public property Static member | IfcOrganization | "IfcOrganization" |
| Public property Static member | IfcProjectGuid | "IfcProject GUID" |
| Public property Static member | IfcSiteGuid | "IfcSite GUID" |
| Public property Static member | IfcTypeGuid | "Type IfcGUID" |
| Public property Static member | ImportAdtComponentsDesc | "Component Description" |
| Public property Static member | ImportAdtEntityHeight | "Height" |
| Public property Static member | ImportAdtEntityLength | "Length" |
| Public property Static member | ImportAdtEntityRoll | "Roll" |
| Public property Static member | ImportAdtEntityStructType | "Structural Type Name" |
| Public property Static member | ImportAdtEntityStyle | "Style Name" |
| Public property Static member | ImportAdtEntityThickness | "Thickness" |
| Public property Static member | ImportAdtEntityType | "Type Name" |
| Public property Static member | ImportAdtEntityWidth | "Width" |
| Public property Static member | ImportBackground | "Draw Layer" |
| Public property Static member | ImportBaseLevel | "Work Plane" |
| Public property Static member | ImportBaseLevelOffset | "Offset from Work Plane" |
| Public property Static member | ImportDisplayUnits | "Import Units" |
| Public property Static member | ImportInstanceCuttingInView | "Enable Cutting in Views" |
| Public property Static member | ImportInstanceScale | "Instance Scale" |
| Public property Static member | ImportScale | "Scale Factor" |
| Public property Static member | ImportSymbolName | "Name" |
| Public property Static member | InfrastructureAlignmentDescription | "Description" |
| Public property Static member | InfrastructureAlignmentDisplayedEndStation | "Displayed End Station" |
| Public property Static member | InfrastructureAlignmentDisplayedStartStation | "Displayed Start Station" |
| Public property Static member | InfrastructureAlignmentName | "Name" |
| Public property Static member | InsertOrientation | "Orientation" |
| Public property Static member | InstanceElevationParam | "Elevation from Level" |
| Public property Static member | InstanceFreeHostOffsetParam | "Offset from Host" |
| Public property Static member | InstanceFreeHostParam | "Host" |
| Public property Static member | InstanceHeadHeightParam | "Head Height" |
| Public property Static member | InstanceLengthParam | "Length" |
| Public property Static member | InstanceMoveBaseWithGrids | "Move Base With Grids" |
| Public property Static member | InstanceMovesWithGridParam | "Moves With Grids" |
| Public property Static member | InstanceMoveTopWithGrids | "Move Top With Grids" |
| Public property Static member | InstanceOffsetPosParam | "Moves With Nearby Elements" |
| Public property Static member | InstanceReferenceLevelParam | "Reference Level" |
| Public property Static member | InstanceScheduleOnlyLevelParam | "Schedule Level" |
| Public property Static member | InstanceSillHeightParam | "Sill Height" |
| Public property Static member | InstanceStructUsageParam | "Structural Usage" |
| Public property Static member | InsulationScale | "Insulation Bulge to Width Ratio (1/x)" |
| Public property Static member | InsulationWidth | "Insulation Width" |
| Public property Static member | InteriorTickDisplay | "Interior Tick Mark Display" |
| Public property Static member | IsVisibleParam | "Visible" |
| Public property Static member | JoinStrengthOrder | "Abstract Join Strength Order" |
| Public property Static member | JoistSystemClearSpacingParam | "Clear Spacing" |
| Public property Static member | JoistSystemElemTagNewMembersView | "Tag new members in view" |
| Public property Static member | JoistSystemFixedSpacingParam | "Fixed Spacing" |
| Public property Static member | JoistSystemJustificationParam | "Justification" |
| Public property Static member | JoistSystemLayoutRuleParam | "Layout Rule" |
| Public property Static member | JoistSystemMaximumSpacingParam | "Maximum Spacing" |
| Public property Static member | JoistSystemNewBeamTypeNoFamNameParam | "Beam Type (No Family Name)" |
| Public property Static member | JoistSystemNewBeamTypeParam | "Beam Type" |
| Public property Static member | JoistSystemNumBeamsSameType | "Num. of Beams With Same Type" |
| Public property Static member | JoistSystemNumberOfLinesParam | "Number of Lines" |
| Public property Static member | JoistSystemSpacingParam | "Centerline Spacing" |
| Public property Static member | KeepReadable | "Keep Readable" |
| Public property Static member | KeynoteNumber | "Key Value" |
| Public property Static member | KeynoteParam | "Keynote" |
| Public property Static member | KeynoteText | "Keynote Text" |
| Public property Static member | KeySourceParam | "Key Source" |
| Public property Static member | KeyValue | "Key Value" |
| Public property Static member | LayerElemAreaComputed | "Area" |
| Public property Static member | LayerElemOffsetFromHostParam | "Offset From Host" |
| Public property Static member | LayerElemThicknessParam | "Thickness": Thickness |
| Public property Static member | LayerElemVolumeComputed | "Volume" |
| Public property Static member | LayerTypeMaterialsParam | "Material": Material |
| Public property Static member | LayerTypeThicknessParam | "Thickness": Thickness |
| Public property Static member | LayoutnodeCurvetypeParam | "Curve Type Reference" |
| Public property Static member | LeaderArrowhead | "Leader Arrowhead" |
| Public property Static member | LeaderArrowWidth | "Arrow Width Angle" |
| Public property Static member | LeaderLeftAttachment | "Left Attachment" |
| Public property Static member | LeaderLine | "Leader Line" |
| Public property Static member | LeaderOffsetSheet | "Leader/Border Offset" |
| Public property Static member | LeaderRightAttachment | "Right Attachment" |
| Public property Static member | LegendComponent | "Component Type" |
| Public property Static member | LegendComponentDetailLevel | "Detail Level" |
| Public property Static member | LegendComponentLength | "Host Length" |
| Public property Static member | LegendComponentView | "View Direction" |
| Public property Static member | LevelAttrRoomComputationAutomatic | "Automatic Room Computation Height" |
| Public property Static member | LevelAttrRoomComputationHeight | "Computation Height" |
| Public property Static member | LevelDataFloorArea | "Floor Area" |
| Public property Static member | LevelDataFloorPerimeter | "Floor Perimeter" |
| Public property Static member | LevelDataMassFamilyAndTypeParam | "Mass: Family and Type" |
| Public property Static member | LevelDataMassFamilyParam | "Mass: Family" |
| Public property Static member | LevelDataMassInstanceComments | "Mass: Comments" |
| Public property Static member | LevelDataMassTypeComments | "Mass: Type Comments" |
| Public property Static member | LevelDataMassTypeDescription | "Mass: Description" |
| Public property Static member | LevelDataMassTypeParam | "Mass: Type" |
| Public property Static member | LevelDataOwningLevel | "Level" |
| Public property Static member | LevelDataSpaceUsage | "Usage" |
| Public property Static member | LevelDataSurfaceArea | "Exterior Surface Area" |
| Public property Static member | LevelDataVolume | "Floor Volume" |
| Public property Static member | LevelElev | "Elevation" |
| Public property Static member | LevelHeadTag | "Symbol" |
| Public property Static member | LevelIsBuildingStory | "Building Story" |
| Public property Static member | LevelIsGroundPlane | "Is ground plane" |
| Public property Static member | LevelIsStructural | "Structural" |
| Public property Static member | LevelName | "Level" |
| Public property Static member | LevelParam | "Level" |
| Public property Static member | LevelRelativeBaseType | "Elevation Base" |
| Public property Static member | LevelRoomComputationHeight | "Computation Height" |
| Public property Static member | LevelUpToLevel | "Story Above" |
| Public property Static member | LightingFixtureLamp | "Lamp" |
| Public property Static member | LightingFixtureLightEmitter | "Light Emitter" |
| Public property Static member | LightingFixtureWattage | "Wattage Comments" |
| Public property Static member | LinearDimType | "Dimension String Type" |
| Public property Static member | LinearFramingLength | "Length" |
| Public property Static member | LineColor | "Color" |
| Public property Static member | LinePattern | "Line Pattern" |
| Public property Static member | LinePen | "Line Weight" |
| Public property Static member | LineShapeAtCorner | "Line Shape at Landing Corner" |
| Public property Static member | LoadAllNon0Loads | "All non 0 loads" |
| Public property Static member | LoadAreaArea | "Area" |
| Public property Static member | LoadAreaForceFx1 | "Fx 1" |
| Public property Static member | LoadAreaForceFx2 | "Fx 2" |
| Public property Static member | LoadAreaForceFx3 | "Fx 3" |
| Public property Static member | LoadAreaForceFy1 | "Fy 1" |
| Public property Static member | LoadAreaForceFy2 | "Fy 2" |
| Public property Static member | LoadAreaForceFy3 | "Fy 3" |
| Public property Static member | LoadAreaForceFz1 | "Fz 1" |
| Public property Static member | LoadAreaForceFz2 | "Fz 2" |
| Public property Static member | LoadAreaForceFz3 | "Fz 3" |
| Public property Static member | LoadAreaIsProjected | "Projected Load" |
| Public property Static member | LoadArrowSeparation | "Distance between arrows" |
| Public property Static member | LoadAttrAreaForceScaleFactor | "Area force scale" |
| Public property Static member | LoadAttrForceArrowType | "Force arrowhead" |
| Public property Static member | LoadAttrForceScaleFactor | "Force scale" |
| Public property Static member | LoadAttrLinearForceScaleFactor | "Linear force scale" |
| Public property Static member | LoadAttrMomentArrowArc | "Moment arrowhead" |
| Public property Static member | LoadAttrMomentArrowLine | "Moment arrowhead (alternate)" |
| Public property Static member | LoadAttrMomentScaleFactor | "Moment scale" |
| Public property Static member | LoadCaseId | "Load Case" |
| Public property Static member | LoadCaseName | "Name" |
| Public property Static member | LoadCaseNature | "Nature" |
| Public property Static member | LoadCaseNatureText | "Nature" |
| Public property Static member | LoadCaseNumber | "Case Number" |
| Public property Static member | LoadCaseSubcategory | "Category" |
| Public property Static member | LoadCombinationFactor | "Factor" |
| Public property Static member | LoadCombinationName | "Name" |
| Public property Static member | LoadComments | "Comments" |
| Public property Static member | LoadDescription | "Description" |
| Public property Static member | LoadForceFx | "Fx" |
| Public property Static member | LoadForceFy | "Fy" |
| Public property Static member | LoadForceFz | "Fz" |
| Public property Static member | LoadIsCreatedByApi | "Is created by API" |
| Public property Static member | LoadIsHosted | "Is Hosted" |
| Public property Static member | LoadIsProjected | "Projected Load" |
| Public property Static member | LoadIsReaction | "Is Reaction" |
| Public property Static member | LoadIsUniform | "Uniform Load" |
| Public property Static member | LoadLinearForceFx1 | "Fx 1" |
| Public property Static member | LoadLinearForceFx2 | "Fx 2" |
| Public property Static member | LoadLinearForceFy1 | "Fy 1" |
| Public property Static member | LoadLinearForceFy2 | "Fy 2" |
| Public property Static member | LoadLinearForceFz1 | "Fz 1" |
| Public property Static member | LoadLinearForceFz2 | "Fz 2" |
| Public property Static member | LoadLinearLength | "Length" |
| Public property Static member | LoadMomentMx | "Mx" |
| Public property Static member | LoadMomentMx1 | "Mx 1" |
| Public property Static member | LoadMomentMx2 | "Mx 2" |
| Public property Static member | LoadMomentMy | "My" |
| Public property Static member | LoadMomentMy1 | "My 1" |
| Public property Static member | LoadMomentMy2 | "My 2" |
| Public property Static member | LoadMomentMz | "Mz" |
| Public property Static member | LoadMomentMz1 | "Mz 1" |
| Public property Static member | LoadMomentMz2 | "Mz 2" |
| Public property Static member | LoadNatureName | "Name" |
| Public property Static member | LoadUsageName | "Name" |
| Public property Static member | LoadUseLocalCoordinateSystem | "Orient to" |
| Public property Static member | LockAlignmentUiToggle | "Lock": This is used by the UI to allow selection of lock alignment. |
| Public property Static member | LockedBaseOffset | "Negative Offset" |
| Public property Static member | LockedEndOffset | "Positive Offset" |
| Public property Static member | LockedStartOffset | "Negative Offset" |
| Public property Static member | LockedTopOffset | "Positive Offset" |
| Public property Static member | LowestAssociatedLevel | "Lowest Associated Level": The lowest level associated with this Analytical Element. |
| Public property Static member | LvMullionLeg1 | "Leg 1" |
| Public property Static member | LvMullionLeg2 | "Leg 2" |
| Public property Static member | MarkupsCreated | "Created" |
| Public property Static member | MarkupsCreator | "Creator" |
| Public property Static member | MarkupsHistory | "History" |
| Public property Static member | MarkupsLabel | "Label" |
| Public property Static member | MarkupsModified | "Modified" |
| Public property Static member | MarkupsNotes | "Notes" |
| Public property Static member | MarkupsPrivate | "Private" |
| Public property Static member | MarkupsStatus | "Status" |
| Public property Static member | MassDataConceptualConstruction | "Conceptual Types" |
| Public property Static member | MassDataGlazingIsShaded | "Glazing is Shaded" |
| Public property Static member | MassDataMassExteriorWallArea | "Mass Exterior Wall Area" |
| Public property Static member | MassDataMassInteriorWallArea | "Mass Interior Wall Area" |
| Public property Static member | MassDataMassOpeningArea | "Mass Opening Area" |
| Public property Static member | MassDataMassRoofArea | "Mass Roof Area" |
| Public property Static member | MassDataMassSkylightArea | "Mass Skylight Area" |
| Public property Static member | MassDataMassWindowArea | "Mass Window Area" |
| Public property Static member | MassDataPercentageGlazing | "Target Percentage Glazing" |
| Public property Static member | MassDataPercentageSkylights | "Target Percentage Skylights" |
| Public property Static member | MassDataShadeDepth | "Shade Depth" |
| Public property Static member | MassDataSillHeight | "Target Sill Height" |
| Public property Static member | MassDataSkylightWidth | "Skylight Width & Depth" |
| Public property Static member | MassDataSlab | "Slab" |
| Public property Static member | MassDataSubcategory | "Subcategory" |
| Public property Static member | MassDataSurfaceDataSource | "Values" |
| Public property Static member | MassDataUnderground | "Underground" |
| Public property Static member | MassFloorAreaLevels | "Mass Floors" |
| Public property Static member | MassGrossArea | "Gross Floor Area" |
| Public property Static member | MassGrossSurfaceArea | "Gross Surface Area" |
| Public property Static member | MassGrossVolume | "Gross Volume" |
| Public property Static member | MassingIntegrationLevel | "Constrain to Massing" |
| Public property Static member | MassSurfacedataMaterial | "Graphical Appearance" |
| Public property Static member | MassZoneConditionTypeParam | "Condition Type" |
| Public property Static member | MassZoneFloorArea | "Mass Floor Area" |
| Public property Static member | MassZoneMaterial | "Graphical Appearance" |
| Public property Static member | MassZoneSpaceTypeParam | "Space Type" |
| Public property Static member | MassZoneVolume | "Mass Zone Volume" |
| Public property Static member | MatchlineBottomOffset | "Bottom Offset" |
| Public property Static member | MatchlineBottomPlane | "Bottom Constraint" |
| Public property Static member | MatchlineTopOffset | "Top Offset" |
| Public property Static member | MatchlineTopPlane | "Top Constraint" |
| Public property Static member | MaterialArea | "Area" |
| Public property Static member | MaterialAspaint | "As Paint" |
| Public property Static member | MaterialAssetParamAssetLibId | "Asset library id" |
| Public property Static member | MaterialAssetParamCommonSharedAsset | "Sharing" |
| Public property Static member | MaterialAssetParamExternalMaterialId | "External Material ID" |
| Public property Static member | MaterialAssetParamSource | "Source" |
| Public property Static member | MaterialAssetParamSourceUrl | "Source URL" |
| Public property Static member | MaterialIdParam | "Material" |
| Public property Static member | MaterialName | "Name" |
| Public property Static member | MaterialParamColor | "Color" |
| Public property Static member | MaterialParamGlow | "Glow" |
| Public property Static member | MaterialParamShininess | "Shininess" |
| Public property Static member | MaterialParamSmoothness | "Smoothness" |
| Public property Static member | MaterialParamTransparency | "Transparency" |
| Public property Static member | MaterialVolume | "Volume" |
| Public property Static member | MeasureFromStructure | "Extend into wall (to core)" |
| Public property Static member | MechanicalEquipmentSetIdParam | "Mechanical Equipment Set" |
| Public property Static member | MechanicalEquipmentSetName | "Name" |
| Public property Static member | MechanicalEquipmentSetOnDuty | "On Duty" |
| Public property Static member | MechanicalEquipmentSetOnStandby | "On Standby" |
| Public property Static member | MepAirloopFantype | "Fan" |
| Public property Static member | MepAirloopHeatexchangerType | "Heat Exchanger" |
| Public property Static member | MepAirloopPreheatCoiltype | "Preheat Coil" |
| Public property Static member | MepAnalyticalCriticalpathParam | "Critical Path" |
| Public property Static member | MepAnalyticalElecCurrent | "Current" |
| Public property Static member | MepAnalyticalElecCurrentRating | "Current Rating" |
| Public property Static member | MepAnalyticalElecVoltage | "Voltage" |
| Public property Static member | MepAnalyticalEquipmentName | "Name" |
| Public property Static member | MepAnalyticalLoopBoundaryParam | "Loop Boundary" |
| Public property Static member | MepAnalyticalLoopName | "Name" |
| Public property Static member | MepAnalyticalPipeDesignflow | "Design Flow" |
| Public property Static member | MepChilledWaterLoop | "Chilled Water Loop" |
| Public property Static member | MepCondenserWaterLoop | "Condenser Water Loop" |
| Public property Static member | MepCoolingCoilType | "Cooling Coil" |
| Public property Static member | MepElecZoneEquipmentType | "Equipment Type" |
| Public property Static member | MepEquipmentCalcPipingflowParam | "Calculated Flow" |
| Public property Static member | MepEquipmentCalcPipingpressuredropParam | "Calculated Pressure Drop" |
| Public property Static member | MepEquipmentClassification | "Classification" |
| Public property Static member | MepHeatingCoilType | "Heating Coil" |
| Public property Static member | MepHeatingHotwaterLoop | "Heating Hot Water Loop" |
| Public property Static member | MepIgnoreFlowAnalysis | "Ignore Flow Analysis" |
| Public property Static member | MepLowerBottomElevation | "Lower End Bottom Elevation" |
| Public property Static member | MepLowerBottomElevationIncludeInsulation | "Lower End Bottom of Insulation Elevation" |
| Public property Static member | MepLowerCenterlineElevation | "Lower End Centerline Elevation" |
| Public property Static member | MepLowerTopElevation | "Lower End Top Elevation" |
| Public property Static member | MepLowerTopElevationIncludeInsulation | "Lower End Top of Insulation Elevation" |
| Public property Static member | MepPipeLowerInvertElevation | "Lower End Invert Elevation" |
| Public property Static member | MepPipeLowerObvertElevation | "Lower End Obvert Elevation" |
| Public property Static member | MepPipeUpperInvertElevation | "Upper End Invert Elevation" |
| Public property Static member | MepPipeUpperObvertElevation | "Upper End Obvert Elevation" |
| Public property Static member | MepPreheatHotwaterLoop | "Preheat Hot Water Loop" |
| Public property Static member | MepProfileTypeParam | "Shape" |
| Public property Static member | MepReheatCoilType | "Reheat Coil" |
| Public property Static member | MepReheatHotwaterLoop | "Reheat Hot Water Loop" |
| Public property Static member | MepSpotBottomElevation | "Spot Bottom Elevation": used for both design and fabrication components |
| Public property Static member | MepSpotBottomElevationIncludeInsulation | "Spot Bottom of Insulation Elevation" |
| Public property Static member | MepSpotCenterlineElevation | "Spot Centerline Elevation": used for both design and fabrication components |
| Public property Static member | MepSpotTopElevation | "Spot Top Elevation": used for both design and fabrication components |
| Public property Static member | MepSpotTopElevationIncludeInsulation | "Spot Top of Insulation Elevation" |
| Public property Static member | MepSystemFillGraphicsOverridesParam | "Fill Pattern Graphics Overrides" |
| Public property Static member | MepSystemLineGraphicsOverridesParam | "Graphic Overrides" |
| Public property Static member | MepUpperBottomElevation | "Upper End Bottom Elevation" |
| Public property Static member | MepUpperBottomElevationIncludeInsulation | "Upper End Bottom of Insulation Elevation" |
| Public property Static member | MepUpperCenterlineElevation | "Upper End Centerline Elevation" |
| Public property Static member | MepUpperTopElevation | "Upper End Top Elevation" |
| Public property Static member | MepUpperTopElevationIncludeInsulation | "Upper End Top of Insulation Elevation" |
| Public property Static member | MepVrfLoop | "Variable Refrigerant Flow Loop" |
| Public property Static member | MepWaterloopChillertype | "Chiller Type" |
| Public property Static member | MepWaterloopType | "Loop Type" |
| Public property Static member | MepZoneAirLoop | "Air System" |
| Public property Static member | MepZoneEquipment | "Zone Equipment" |
| Public property Static member | MepZoneEquipmentBehavior | "Behavior" |
| Public property Static member | MepZoneEquipmentDrawVentilation | "Draw Ventilation" |
| Public property Static member | MepZoneEquipmentType | "Equipment Type" |
| Public property Static member | MepZoneHotwaterLoop | "Heating Hot Water Loop" |
| Public property Static member | ModelCategoryIdParam | "Subcategory" |
| Public property Static member | ModelGraphicsStyle | "Visual Style" |
| Public property Static member | ModelGraphicsStyleAnonDraft | "Visual Style" |
| Public property Static member | ModelOrSymbolic | "Model or Symbolic" |
| Public property Static member | ModelTextSize | "Text Size" |
| Public property Static member | MovesWithGridParam | "Moves With Grids": Disable attachment from grids. |
| Public property Static member | MullionAngle | "Angle" |
| Public property Static member | MullionCornerType | "Corner Mullion" |
| Public property Static member | MullionDepth | "Depth" |
| Public property Static member | MullionDepth1 | "Depth 1" |
| Public property Static member | MullionDepth2 | "Depth 2" |
| Public property Static member | MullionFamType | "Mullion Family General Shape" |
| Public property Static member | MullionOffset | "Offset" |
| Public property Static member | MullionPosition | "Position" |
| Public property Static member | MullionProfile | "Profile" |
| Public property Static member | MultipleAlignmentUiToggle | "Multiple Alignment": This is used by the UI to allow selection of multiple elements. |
| Public property Static member | MultiReferenceAnnotationDimensionStyle | "Dimension Style" |
| Public property Static member | MultiReferenceAnnotationGroupTagHeads | "Group Matching Tag Heads" |
| Public property Static member | MultiReferenceAnnotationReferenceCategory | "Reference Category" |
| Public property Static member | MultiReferenceAnnotationShowDimensionText | "Show Dimension Text" |
| Public property Static member | MultiReferenceAnnotationTagType | "Tag Family" |
| Public property Static member | MultistoryStairsActualTreadDepth | "Actual Tread Depth" |
| Public property Static member | MultistoryStairsRefLevel | "Reference Level": The reference level of stairs |
| Public property Static member | NodeConnectionStatus | "Connection Status" |
| Public property Static member | NumberPartitionParam | "Partition" |
| Public property Static member | NumberSystemDisplayRule | "Display Rule" |
| Public property Static member | NumberSystemJustify | "Justify" |
| Public property Static member | NumberSystemJustifyOffset | "Justify Offset" |
| Public property Static member | NumberSystemOrientation | "Orientation" |
| Public property Static member | NumberSystemReference | "Reference" |
| Public property Static member | NumberSystemReferenceOffset | "Offset from Reference" |
| Public property Static member | NumberSystemTagType | "Tag Type" |
| Public property Static member | NumberSystemTextSize | "Number Size" |
| Public property Static member | ObjectStyleMaterialIdParam | "Object Style Material" |
| Public property Static member | OffsetfacesShowShapeHandles | "Show Shape Handles" |
| Public property Static member | OffsetFromReferenceBase | "Offset from Reference Base" |
| Public property Static member | OmniclassCode | "OmniClass Number" |
| Public property Static member | OmniclassDescription | "OmniClass Title" |
| Public property Static member | OptionName | "Name" |
| Public property Static member | OptionSetId | "Design Option Set Id" |
| Public property Static member | OptionSetName | "Name" |
| Public property Static member | OrdinateDimSetting | "Ordinate Dimension Settings" |
| Public property Static member | OrientByView | "Rotate With Text" |
| Public property Static member | OvalFramingHeight | "Oval Height" |
| Public property Static member | OvalFramingWidth | "Oval Width" |
| Public property Static member | PaddingLength | "Padding" |
| Public property Static member | PanelScheduleName | "Panel Schedule Name" |
| Public property Static member | PartMakerDivisionProfileOffset | "Profile Offset" |
| Public property Static member | PartmakerParamDivisionGap | "Gap" |
| Public property Static member | PartMakerSplitterProfile | "Division Profile" |
| Public property Static member | PartMakerSplitterProfileEdgeMatch | "Edge Match" |
| Public property Static member | PartMakerSplitterProfileFlipAcross | "Profile Across Flip" |
| Public property Static member | PartMakerSplitterProfileFlipAlong | "Profile Along Flip" |
| Public property Static member | PathOfTravelFromRoom | "From Room" |
| Public property Static member | PathOfTravelLevelName | "Level" |
| Public property Static member | PathOfTravelSpeed | "Speed" |
| Public property Static member | PathOfTravelTime | "Time" |
| Public property Static member | PathOfTravelToRoom | "To Room" |
| Public property Static member | PathOfTravelViewName | "View Name" |
| Public property Static member | PathReinAddlOffset | "Additional Offset" |
| Public property Static member | PathReinAlternating | "Alternating Bars" |
| Public property Static member | PathReinAltOffset | "Alternating Bar - Offset" |
| Public property Static member | PathReinEndHookOrient1Slab | "Primary Bar - End Hook Orientation" |
| Public property Static member | PathReinEndHookOrient1Wall | "Primary Bar - End Hook Orientation" |
| Public property Static member | PathReinEndHookOrient2Slab | "Alternating Bar - End Hook Orientation" |
| Public property Static member | PathReinEndHookOrient2Wall | "Alternating Bar - End Hook Orientation" |
| Public property Static member | PathReinEndHookTypen1 | "Primary Bar - End Hook Type" |
| Public property Static member | PathReinEndHookTypen2 | "Alternating Bar - End Hook Type" |
| Public property Static member | PathReinEndSpanhookAlt | "End Hook Angle Alternating" |
| Public property Static member | PathReinEndSpanhookPrim | "End Hook Angle Primary" |
| Public property Static member | PathReinFaceSlab | "Face" |
| Public property Static member | PathReinFaceWall | "Face" |
| Public property Static member | PathReinHookOrient1Slab | "Primary Bar - Hook Orientation" |
| Public property Static member | PathReinHookOrient1Wall | "Primary Bar - Hook Orientation" |
| Public property Static member | PathReinHookOrient2Slab | "Alternating Bar - Hook Orientation" |
| Public property Static member | PathReinHookOrient2Wall | "Alternating Bar - Hook Orientation" |
| Public property Static member | PathReinHookTypen1 | "Primary Bar - Start Hook Type" |
| Public property Static member | PathReinHookTypen2 | "Alternating Bar - Start Hook Type" |
| Public property Static member | PathReinLengthn1 | "Primary Bar - Length" |
| Public property Static member | PathReinLengthn2 | "Alternating Bar - Length" |
| Public property Static member | PathReinNumberOfBars | "Number Of Bars" |
| Public property Static member | PathReinShapen1 | "Primary Bar - Shape" |
| Public property Static member | PathReinShapen2 | "Alternating Bar - Shape" |
| Public property Static member | PathReinSpacing | "Bar Spacing" |
| Public property Static member | PathReinSpanhookAlt | "Start Hook Angle Alternating" |
| Public property Static member | PathReinSpanhookPrim | "Start Hook Angle Primary" |
| Public property Static member | PathReinSpanlengthAltOffset | "Offset" |
| Public property Static member | PathReinSpanlengthBarlengthAlt | "Length (Alternating Bar)" |
| Public property Static member | PathReinSpanlengthBarlengthPrim | "Length (Primary Bar)" |
| Public property Static member | PathReinSpanlengthBottomAlt | "Bottom (Alternating Bar)" |
| Public property Static member | PathReinSpanlengthBottomPrim | "Bottom (Primary Bar)" |
| Public property Static member | PathReinSpanlengthTopAlt | "Top (Alternating Bar)" |
| Public property Static member | PathReinSummary | "Summary" |
| Public property Static member | PathReinTypen1 | "Primary Bar - Type" |
| Public property Static member | PathReinTypen2 | "Alternating Bar - Type" |
| Public property Static member | PatternIndent1ForDivisionRule | "Indent 1" |
| Public property Static member | PatternIndent2ForDivisionRule | "Indent 2" |
| Public property Static member | PatternMirrorForDivisionRule | "Mirror" |
| Public property Static member | PeakAirflowParam | "Peak Airflow" |
| Public property Static member | PeakCoolingLoadParam | "Peak Cooling Load" |
| Public property Static member | PeakHeatingLoadParam | "Peak Heating Load" |
| Public property Static member | PeakLatentCoolingLoad | "Peak Latent Cooling Load" |
| Public property Static member | PhaseCreated | "Phase Created" |
| Public property Static member | PhaseDemolished | "Phase Demolished" |
| Public property Static member | PhaseName | "Name" |
| Public property Static member | PhaseSequenceNumber | "Sequence Number" |
| Public property Static member | PhyMaterialParamAverageModulus | "Average Modulus" |
| Public property Static member | PhyMaterialParamBehavior | "Behavior" |
| Public property Static member | PhyMaterialParamBending | "Bending" |
| Public property Static member | PhyMaterialParamBendingReinforcement | "Bending reinforcement" |
| Public property Static member | PhyMaterialParamClass | "Class" |
| Public property Static member | PhyMaterialParamCompressionParallel | "Compression parallel to grain" |
| Public property Static member | PhyMaterialParamCompressionPerpendicular | "Compression perpendicular to grain" |
| Public property Static member | PhyMaterialParamConcreteCompression | "Concrete compression" |
| Public property Static member | PhyMaterialParamExpCoeff | "Thermal expansion coefficient" |
| Public property Static member | PhyMaterialParamExpCoeff1 | "Thermal expansion coefficient X" |
| Public property Static member | PhyMaterialParamExpCoeff2 | "Thermal expansion coefficient Y" |
| Public property Static member | PhyMaterialParamExpCoeff3 | "Thermal expansion coefficient Z" |
| Public property Static member | PhyMaterialParamExpCoeffn1 | "Thermal Expansion Coefficient 1" |
| Public property Static member | PhyMaterialParamExpCoeffn2 | "Thermal Expansion Coefficient 2" |
| Public property Static member | PhyMaterialParamFivepercentModulusOfElacticity | "5% Modulus of Elasticity" |
| Public property Static member | PhyMaterialParamGrade | "Grade" |
| Public property Static member | PhyMaterialParamLightWeight | "Lightweight" |
| Public property Static member | PhyMaterialParamMinimumTensileStrength | "Minimum tensile strength" |
| Public property Static member | PhyMaterialParamMinimumYieldStress | "Minimum yield stress" |
| Public property Static member | PhyMaterialParamPoissonMod | "Poisson ratio" |
| Public property Static member | PhyMaterialParamPoissonMod1 | "Poisson ratio X" |
| Public property Static member | PhyMaterialParamPoissonMod12 | "Poisson Ratio 12" |
| Public property Static member | PhyMaterialParamPoissonMod2 | "Poisson ratio Y" |
| Public property Static member | PhyMaterialParamPoissonMod23 | "Poisson Ratio 23" |
| Public property Static member | PhyMaterialParamPoissonMod3 | "Poisson ratio Z" |
| Public property Static member | PhyMaterialParamReductionFactor | "Reduction factor for shear" |
| Public property Static member | PhyMaterialParamResistanceCalcStrength | "Resistance calculation strength" |
| Public property Static member | PhyMaterialParamShearMod | "Shear modulus" |
| Public property Static member | PhyMaterialParamShearMod1 | "Shear modulus X" |
| Public property Static member | PhyMaterialParamShearMod12 | "Shear Modulus 12" |
| Public property Static member | PhyMaterialParamShearMod2 | "Shear modulus Y" |
| Public property Static member | PhyMaterialParamShearMod3 | "Shear modulus Z" |
| Public property Static member | PhyMaterialParamShearParallel | "Shear parallel to grain" |
| Public property Static member | PhyMaterialParamShearPerpendicular | "Tension perpendicular to grain" |
| Public property Static member | PhyMaterialParamShearReinforcement | "Shear reinforcement yield stress" |
| Public property Static member | PhyMaterialParamShearStrengthReduction | "Shear strength modification" |
| Public property Static member | PhyMaterialParamSpecies | "Species" |
| Public property Static member | PhyMaterialParamStructuralDensity | "Density" |
| Public property Static member | PhyMaterialParamStructuralSpecificHeat | "Specific Heat" |
| Public property Static member | PhyMaterialParamStructuralThermalTreated | "Thermally Treated" |
| Public property Static member | PhyMaterialParamSubclass | "Subclass" |
| Public property Static member | PhyMaterialParamTensionParallel | "Tension Parallel to Grain" |
| Public property Static member | PhyMaterialParamTensionPerpendicular | "Tension Perpendicular to Grain" |
| Public property Static member | PhyMaterialParamThermalConductivity | "Thermal Conductivity" |
| Public property Static member | PhyMaterialParamThermalConductivityX | "Thermal Conductivity X" |
| Public property Static member | PhyMaterialParamThermalConductivityY | "Thermal Conductivity Y" |
| Public property Static member | PhyMaterialParamThermalConductivityZ | "Thermal Conductivity Z" |
| Public property Static member | PhyMaterialParamType | "Material Type" |
| Public property Static member | PhyMaterialParamUnitWeight | "Unit weight" |
| Public property Static member | PhyMaterialParamWoodConstruction | "Construction" |
| Public property Static member | PhyMaterialParamYoungMod | "Young modulus" |
| Public property Static member | PhyMaterialParamYoungMod1 | "Young modulus X" |
| Public property Static member | PhyMaterialParamYoungMod2 | "Young modulus Y" |
| Public property Static member | PhyMaterialParamYoungMod3 | "Young modulus Z" |
| Public property Static member | PhyMaterialParamYoungModn1 | "Young's Modulus 1" |
| Public property Static member | PhyMaterialParamYoungModn2 | "Young's Modulus 2" |
| Public property Static member | PhyMaterialProperties | "Properties" |
| Public property Static member | PipingConnectionType | "Connection Type" |
| Public property Static member | PipingGenderType | "Gender Type" |
| Public property Static member | PlanRegionViewRange | "View Range" |
| Public property Static member | PlanViewCutPlaneHeight | "Cut Plane Height" |
| Public property Static member | PlanViewLevel | "Associated Level" |
| Public property Static member | PlanViewNorth | "Orientation" |
| Public property Static member | PlanViewRange | "View Range" |
| Public property Static member | PlanViewTopClipHeight | "Top Clip Height" |
| Public property Static member | PlanViewViewDir | "View Direction" |
| Public property Static member | PlumbingFixturesCwConnection | "CW Connection" |
| Public property Static member | PlumbingFixturesDrain | "Drain" |
| Public property Static member | PlumbingFixturesHwConnection | "HW Connection" |
| Public property Static member | PlumbingFixturesSupplyFitting | "Supply Fitting" |
| Public property Static member | PlumbingFixturesSupplyPipe | "Supply Pipe" |
| Public property Static member | PlumbingFixturesTrap | "Trap" |
| Public property Static member | PlumbingFixturesVentConnection | "Vent Connection" |
| Public property Static member | PlumbingFixturesWasteConnection | "Waste Connection" |
| Public property Static member | PocheMatId | "Coarse Poche Material" |
| Public property Static member | PointAdaptiveConstrained | "Constrained" |
| Public property Static member | PointAdaptiveNumParam | "Number" |
| Public property Static member | PointAdaptiveOrientationType | "Orients to" |
| Public property Static member | PointAdaptiveShowNumber | "Show Placement Number" |
| Public property Static member | PointAdaptiveTypeParam | "Point" |
| Public property Static member | PointcloudinstanceName | "Name": The name of the instance as it will show in the Property Palette |
| Public property Static member | PointcloudtypeScale | "Scale": The scale for this instance |
| Public property Static member | PointElementAngle | "Angle" |
| Public property Static member | PointElementChordLength | "Chord Length" |
| Public property Static member | PointElementDriven | "Driven by Host" |
| Public property Static member | PointElementDriving | "Driving Curve(s)" |
| Public property Static member | PointElementHostedOnFaceUParam | "Hosted U Parameter" |
| Public property Static member | PointElementHostedOnFaceVParam | "Hosted V Parameter" |
| Public property Static member | PointElementHostedParam | "Hosted Parameter" |
| Public property Static member | PointElementMeasureFrom | "Measure From" |
| Public property Static member | PointElementMeasurementType | "Measurement Type" |
| Public property Static member | PointElementMirrored | "Mirrored" |
| Public property Static member | PointElementNonNormalizedCurveParamater | "Non-Normalized Curve Parameter" |
| Public property Static member | PointElementNormalizedCurveParamater | "Normalized Curve Parameter" |
| Public property Static member | PointElementNormalizedSegmentLength | "Normalized Segment Length" |
| Public property Static member | PointElementOffset | "Offset" |
| Public property Static member | PointElementRotationAngle | "Rotation Angle" |
| Public property Static member | PointElementSegmentLength | "Segment Length" |
| Public property Static member | PointElementShowNormalPlaneOnly | "Show Normal Reference Plane Only" |
| Public property Static member | PointElementShowPlanes | "Show Reference Planes" |
| Public property Static member | PointElementZflipped | "Flipped" |
| Public property Static member | PointElevation | "Elevation" |
| Public property Static member | PointFlexibleConstrained | "Constrained" |
| Public property Static member | PointFlexibleNumParam | "Number" |
| Public property Static member | PointFlexibleOrientationType | "Orientation" |
| Public property Static member | PointFlexibleShowNumber | "Show Placement Number" |
| Public property Static member | PointNameParam | "Name" |
| Public property Static member | PointVisibilityParam | "Visibility/Graphics Overrides" |
| Public property Static member | PreferDimSideUiFilter | "Prefer:": This is used by the UI to allow select prefer dimension side. |
| Public property Static member | PrimaryOptionId | "Primary Option Id" |
| Public property Static member | Profile1Angle | "Angle" |
| Public property Static member | Profile1FamType | "Profile" |
| Public property Static member | Profile1FlippedHor | "Profile Is Flipped" |
| Public property Static member | Profile1OffsetX | "Horizontal Profile Offset" |
| Public property Static member | Profile1OffsetY | "Vertical Profile Offset" |
| Public property Static member | Profile2Angle | "Angle" |
| Public property Static member | Profile2FamType | "Profile" |
| Public property Static member | Profile2FlippedHor | "Profile Is Flipped" |
| Public property Static member | Profile2OffsetX | "Horizontal Profile Offset" |
| Public property Static member | Profile2OffsetY | "Vertical Profile Offset" |
| Public property Static member | ProfileAngle | "Angle" |
| Public property Static member | ProfileFamType | "Profile" |
| Public property Static member | ProfileFamTypePlusNone | "Profile" |
| Public property Static member | ProfileFlippedHor | "Profile Is Flipped" |
| Public property Static member | ProfileOffsetX | "Horizontal Profile Offset" |
| Public property Static member | ProfileOffsetY | "Vertical Profile Offset" |
| Public property Static member | ProfileParamAlongPath | "Parameter along path" |
| Public property Static member | ProjectAddress | "Project Address" |
| Public property Static member | ProjectAuthor | "Author" |
| Public property Static member | ProjectBuildingName | "Building Name" |
| Public property Static member | ProjectBuildingType | "Building Type" |
| Public property Static member | ProjectedSurfaceArea | "Projected Area" |
| Public property Static member | ProjectIssueDate | "Project Issue Date" |
| Public property Static member | ProjectName | "Project Name" |
| Public property Static member | ProjectNumber | "Project Number" |
| Public property Static member | ProjectOrganizationDescription | "Organization Description" |
| Public property Static member | ProjectOrganizationName | "Organization Name" |
| Public property Static member | ProjectPostalCode | "Postal Code" |
| Public property Static member | ProjectRevisionEnumeration | "Numbering" |
| Public property Static member | ProjectRevisionRevisionDate | "Revision Date" |
| Public property Static member | ProjectRevisionRevisionDescription | "Revision Description" |
| Public property Static member | ProjectRevisionRevisionIssued | "Issued" |
| Public property Static member | ProjectRevisionRevisionIssuedBy | "Issued by" |
| Public property Static member | ProjectRevisionRevisionIssuedTo | "Issued to" |
| Public property Static member | ProjectRevisionRevisionNum | "Revision Number" |
| Public property Static member | ProjectRevisionSequenceNum | "Revision Sequence": read\_only Make this read-only again when NewSchedules\_DisplayTags is cleaned up |
| Public property Static member | ProjectStatus | "Project Status" |
| Public property Static member | PropertyArea | "Area" |
| Public property Static member | PropertyAreaOpen | "Area" |
| Public property Static member | PropertyAreaUnits | "Area Units, Format" |
| Public property Static member | PropertyLengthUnits | "Units Format" |
| Public property Static member | PropertySegmentBearing | "Bearing" |
| Public property Static member | PropertySegmentDistance | "Distance" |
| Public property Static member | PropertySegmentEW | "E/W" |
| Public property Static member | PropertySegmentLR | "L/R" |
| Public property Static member | PropertySegmentNS | "N/S" |
| Public property Static member | PropertySegmentRadius | "Radius" |
| Public property Static member | PropertySegmentSubcategoryId | "Subcategory" |
| Public property Static member | PropertySetDescription | "Description" |
| Public property Static member | PropertySetKeywords | "Keywords" |
| Public property Static member | PropertySetMaterialAspect | "Material aspect" |
| Public property Static member | PropertySetName | "Property Set Name" |
| Public property Static member | PropertySubcategoryId | "Subcategory" |
| Public property Static member | RadialArrayArcRadius | "Radius" |
| Public property Static member | RadiusSymbolLocation | "Radius Symbol Location" |
| Public property Static member | RadiusSymbolText | "Radius Symbol Text" |
| Public property Static member | RailingSystemHandrailsHeightParam | "Height" |
| Public property Static member | RailingSystemHandrailsLatteralOffset | "Lateral Offset" |
| Public property Static member | RailingSystemHandrailsPositionParam | "Position" |
| Public property Static member | RailingSystemHandrailsTypesParam | "Type" |
| Public property Static member | RailingSystemHasTopRail | "Use Top Rail": Whether railing has top rail |
| Public property Static member | RailingSystemSecondaryHandrailsHeightParam | "Height" |
| Public property Static member | RailingSystemSecondaryHandrailsLatteralOffset | "Lateral Offset" |
| Public property Static member | RailingSystemSecondaryHandrailsPositionParam | "Position" |
| Public property Static member | RailingSystemSecondaryHandrailsTypesParam | "Type" |
| Public property Static member | RailingSystemTopRailHeightParam | "Height" |
| Public property Static member | RailingSystemTopRailTypesParam | "Type" |
| Public property Static member | RampAttrLeftBalusterAttachPt | "Left Baluster Location" |
| Public property Static member | RampAttrMaterial | "Ramp Material" |
| Public property Static member | RampAttrMinInvSlope | "Ramp Max Slope (1/x)" |
| Public property Static member | RampAttrRightBalusterAttachPt | "Right Baluster Location" |
| Public property Static member | RampAttrShape | "Shape" |
| Public property Static member | RampAttrTextFont | "Text Font" |
| Public property Static member | RampAttrTextSize | "Text Size" |
| Public property Static member | RampAttrThickness | "Thickness" |
| Public property Static member | RampMaxRunLength | "Maximum Incline Length" |
| Public property Static member | RasterEnableSnaps | "Enable Snaps" |
| Public property Static member | RasterHorizontalScale | "Horizontal Scale" |
| Public property Static member | RasterLockProportions | "Lock Proportions" |
| Public property Static member | RasterSheetheight | "Height" |
| Public property Static member | RasterSheetwidth | "Width" |
| Public property Static member | RasterSymbolFilename | "Loaded from file" |
| Public property Static member | RasterSymbolHeight | "Height" |
| Public property Static member | RasterSymbolLinkloadStatus | "Link Status" |
| Public property Static member | RasterSymbolPagenumber | "Page Number" |
| Public property Static member | RasterSymbolPixelheight | "Height (pixels)" |
| Public property Static member | RasterSymbolPixelwidth | "Width (pixels)" |
| Public property Static member | RasterSymbolResolution | "Resolution (dpi)" |
| Public property Static member | RasterSymbolViewname | "View Name" |
| Public property Static member | RasterSymbolWidth | "Width" |
| Public property Static member | RasterVerticalScale | "Vertical Scale" |
| Public property Static member | RbsAdditionalFlow | "Additional Flow" |
| Public property Static member | RbsAdjustableConnector | "Allow Slope Adjustments" |
| Public property Static member | RbsAreaBasedLoadType | "Area Based Load Type" |
| Public property Static member | RbsBuildingConstructionclass | "Building Infiltration Class" |
| Public property Static member | RbsBuildingUseloadcredits | "Use Load Credits" |
| Public property Static member | RbsCabletrayBendradius | "Bend Radius" |
| Public property Static member | RbsCabletrayconduitBendorfitting | "Bend or Fitting" |
| Public property Static member | RbsCabletrayconduitConnectorelemType | "Connector Type" |
| Public property Static member | RbsCabletrayconduitrunLengthParam | "Length" |
| Public property Static member | RbsCabletrayconduitSystemType | "System Type" |
| Public property Static member | RbsCabletrayHeightParam | "Height" |
| Public property Static member | RbsCabletrayRungheight | "Rung Height" |
| Public property Static member | RbsCabletrayRungspace | "Rung Space" |
| Public property Static member | RbsCabletrayRungwidth | "Rung Width" |
| Public property Static member | RbsCabletrayrunHeightParam | "Height" |
| Public property Static member | RbsCabletrayrunWidthParam | "Width" |
| Public property Static member | RbsCabletrayShapetype | "Shape" |
| Public property Static member | RbsCabletrayThickness | "Thickness" |
| Public property Static member | RbsCabletrayWidthParam | "Width" |
| Public property Static member | RbsCalculatedSize | "Size" |
| Public property Static member | RbsComponentClassificationParam | "Component Classification" |
| Public property Static member | RbsConduitBendradius | "Bend Radius" |
| Public property Static member | RbsConduitDiameterParam | "Diameter(Trade Size)" |
| Public property Static member | RbsConduitInnerDiamParam | "Inside Diameter" |
| Public property Static member | RbsConduitOuterDiamParam | "Outside Diameter" |
| Public property Static member | RbsConduitrunDiameterParam | "Diameter(Trade Size)" |
| Public property Static member | RbsConduitrunInnerDiamParam | "Inside Diameter" |
| Public property Static member | RbsConduitrunOuterDiamParam | "Outside Diameter" |
| Public property Static member | RbsConduitTradesize | "Conduit Size Lookup" |
| Public property Static member | RbsConnectorDescription | "Connector Description" |
| Public property Static member | RbsConnectorIsprimary | "Primary Connector" |
| Public property Static member | RbsConnectorOffsetObsolete | "Connector Offset" |
| Public property Static member | RbsConstructionSetParam | "Schematic Types" |
| Public property Static member | RbsConstructionTypeShadingfactorParam | "Internal Shading Factor" |
| Public property Static member | RbsCtcBottomElevation | "Lower End Bottom Elevation" |
| Public property Static member | RbsCtcServiceType | "Service Type" |
| Public property Static member | RbsCtcTopElevation | "Upper End Top Elevation" |
| Public property Static member | RbsCurveDiameterParam | "Diameter" |
| Public property Static member | RbsCurveHeightParam | "Height" |
| Public property Static member | RbsCurveHorOffsetParam | "Horizontal Justification" |
| Public property Static member | RbsCurveSlope | "Slope Percentage (%)" |
| Public property Static member | RbsCurveSurfaceArea | "Area" |
| Public property Static member | RbsCurvetypeDefaultBendParam | "Bend" |
| Public property Static member | RbsCurvetypeDefaultCapParam | "Cap" |
| Public property Static member | RbsCurvetypeDefaultCrossParam | "Cross" |
| Public property Static member | RbsCurvetypeDefaultElbowdownParam | "Vertical Outside Bend" |
| Public property Static member | RbsCurvetypeDefaultElbowParam | "Elbow" |
| Public property Static member | RbsCurvetypeDefaultElbowupParam | "Vertical Inside Bend" |
| Public property Static member | RbsCurvetypeDefaultHorizontalBendParam | "Horizontal Bend" |
| Public property Static member | RbsCurvetypeDefaultMechjointParam | "Flange" |
| Public property Static member | RbsCurvetypeDefaultTakeoffParam | "Tap" |
| Public property Static member | RbsCurvetypeDefaultTeedownParam | "Tee Down" |
| Public property Static member | RbsCurvetypeDefaultTeeParam | "Tee" |
| Public property Static member | RbsCurvetypeDefaultTeeupParam | "Tee Up" |
| Public property Static member | RbsCurvetypeDefaultTransitionParam | "Transition" |
| Public property Static member | RbsCurvetypeDefaultUnionParam | "Union" |
| Public property Static member | RbsCurvetypeMaxHeightParam | "Max Height" |
| Public property Static member | RbsCurvetypeMaxWidthParam | "Max Width" |
| Public property Static member | RbsCurvetypeMultishapeTransitionOvalroundParam | "Multi Shape Transition Oval to Round" |
| Public property Static member | RbsCurvetypeMultishapeTransitionParam | "Multi Shape Transition Rect to Round" |
| Public property Static member | RbsCurvetypeMultishapeTransitionRectovalParam | "Multi Shape Transition Rect to Oval" |
| Public property Static member | RbsCurvetypePreferredBranchParam | "Preferred Junction Type" |
| Public property Static member | RbsCurvetypeRoughnessParam | "Roughness" |
| Public property Static member | RbsCurveUtslope | "Slope" |
| Public property Static member | RbsCurveVertOffsetParam | "Vertical Justification" |
| Public property Static member | RbsCurveWidthParam | "Width" |
| Public property Static member | RbsDistributionsysConfigParam | "Configuration" |
| Public property Static member | RbsDistributionsysNumwiresParam | "Wires" |
| Public property Static member | RbsDistributionsysPhaseParam | "Phase" |
| Public property Static member | RbsDistributionsysVlgParam | "Line to Ground Voltage" |
| Public property Static member | RbsDistributionsysVllParam | "Line to Line Voltage" |
| Public property Static member | RbsDuctBottomElevation | "Lower End Bottom Elevation" |
| Public property Static member | RbsDuctCalculatedSize | "Duct Size" |
| Public property Static member | RbsDuctConnectorSystemClassificationParam | "System Classification" |
| Public property Static member | RbsDuctFittingLossMethodParam | "Loss Method" |
| Public property Static member | RbsDuctFittingLossMethodServerParam | "Loss Method" |
| Public property Static member | RbsDuctFittingLossMethodSettings | "Loss Method Settings" |
| Public property Static member | RbsDuctFittingLossTableParam | "ASHRAE Table" |
| Public property Static member | RbsDuctFlowConfigurationParam | "Flow Configuration" |
| Public property Static member | RbsDuctFlowDirectionParam | "Flow Direction" |
| Public property Static member | RbsDuctFlowParam | "Flow" |
| Public property Static member | RbsDuctPipeSystemAbbreviationParam | "System Abbreviation" |
| Public property Static member | RbsDuctPressureDrop | "Pressure Drop" |
| Public property Static member | RbsDuctRoutingPreferenceParam | "Routing Preferences" |
| Public property Static member | RbsDuctSizeFormattedParam | "Size" |
| Public property Static member | RbsDuctSlope | "Slope" |
| Public property Static member | RbsDuctStaticPressure | "Static Pressure" |
| Public property Static member | RbsDuctSystemCalculationParam | "Calculations" |
| Public property Static member | RbsDuctSystemTypeParam | "System Type" |
| Public property Static member | RbsDuctTopElevation | "Upper End Top Elevation" |
| Public property Static member | RbsDuctTypeParam | "Duct Type" |
| Public property Static member | RbsElecAmbientTemperature | "Ambient Temperature" |
| Public property Static member | RbsElecAnalyticalFeederLength | "Length" |
| Public property Static member | RbsElecAnalyticalLevelId | "Level" |
| Public property Static member | RbsElecAnalyticalLoadDensity | "Power Density" |
| Public property Static member | RbsElecAnalyticalLoadNameParam | "Name" |
| Public property Static member | RbsElecAnalyticalLoadSetOnDuty | "Quantity of Prime" |
| Public property Static member | RbsElecAnalyticalLoadSetOnStandby | "Quantity of Standby" |
| Public property Static member | RbsElecAnalyticalLoadsInSet | "Loads in Set" |
| Public property Static member | RbsElecAnalyticalLoadTypeParam | "Load Type" |
| Public property Static member | RbsElecApparentCurrentParam | "Apparent Current" |
| Public property Static member | RbsElecApparentCurrentPhaseaParam | "Apparent Current Phase A" |
| Public property Static member | RbsElecApparentCurrentPhasebParam | "Apparent Current Phase B" |
| Public property Static member | RbsElecApparentCurrentPhasecParam | "Apparent Current Phase C" |
| Public property Static member | RbsElecApparentLoad | "Apparent Load" |
| Public property Static member | RbsElecApparentLoadPhase1 | "Apparent Load Phase 1" |
| Public property Static member | RbsElecApparentLoadPhase2 | "Apparent Load Phase 2" |
| Public property Static member | RbsElecApparentLoadPhase3 | "Apparent Load Phase 3" |
| Public property Static member | RbsElecApparentLoadPhasea | "Apparent Load Phase A" |
| Public property Static member | RbsElecApparentLoadPhaseb | "Apparent Load Phase B" |
| Public property Static member | RbsElecApparentLoadPhasec | "Apparent Load Phase C" |
| Public property Static member | RbsElecApparentPowerDensity | "Apparent Power Density" |
| Public property Static member | RbsElecBalancedLoad | "Balanced Load" |
| Public property Static member | RbsElecCalcCoefficientUtilization | "Calculate Coefficient of Utilization" |
| Public property Static member | RbsElecCircuitConnectionTypeParam | "Connection Type" |
| Public property Static member | RbsElecCircuitFrameParam | "Frame" |
| Public property Static member | RbsElecCircuitLengthParam | "Length" |
| Public property Static member | RbsElecCircuitName | "Load Name" |
| Public property Static member | RbsElecCircuitNaming | "Circuit Naming" |
| Public property Static member | RbsElecCircuitNamingIndex | "Circuit Naming Index" |
| Public property Static member | RbsElecCircuitNotesParam | "Schedule Circuit Notes" |
| Public property Static member | RbsElecCircuitNumber | "Circuit Number" |
| Public property Static member | RbsElecCircuitNumberingType | "Circuit Numbering Option" |
| Public property Static member | RbsElecCircuitNumberOfElementsParam | "Number of Elements" |
| Public property Static member | RbsElecCircuitPanelParam | "Panel" |
| Public property Static member | RbsElecCircuitPathModeParam | "Path Mode" |
| Public property Static member | RbsElecCircuitPathOffsetParam | "Offset" |
| Public property Static member | RbsElecCircuitPrefix | "Circuit Prefix" |
| Public property Static member | RbsElecCircuitPrefixSeparator | "Circuit Prefix Separator" |
| Public property Static member | RbsElecCircuitRatingParam | "Rating" |
| Public property Static member | RbsElecCircuitSlotIndex | "Slot Index" |
| Public property Static member | RbsElecCircuitStartSlot | "Start Slot" |
| Public property Static member | RbsElecCircuitType | "System Type" |
| Public property Static member | RbsElecCircuitWireNumGroundsParam | "# of Ground Conductors" |
| Public property Static member | RbsElecCircuitWireNumHotsParam | "# of Hot Conductors" |
| Public property Static member | RbsElecCircuitWireNumNeutralsParam | "# of Neutral Conductors" |
| Public property Static member | RbsElecCircuitWireNumRunsParam | "# of Runs" |
| Public property Static member | RbsElecCircuitWireSizeParam | "Wire Size" |
| Public property Static member | RbsElecCircuitWireTypeParam | "Wire Type" |
| Public property Static member | RbsElecDemandfactorDemandloadParam | "Estimated Demand Load" |
| Public property Static member | RbsElecDemandfactorLoadclassificationParam | "Load Classification" |
| Public property Static member | RbsElecDemandfactorLoadParam | "Connected Load" |
| Public property Static member | RbsElecDistributionNodeLoadSet | "Load Set" |
| Public property Static member | RbsElecDistributionNodeSupplyFrom | "Supply From" |
| Public property Static member | RbsElecDistributionNodeSupplyFrom1 | "Supply From 1" |
| Public property Static member | RbsElecDistributionNodeSupplyFrom2 | "Supply From 2" |
| Public property Static member | RbsElecDistributionNodeSupplyTo | "Supply To" |
| Public property Static member | RbsElecEditCircuitNamingSettingsParam | "Circuit Naming Settings" |
| Public property Static member | RbsElecEnclosure | "Enclosure" |
| Public property Static member | RbsElecLoadClassification | "Load Classification" |
| Public property Static member | RbsElecLoadsummaryConnectedCurrentParam | "Connected Current" |
| Public property Static member | RbsElecLoadsummaryConnectedLoadParam | "Connected Load (VA)" |
| Public property Static member | RbsElecLoadsummaryDemandCurrentParam | "Estimated Demand Current" |
| Public property Static member | RbsElecLoadsummaryDemandFactorParam | "Demand Factor" |
| Public property Static member | RbsElecLoadsummaryDemandFactorRuleParam | "Description" |
| Public property Static member | RbsElecLoadsummaryDemandLoadParam | "Estimated Demand (VA)" |
| Public property Static member | RbsElecLoadsummaryLoadclassificationParam | "Load Classification" |
| Public property Static member | RbsElecMains | "Mains" |
| Public property Static member | RbsElecMaxPoleBreakers | "Max Number of Single Pole Breakers" |
| Public property Static member | RbsElecModifications | "Modifications" |
| Public property Static member | RbsElecMounting | "Mounting" |
| Public property Static member | RbsElecNumberOfCircuits | "Max Number of Circuits" |
| Public property Static member | RbsElecNumberOfPoles | "Number of Poles" |
| Public property Static member | RbsElecPanelBranchCircuitApparentLoadPhasea | "Branch Circuit Apparent Load Phase A" |
| Public property Static member | RbsElecPanelBranchCircuitApparentLoadPhaseb | "Branch Circuit Apparent Load Phase B" |
| Public property Static member | RbsElecPanelBranchCircuitApparentLoadPhasec | "Branch Circuit Apparent Load Phase C" |
| Public property Static member | RbsElecPanelBranchCircuitCurrentPhasea | "Branch Circuit Current Phase A" |
| Public property Static member | RbsElecPanelBranchCircuitCurrentPhaseb | "Branch Circuit Current Phase B" |
| Public property Static member | RbsElecPanelBranchCircuitCurrentPhasec | "Branch Circuit Current Phase C" |
| Public property Static member | RbsElecPanelBussingParam | "Bussing" |
| Public property Static member | RbsElecPanelConfigurationParam | "Panel Configuration" |
| Public property Static member | RbsElecPanelCurrentPhaseaParam | "Current Phase A" |
| Public property Static member | RbsElecPanelCurrentPhasebParam | "Current Phase B" |
| Public property Static member | RbsElecPanelCurrentPhasecParam | "Current Phase C" |
| Public property Static member | RbsElecPanelFeedParam | "Feed" |
| Public property Static member | RbsElecPanelFeedThruLugsApparentLoadPhasea | "Feed Through Lugs Apparent Load Phase A" |
| Public property Static member | RbsElecPanelFeedThruLugsApparentLoadPhaseb | "Feed Through Lugs Apparent Load Phase B" |
| Public property Static member | RbsElecPanelFeedThruLugsApparentLoadPhasec | "Feed Through Lugs Apparent Load Phase C" |
| Public property Static member | RbsElecPanelFeedThruLugsCurrentPhasea | "Feed Through Lugs Current Phase A" |
| Public property Static member | RbsElecPanelFeedThruLugsCurrentPhaseb | "Feed Through Lugs Current Phase B" |
| Public property Static member | RbsElecPanelFeedThruLugsCurrentPhasec | "Feed Through Lugs Current Phase C" |
| Public property Static member | RbsElecPanelFeedThruLugsParam | "Feed Through Lugs" |
| Public property Static member | RbsElecPanelGroundBusParam | "Ground Bus" |
| Public property Static member | RbsElecPanelLocationParam | "Location" |
| Public property Static member | RbsElecPanelMainstypeParam | "Mains Type" |
| Public property Static member | RbsElecPanelMcbRatingParam | "MCB Rating" |
| Public property Static member | RbsElecPanelName | "Panel Name" |
| Public property Static member | RbsElecPanelNeutralBusParam | "Neutral Bus" |
| Public property Static member | RbsElecPanelNeutralRatingParam | "Neutral Rating" |
| Public property Static member | RbsElecPanelNumphasesParam | "Number of Phases" |
| Public property Static member | RbsElecPanelNumwiresParam | "Number of Wires" |
| Public property Static member | RbsElecPanelScheduleFooterNotesParam | "Schedule Footer Notes" |
| Public property Static member | RbsElecPanelScheduleHeaderNotesParam | "Schedule Header Notes" |
| Public property Static member | RbsElecPanelSubfeedLugsParam | "SubFeed Lugs" |
| Public property Static member | RbsElecPanelSupplyFromParam | "Supply From" |
| Public property Static member | RbsElecPanelTotalConnectedCurrentParam | "Total Connected Current" |
| Public property Static member | RbsElecPanelTotalDemandCurrentParam | "Total Estimated Demand Current" |
| Public property Static member | RbsElecPanelTotalDemandFactorParam | "Total Demand Factor" |
| Public property Static member | RbsElecPanelTotalestloadHvacParam | "HVAC Total Estimated Demand" |
| Public property Static member | RbsElecPanelTotalestloadLightParam | "Lighting Total Estimated Demand" |
| Public property Static member | RbsElecPanelTotalestloadOtherParam | "Other Total Estimated Demand" |
| Public property Static member | RbsElecPanelTotalestloadParam | "Total Estimated Demand" |
| Public property Static member | RbsElecPanelTotalestloadPowerParam | "Power Total Estimated Demand" |
| Public property Static member | RbsElecPanelTotalloadHvacParam | "HVAC Total Connected" |
| Public property Static member | RbsElecPanelTotalloadLightParam | "Lighting Total Connected" |
| Public property Static member | RbsElecPanelTotalloadOtherParam | "Other Total Connected" |
| Public property Static member | RbsElecPanelTotalloadParam | "Total Connected" |
| Public property Static member | RbsElecPanelTotalloadPowerParam | "Power Total Connected" |
| Public property Static member | RbsElecPowerFactor | "Power Factor" |
| Public property Static member | RbsElecPowerFactorState | "Power Factor State" |
| Public property Static member | RbsElecRoomAverageIllumination | "Average Estimated Illumination" |
| Public property Static member | RbsElecRoomCavityRatio | "Room Cavity Ratio" |
| Public property Static member | RbsElecRoomLightingCalcLuminaireplane | "Lighting Calculation Luminaire Plane" |
| Public property Static member | RbsElecRoomLightingCalcWorkplane | "Lighting Calculation Workplane" |
| Public property Static member | RbsElecRoomReflectivityCeiling | "Ceiling Reflectance" |
| Public property Static member | RbsElecRoomReflectivityFloor | "Floor Reflectance" |
| Public property Static member | RbsElecRoomReflectivityWalls | "Wall Reflectance" |
| Public property Static member | RbsElecShortCircuitRating | "Short Circuit Rating" |
| Public property Static member | RbsElecSwitchIdParam | "Switch ID" |
| Public property Static member | RbsElectricalData | "Electrical Data" |
| Public property Static member | RbsElecTrueCurrentParam | "True Current" |
| Public property Static member | RbsElecTrueCurrentPhaseaParam | "True Current Phase A" |
| Public property Static member | RbsElecTrueCurrentPhasebParam | "True Current Phase B" |
| Public property Static member | RbsElecTrueCurrentPhasecParam | "True Current Phase C" |
| Public property Static member | RbsElecTrueLoad | "True Load" |
| Public property Static member | RbsElecTrueLoadPhase1 | "True Load Phase 1" |
| Public property Static member | RbsElecTrueLoadPhase2 | "True Load Phase 2" |
| Public property Static member | RbsElecTrueLoadPhase3 | "True Load Phase 3" |
| Public property Static member | RbsElecTrueLoadPhasea | "True Load Phase A" |
| Public property Static member | RbsElecTrueLoadPhaseb | "True Load Phase B" |
| Public property Static member | RbsElecTrueLoadPhasec | "True Load Phase C" |
| Public property Static member | RbsElecVoltage | "Voltage" |
| Public property Static member | RbsElecVoltageDropParam | "Voltage Drop" |
| Public property Static member | RbsElecWireCircuits | "Circuits" |
| Public property Static member | RbsElecWireElevation | "Elevation" |
| Public property Static member | RbsElecWireGroundAdjustment | "Ground Conductors" |
| Public property Static member | RbsElecWireHotAdjustment | "Hot Conductors" |
| Public property Static member | RbsElecWireNeutralAdjustment | "Neutral Conductors" |
| Public property Static member | RbsElecWireShareGround | "Share Ground Conductor" |
| Public property Static member | RbsElecWireShareNeutral | "Share Neutral Conductor" |
| Public property Static member | RbsElecWireTickmarkState | "Tick Marks" |
| Public property Static member | RbsElecWireType | "Type" |
| Public property Static member | RbsEndLevelParam | "End Level" |
| Public property Static member | RbsEndOffsetParam | "End Middle Elevation" |
| Public property Static member | RbsEnergyAnalysisBuildingEnvelopeAnalyticalGridCellSize | "Analytical Grid Cell Size" |
| Public property Static member | RbsEnergyAnalysisBuildingEnvelopeAnalyticalSpaceIdentificationResolution | "Analytical Space Resolution" |
| Public property Static member | RbsEnergyAnalysisBuildingEnvelopeAnalyticalSurfaceIdentificationResolution | "Analytical Surface Resolution" |
| Public property Static member | RbsEnergyAnalysisBuildingEnvelopeDeterminationParam | "Building Envelope" |
| Public property Static member | RbsEnergyAnalysisExportCategoryParam | "Export Category" |
| Public property Static member | RbsEnergyAnalysisExportComplexityParam | "Export Complexity" |
| Public property Static member | RbsEnergyAnalysisExportGbxmlDefaultsParam | "Export Default Values" |
| Public property Static member | RbsEnergyAnalysisGroundPlaneParam | "Ground Plane" |
| Public property Static member | RbsEnergyAnalysisIncludeThermalProperties | "Detailed Elements" |
| Public property Static member | RbsEnergyAnalysisMode | "Mode" |
| Public property Static member | RbsEnergyAnalysisProjectPhaseParam | "Project Phase" |
| Public property Static member | RbsEnergyAnalysisSliverSpaceTolerance | "Sliver Space Tolerance" |
| Public property Static member | RbsEnergyAnalysisSurfaceAdjacentSpaceId1 | "Adjacent Space Id (1)" |
| Public property Static member | RbsEnergyAnalysisSurfaceAdjacentSpaceId2 | "Adjacent Space Id (2)" |
| Public property Static member | RbsEnergyAnalysisSurfaceAzimuth | "Azimuth" |
| Public property Static member | RbsEnergyAnalysisSurfaceCadobjectid | "CADObjectID" |
| Public property Static member | RbsEnergyAnalysisSurfaceOriginX | "Origin (X)" |
| Public property Static member | RbsEnergyAnalysisSurfaceOriginY | "Origin (Y)" |
| Public property Static member | RbsEnergyAnalysisSurfaceOriginZ | "Origin (Z)" |
| Public property Static member | RbsEnergyAnalysisSurfaceTilt | "Tilt" |
| Public property Static member | RbsEnergyAnalysisViewBuildingShellMode | "Show Analytical Building Shell" |
| Public property Static member | RbsEnergyAnalysisViewCoordAxisMode | "Show a Coordinate System Symbol for each Surface" |
| Public property Static member | RbsEnergyAnalysisViewInnerShellMode | "Show Inner Space Shells" |
| Public property Static member | RbsEnergyAnalysisViewOuterShellMode | "Show Analytical Space Shells" |
| Public property Static member | RbsEnergyAnalysisViewRbeMode | "Show Room Bounding Elements Dimmed and Underlay" |
| Public property Static member | RbsEnergyAnalysisViewShadingSurfacesMode | "Show Shading Surfaces" |
| Public property Static member | RbsEnergyAnalysisViewSurfacesMode | "Show Surfaces" |
| Public property Static member | RbsEnergyAnalysisViewTransparentMode | "Show Surfaces Transparent" |
| Public property Static member | RbsEnergyAnalysisViewUpdateSurfaces | "Update Surfaces" |
| Public property Static member | RbsEqDiameterParam | "Equivalent Diameter" |
| Public property Static member | RbsFamilyContentAnnotationDisplay | "Use Annotation Scale" |
| Public property Static member | RbsFamilyContentDistributionSystem | "Distribution System" |
| Public property Static member | RbsFamilyContentOffsetHeight | "OffsetHeight" |
| Public property Static member | RbsFamilyContentOffsetWidth | "OffsetWidth" |
| Public property Static member | RbsFamilyContentSecondaryDistribsys | "Secondary Distribution System" |
| Public property Static member | RbsFamilyContentTakeoffFixedLength | "Takeoff Fixed Length" |
| Public property Static member | RbsFamilyContentTakeoffLength | "Takeoff Length" |
| Public property Static member | RbsFamilyContentTakeoffProjlength | "Takeoff Length Projection" |
| Public property Static member | RbsFlexductRoundtypeParam | "Flex Duct Type" |
| Public property Static member | RbsFlexDuctTypeParam | "Flex Duct Type" |
| Public property Static member | RbsFlexPatternParam | "Flex Pattern" |
| Public property Static member | RbsFlexPipeTypeParam | "Flex Pipe" |
| Public property Static member | RbsFlowFactorParam | "Flow Factor" |
| Public property Static member | RbsFlowObsolete | "Flow" |
| Public property Static member | RbsFpSprinklerCoverageParam | "Coverage" |
| Public property Static member | RbsFpSprinklerKFactorParam | "K-Factor" |
| Public property Static member | RbsFpSprinklerOrificeParam | "Orifice" |
| Public property Static member | RbsFpSprinklerOrificeSizeParam | "Orifice Size" |
| Public property Static member | RbsFpSprinklerPressureClassParam | "Pressure Class" |
| Public property Static member | RbsFpSprinklerResponseParam | "Response" |
| Public property Static member | RbsFpSprinklerTemperatureRatingParam | "Temperature Rating" |
| Public property Static member | RbsFriction | "Friction" |
| Public property Static member | RbsGbxmlOpeningType | "Opening Type" |
| Public property Static member | RbsGbxmlSurfaceArea | "Area" |
| Public property Static member | RbsGbxmlSurfaceName | "Surface Name" |
| Public property Static member | RbsGbxmlSurfaceType | "Surface Type" |
| Public property Static member | RbsHvacloadDoorAreaParam | "Door Area" |
| Public property Static member | RbsHvacloadDoorCoolingLoadParam | "Door Cooling Load" |
| Public property Static member | RbsHvacloadFloorAreaParam | "Floor Area" |
| Public property Static member | RbsHvacloadPartitionAreaParam | "Partition Area" |
| Public property Static member | RbsHvacloadPartitionCoolingLoadParam | "Partition Cooling Load" |
| Public property Static member | RbsHvacloadPlenumCoolingLoadParam | "Plenum Cooling Load" |
| Public property Static member | RbsHvacloadRoofAreaParam | "Roof Area" |
| Public property Static member | RbsHvacloadRoofCoolingLoadParam | "Roof Cooling Load" |
| Public property Static member | RbsHvacloadSkylightAreaParam | "Skylight Area" |
| Public property Static member | RbsHvacloadSkylightCoolingLoadParam | "Skylight Cooling Load" |
| Public property Static member | RbsHvacloadWallAreaParam | "Wall Area" |
| Public property Static member | RbsHvacloadWallCoolingLoadParam | "Wall Cooling Load" |
| Public property Static member | RbsHvacloadWindowAreaParam | "Window Area" |
| Public property Static member | RbsHvacloadWindowCoolingLoadParam | "Window Cooling Load" |
| Public property Static member | RbsHydraulicDiameterParam | "Hydraulic Diameter" |
| Public property Static member | RbsInsulationLiningVolume | "Volume" |
| Public property Static member | RbsInsulationThickness | "Insulation Thickness" |
| Public property Static member | RbsInsulationThicknessForDuct | "Insulation Thickness" |
| Public property Static member | RbsInsulationThicknessForPipe | "Insulation Thickness" |
| Public property Static member | RbsIsCustomFitting | "IsCustom" |
| Public property Static member | RbsLiningThickness | "Lining Thickness" |
| Public property Static member | RbsLiningThicknessForDuct | "Lining Thickness" |
| Public property Static member | RbsLoadSubClassificationMotor | "Load Sub-Classification Motor" |
| Public property Static member | RbsLookupTableName | "Lookup Table Name" |
| Public property Static member | RbsLossCoefficient | "Loss Coefficient" |
| Public property Static member | RbsMaxFlow | "Max Flow" |
| Public property Static member | RbsMinFlow | "Min Flow" |
| Public property Static member | RbsOffsetParam | "Middle Elevation" |
| Public property Static member | RbsPanelScheduleSheetAppearanceInstParam | "Appearance" |
| Public property Static member | RbsPanelScheduleSheetAppearanceParam | "Appearance On Sheet" |
| Public property Static member | RbsParallelconduitsHorizontalNumber | "Horizontal Number for parallel conduits" |
| Public property Static member | RbsParallelconduitsHorizontalOffsetValue | "Horizontal Offset value for parallel conduits" |
| Public property Static member | RbsParallelconduitsVerticalNumber | "Vertical Number for parallel conduits" |
| Public property Static member | RbsParallelconduitsVerticalOffsetValue | "Vertical Offset value for parallel conduits" |
| Public property Static member | RbsParallelpipesHorizontalNumber | "Horizontal Number for parallel pipes" |
| Public property Static member | RbsParallelpipesHorizontalOffsetValue | "Horizontal Offset value for parallel pipes" |
| Public property Static member | RbsParallelpipesVerticalNumber | "Vertical Number for parallel pipes" |
| Public property Static member | RbsParallelpipesVerticalOffsetValue | "Vertical Offset value for parallel pipes" |
| Public property Static member | RbsPartType | "Part Type" |
| Public property Static member | RbsPipeAdditionalFlowParam | "Additional Flow" |
| Public property Static member | RbsPipeBottomElevation | "Lower End Bottom Elevation" |
| Public property Static member | RbsPipeCalculatedSize | "Pipe Size" |
| Public property Static member | RbsPipeClassParam | "Schedule/Type" |
| Public property Static member | RbsPipeConnectiontypeParam | "Connection Type" |
| Public property Static member | RbsPipeConnectorSystemClassificationParam | "System Classification" |
| Public property Static member | RbsPipeCwfuParam | "CWFU" |
| Public property Static member | RbsPipeDiameterParam | "Diameter" |
| Public property Static member | RbsPipeFittingLossKfactorParam | "K Coefficient" |
| Public property Static member | RbsPipeFittingLossMethodParam | "Loss Method" |
| Public property Static member | RbsPipeFittingLossMethodServerParam | "Loss Method" |
| Public property Static member | RbsPipeFittingLossMethodSettings | "Loss Method Settings" |
| Public property Static member | RbsPipeFittingLossTableParam | "K Coefficient Table" |
| Public property Static member | RbsPipeFixtureUnitsParam | "Fixture Units" |
| Public property Static member | RbsPipeFlowConfigurationParam | "Flow Configuration" |
| Public property Static member | RbsPipeFlowDirectionParam | "Flow Direction" |
| Public property Static member | RbsPipeFlowParam | "Flow" |
| Public property Static member | RbsPipeFlowStateParam | "Flow State" |
| Public property Static member | RbsPipeFluidDensityParam | "Fluid Density" |
| Public property Static member | RbsPipeFluidTemperatureParam | "Fluid Temperature" |
| Public property Static member | RbsPipeFluidTypeParam | "Fluid Type" |
| Public property Static member | RbsPipeFluidViscosityParam | "Fluid Dynamic Viscosity" |
| Public property Static member | RbsPipeFrictionFactorParam | "Friction Factor" |
| Public property Static member | RbsPipeFrictionParam | "Friction" |
| Public property Static member | RbsPipeHwfuParam | "HWFU" |
| Public property Static member | RbsPipeInnerDiamParam | "Inside Diameter" |
| Public property Static member | RbsPipeInsulationThickness | "Insulation Thickness" |
| Public property Static member | RbsPipeInvertElevation | "Invert Elevation": This parameter is obsolete. It exists only for compatibility. |
| Public property Static member | RbsPipeJointtypeParam | "Connection Type" |
| Public property Static member | RbsPipeMaterialParam | "Material" |
| Public property Static member | RbsPipeOuterDiameter | "Outside Diameter" |
| Public property Static member | RbsPipePressuredropParam | "Pressure Drop" |
| Public property Static member | RbsPipeRelativeRoughnessParam | "Relative Roughness" |
| Public property Static member | RbsPipeReynoldsNumberParam | "Reynolds Number" |
| Public property Static member | RbsPipeRoughnessParam | "Roughness" |
| Public property Static member | RbsPipeSegmentParam | "Pipe Segment" |
| Public property Static member | RbsPipeSizeFormattedParam | "Size" |
| Public property Static member | RbsPipeSizeMaximum | "Maximum Size" |
| Public property Static member | RbsPipeSizeMinimum | "Minimum Size" |
| Public property Static member | RbsPipeSlope | "Slope" |
| Public property Static member | RbsPipeSlopeDefParam | "Pipe Slope Definitions" |
| Public property Static member | RbsPipeSlopeOptionsDefParam | "Pipe Slope Options" |
| Public property Static member | RbsPipeStaticPressure | "Static Pressure" |
| Public property Static member | RbsPipeSystemCalculationParam | "Calculations" |
| Public property Static member | RbsPipeSystemFixtureUnitParam | "Fixture Units" |
| Public property Static member | RbsPipeTopElevation | "Upper End Top Elevation" |
| Public property Static member | RbsPipeTypeFittingLossKfactorParam | "K Coefficient" |
| Public property Static member | RbsPipeTypeFittingLossMethodParam | "Loss Method" |
| Public property Static member | RbsPipeTypeFittingLossTableParam | "K Coefficient Table" |
| Public property Static member | RbsPipeTypeParam | "Pipe Type" |
| Public property Static member | RbsPipeTypeValveLossCvfactorParam | "Cv Coefficient" |
| Public property Static member | RbsPipeValveLossCvfactorParam | "Cv Coefficient" |
| Public property Static member | RbsPipeVelocityParam | "Velocity" |
| Public property Static member | RbsPipeVolumeParam | "Volume" |
| Public property Static member | RbsPipeWfuParam | "WFU" |
| Public property Static member | RbsPipingSystemTypeParam | "System Type" |
| Public property Static member | RbsPressureDrop | "Pressure Drop" |
| Public property Static member | RbsProjectConstructionTypeShadingfactorParam | "Internal Shading Factor" |
| Public property Static member | RbsProjectLocationParam | "Location" |
| Public property Static member | RbsProjectReporttypeParam | "Report Type" |
| Public property Static member | RbsReferenceFreesize | "Free Size" |
| Public property Static member | RbsReferenceInsulationThickness | "Insulation Thickness" |
| Public property Static member | RbsReferenceInsulationType | "Insulation Type" |
| Public property Static member | RbsReferenceLiningThickness | "Lining Thickness" |
| Public property Static member | RbsReferenceLiningType | "Lining Type" |
| Public property Static member | RbsReferenceOverallsize | "Overall Size" |
| Public property Static member | RbsReynoldsnumberParam | "Reynolds number" |
| Public property Static member | RbsRoomCoefficientUtilization | "Coefficient of Utilization" |
| Public property Static member | RbsRoutingPreferenceParam | "Routing Preferences" |
| Public property Static member | RbsSection | "Section" |
| Public property Static member | RbsSegmentDescriptionParam | "Segment Description" |
| Public property Static member | RbsServiceTypeParam | "Building Service" |
| Public property Static member | RbsShowProfileType | "Show Round" |
| Public property Static member | RbsSizeLock | "Size Lock" |
| Public property Static member | RbsStartLevelParam | "Reference Level" |
| Public property Static member | RbsStartOffsetParam | "Start Middle Elevation" |
| Public property Static member | RbsSystemAbbreviationParam | "Abbreviation" |
| Public property Static member | RbsSystemBaseElementParam | "System Equipment" |
| Public property Static member | RbsSystemClassificationParam | "System Classification" |
| Public property Static member | RbsSystemFlowConversionMethodParam | "Flow Conversion Method" |
| Public property Static member | RbsSystemNameParam | "System Name" |
| Public property Static member | RbsSystemNumElementsParam | "Number of Elements" |
| Public property Static member | RbsSystemRisedrop1linedropsymbolParam | "Single Line Drop Symbol" |
| Public property Static member | RbsSystemRisedrop1linerisesymbolParam | "Single Line Rise Symbol" |
| Public property Static member | RbsSystemRisedrop1lineteedownsymbolParam | "Single Line Tee Down Symbol" |
| Public property Static member | RbsSystemRisedrop1lineteeupsymbolParam | "Single Line Tee Up Symbol" |
| Public property Static member | RbsSystemRisedrop2linedropsymbolParam | "Two Line Drop Symbol" |
| Public property Static member | RbsSystemRisedrop2linerisesymbolParam | "Two Line Rise Symbol" |
| Public property Static member | RbsSystemRisedropParam | "Rise / Drop Symbol" |
| Public property Static member | RbsVelocity | "Velocity" |
| Public property Static member | RbsVelocityPressure | "Velocity Pressure" |
| Public property Static member | RbsVoltagetypeMaxvoltageParam | "Maximum Voltage" |
| Public property Static member | RbsVoltagetypeMinvoltageParam | "Minimum Voltage" |
| Public property Static member | RbsVoltagetypeVoltageParam | "Actual Voltage" |
| Public property Static member | RbsWireCircuitDescription | "Circuit Description" |
| Public property Static member | RbsWireCircuitLoadName | "Circuit Load Name" |
| Public property Static member | RbsWireConduitTypeParam | "Conduit Type" |
| Public property Static member | RbsWireInsulationParam | "Insulation" |
| Public property Static member | RbsWireMaterialParam | "Material" |
| Public property Static member | RbsWireMaxConductorSizeParam | "Max Size" |
| Public property Static member | RbsWireNeutralIncludedInBalancedLoadParam | "Neutral Included in Balanced Load" |
| Public property Static member | RbsWireNeutralModeParam | "Neutral Size" |
| Public property Static member | RbsWireNeutralMultiplierParam | "Neutral Multiplier" |
| Public property Static member | RbsWireNumConductorsParam | "Number of Conductors" |
| Public property Static member | RbsWireTemperatureRatingParam | "Temperature Rating" |
| Public property Static member | RebarBarDeformationType | "Deformation" |
| Public property Static member | RebarBarDiameter | "Bar Diameter" |
| Public property Static member | RebarBarHookLengths | "Hook Lengths" |
| Public property Static member | RebarBarMaximumBendRadius | "Maximum Bend Radius" |
| Public property Static member | RebarBarStirrupBendDiameter | "Stirrup/Tie Bend Diameter" |
| Public property Static member | RebarBarStyle | "Subcategory" |
| Public property Static member | RebarContainerBarType | "Bar Type" |
| Public property Static member | RebarDistributionType | "Distribution Type" |
| Public property Static member | RebarElemBarSpacing | "Spacing" |
| Public property Static member | RebarElemEndtreatmentEnd | "End Treatment At End" |
| Public property Static member | RebarElemEndtreatmentStart | "End Treatment At Start" |
| Public property Static member | RebarElementRounding | "Rounding Overrides" |
| Public property Static member | RebarElementVisibility | "View Visibility States" |
| Public property Static member | RebarElemHookEndOrient | "Hook Orientation At End" |
| Public property Static member | RebarElemHookEndType | "Hook At End" |
| Public property Static member | RebarElemHookStartOrient | "Hook Orientation At Start" |
| Public property Static member | RebarElemHookStartType | "Hook At Start" |
| Public property Static member | RebarElemHookStyle | "Style" |
| Public property Static member | RebarElemHostMark | "Host Mark" |
| Public property Static member | RebarElemLayoutRule | "Layout Rule" |
| Public property Static member | RebarElemLength | "Bar Length" |
| Public property Static member | RebarElemQuantityOfBars | "Quantity" |
| Public property Static member | RebarElemScheduleMark | "Schedule Mark" |
| Public property Static member | RebarElemTotalLength | "Total Bar Length" |
| Public property Static member | RebarFreeFormHookEndPlaneAngle | "Hook Orientation At End" |
| Public property Static member | RebarFreeFormHookStartPlaneAngle | "Hook Orientation At Start" |
| Public property Static member | RebarGeometryType | "Geometry" |
| Public property Static member | RebarHookAngle | "Hook Angle" |
| Public property Static member | RebarHookLengthOverride | "Override Hook Lengths" |
| Public property Static member | RebarHookLineLenFactor | "Extension Multiplier" |
| Public property Static member | RebarHookRotationAtEnd | "Hook Rotation At End" |
| Public property Static member | RebarHookRotationAtEndSchedulesTagsFilters | "Hook Rotation At End" |
| Public property Static member | RebarHookRotationAtStart | "Hook Rotation At Start" |
| Public property Static member | RebarHookRotationAtStartSchedulesTagsFilters | "Hook Rotation At Start" |
| Public property Static member | RebarHookStyle | "Style" |
| Public property Static member | RebarHostCategory | "Host Category" |
| Public property Static member | RebarIncludeFirstBar | "Include First Bar" |
| Public property Static member | RebarIncludeLastBar | "Include Last Bar" |
| Public property Static member | RebarInstanceBarDiameter | "Bar Diameter" |
| Public property Static member | RebarInstanceBarModelDiameter | "Model Bar Diameter" |
| Public property Static member | RebarInstanceBendDiameter | "Bend Diameter" |
| Public property Static member | RebarInstanceStirrupTieAttachment | "Stirrup/Tie Attachment" |
| Public property Static member | RebarInternalMultiplanar | "INTERNAL: Multiplanar" |
| Public property Static member | RebarInternalMultiplanarArcConnector | "INTERNAL: Multiplanar Arc Connector" |
| Public property Static member | RebarInternalMultiplanarDuplicate | "INTERNAL: Multiplanar Duplicate" |
| Public property Static member | RebarInternalMultiplanarEndConnector | "INTERNAL: Multiplanar End Connector" |
| Public property Static member | RebarInternalMultiplanarStartConnector | "INTERNAL: Multiplanar Start Connector" |
| Public property Static member | RebarMaximSuffix | "Maxim Suffix" |
| Public property Static member | RebarMaxLength | "Maximum bar length" |
| Public property Static member | RebarMinimSuffix | "Minim Suffix" |
| Public property Static member | RebarMinLength | "Minimum bar length" |
| Public property Static member | RebarModelBarDiameter | "Model Bar Diameter" |
| Public property Static member | RebarModifiedSet | "Modified Rebar Set" |
| Public property Static member | RebarNumber | "Rebar Number" |
| Public property Static member | RebarNumberSuffix | "Rebar Number Suffix" |
| Public property Static member | RebarQuanityByDistrib | "Quantity By Rebar Set" |
| Public property Static member | RebarShape | "Shape" |
| Public property Static member | RebarShapeAllowedBarTypes | "Allowable Rebar Bar Types" |
| Public property Static member | RebarShapeEndHookLength | "End Hook Length" |
| Public property Static member | RebarShapeEndHookOffset | "End Hook Offset Length" |
| Public property Static member | RebarShapeEndtreatmentEndType | "End Treatment At End" |
| Public property Static member | RebarShapeEndtreatmentStartType | "End Treatment At Start" |
| Public property Static member | RebarShapeHookEndType | "Hook At End" |
| Public property Static member | RebarShapeHookRotationAtEnd | "Hook Rotation At End" |
| Public property Static member | RebarShapeHookRotationAtStart | "Hook Rotation At Start" |
| Public property Static member | RebarShapeHookStartType | "Hook At Start" |
| Public property Static member | RebarShapeHookStyle | "Style" |
| Public property Static member | RebarShapeImage | "Shape Image" |
| Public property Static member | RebarShapeOutOfPlaneBendDiameter | "Out of Plane Bend Diameter" |
| Public property Static member | RebarShapeParamEndHookTanLen | "End Tangent Hook Length" |
| Public property Static member | RebarShapeParamStartHookTanLen | "Start Tangent Hook Length" |
| Public property Static member | RebarShapeSpiralBaseFinishingTurns | "Base Finishing Turns" |
| Public property Static member | RebarShapeSpiralHeight | "Height" |
| Public property Static member | RebarShapeSpiralPitch | "Pitch" |
| Public property Static member | RebarShapeSpiralTopFinishingTurns | "Top Finishing Turns" |
| Public property Static member | RebarShapeStartHookLength | "Start Hook Length" |
| Public property Static member | RebarShapeStartHookOffset | "Start Hook Offset Length" |
| Public property Static member | RebarShapeStirrupTieAttachment | "Stirrup/Tie Attachment" |
| Public property Static member | RebarStandardBendDiameter | "Standard Bend Diameter" |
| Public property Static member | RebarStandardHookBendDiameter | "Standard Hook Bend Diameter" |
| Public property Static member | RebarSystemActiveBackDirn1 | "Interior Major Direction" |
| Public property Static member | RebarSystemActiveBackDirn2 | "Interior Minor Direction" |
| Public property Static member | RebarSystemActiveBottomDir1Generic | "Bottom/Interior Major Direction" |
| Public property Static member | RebarSystemActiveBottomDir2Generic | "Bottom/Interior Minor Direction" |
| Public property Static member | RebarSystemActiveBottomDirn1 | "Bottom Major Direction" |
| Public property Static member | RebarSystemActiveBottomDirn2 | "Bottom Minor Direction" |
| Public property Static member | RebarSystemActiveFrontDirn1 | "Exterior Major Direction" |
| Public property Static member | RebarSystemActiveFrontDirn2 | "Exterior Minor Direction" |
| Public property Static member | RebarSystemActiveTopDir1Generic | "Top/Exterior Major Direction" |
| Public property Static member | RebarSystemActiveTopDir2Generic | "Top/Exterior Minor Direction" |
| Public property Static member | RebarSystemActiveTopDirn1 | "Top Major Direction" |
| Public property Static member | RebarSystemActiveTopDirn2 | "Top Minor Direction" |
| Public property Static member | RebarSystemAddlBottomOffset | "Additional Bottom Cover Offset" |
| Public property Static member | RebarSystemAddlExteriorOffset | "Additional Exterior Cover Offset" |
| Public property Static member | RebarSystemAddlInteriorOffset | "Additional Interior Cover Offset" |
| Public property Static member | RebarSystemAddlTopOffset | "Additional Top Cover Offset" |
| Public property Static member | RebarSystemBarTypeBackDirn1 | "Interior Major Bar Type" |
| Public property Static member | RebarSystemBarTypeBackDirn2 | "Interior Minor Bar Type" |
| Public property Static member | RebarSystemBarTypeBottomDir1Generic | "Bottom/Interior Major Bar Type" |
| Public property Static member | RebarSystemBarTypeBottomDir2Generic | "Bottom/Interior Minor Bar Type" |
| Public property Static member | RebarSystemBarTypeBottomDirn1 | "Bottom Major Bar Type" |
| Public property Static member | RebarSystemBarTypeBottomDirn2 | "Bottom Minor Bar Type" |
| Public property Static member | RebarSystemBarTypeFrontDirn1 | "Exterior Major Bar Type" |
| Public property Static member | RebarSystemBarTypeFrontDirn2 | "Exterior Minor Bar Type" |
| Public property Static member | RebarSystemBarTypeTopDir1Generic | "Top/Exterior Major Bar Type" |
| Public property Static member | RebarSystemBarTypeTopDir2Generic | "Top/Exterior Minor Bar Type" |
| Public property Static member | RebarSystemBarTypeTopDirn1 | "Top Major Bar Type" |
| Public property Static member | RebarSystemBarTypeTopDirn2 | "Top Minor Bar Type" |
| Public property Static member | RebarSystemBottomMajorMatchesBottomMinor | "Bottom Major and Minor Layers Match" |
| Public property Static member | RebarSystemCoverBottom | "Rebar Cover Bottom/Interior" |
| Public property Static member | RebarSystemCoverSide | "Rebar Cover Side/Edge" |
| Public property Static member | RebarSystemCoverTop | "Rebar Cover Top/Exterior" |
| Public property Static member | RebarSystemHookOrientBackDirn1 | "Interior Major Hook Orientation" |
| Public property Static member | RebarSystemHookOrientBackDirn2 | "Interior Minor Hook Orientation" |
| Public property Static member | RebarSystemHookOrientBottomDirn1 | "Bottom Major Hook Orientation" |
| Public property Static member | RebarSystemHookOrientBottomDirn2 | "Bottom Minor Hook Orientation" |
| Public property Static member | RebarSystemHookOrientFrontDirn1 | "Exterior Major Hook Orientation" |
| Public property Static member | RebarSystemHookOrientFrontDirn2 | "Exterior Minor Hook Orientation" |
| Public property Static member | RebarSystemHookOrientTopDirn1 | "Top Major Hook Orientation" |
| Public property Static member | RebarSystemHookOrientTopDirn2 | "Top Minor Hook Orientation" |
| Public property Static member | RebarSystemHookTypeBackDirn1 | "Interior Major Hook Type" |
| Public property Static member | RebarSystemHookTypeBackDirn2 | "Interior Minor Hook Type" |
| Public property Static member | RebarSystemHookTypeBottomDirn1 | "Bottom Major Hook Type" |
| Public property Static member | RebarSystemHookTypeBottomDirn2 | "Bottom Minor Hook Type" |
| Public property Static member | RebarSystemHookTypeFrontDirn1 | "Exterior Major Hook Type" |
| Public property Static member | RebarSystemHookTypeFrontDirn2 | "Exterior Minor Hook Type" |
| Public property Static member | RebarSystemHookTypeTopDirn1 | "Top Major Hook Type" |
| Public property Static member | RebarSystemHookTypeTopDirn2 | "Top Minor Hook Type" |
| Public property Static member | RebarSystemLayerSummaryBottomDir1NoSpacing | "Bottom/Interior Major (Brief)" |
| Public property Static member | RebarSystemLayerSummaryBottomDir1WithSpacing | "Bottom/Interior Major" |
| Public property Static member | RebarSystemLayerSummaryBottomDir2NoSpacing | "Bottom/Interior Minor (Brief)" |
| Public property Static member | RebarSystemLayerSummaryBottomDir2WithSpacing | "Bottom/Interior Minor" |
| Public property Static member | RebarSystemLayerSummaryDir1NoSpacing | "Major, Both Faces (Brief)" |
| Public property Static member | RebarSystemLayerSummaryDir1WithSpacing | "Major, Both Faces" |
| Public property Static member | RebarSystemLayerSummaryDir2NoSpacing | "Minor, Both Faces (Brief)" |
| Public property Static member | RebarSystemLayerSummaryDir2WithSpacing | "Minor, Both Faces" |
| Public property Static member | RebarSystemLayerSummaryNoSpacing | "Layer Summary (Brief)" |
| Public property Static member | RebarSystemLayerSummaryTopDir1NoSpacing | "Top/Exterior Major (Brief)" |
| Public property Static member | RebarSystemLayerSummaryTopDir1WithSpacing | "Top/Exterior Major" |
| Public property Static member | RebarSystemLayerSummaryTopDir2NoSpacing | "Top/Exterior Minor (Brief)" |
| Public property Static member | RebarSystemLayerSummaryTopDir2WithSpacing | "Top/Exterior Minor" |
| Public property Static member | RebarSystemLayerSummaryWithSpacing | "Layer Summary" |
| Public property Static member | RebarSystemLayoutRule | "Layout Rule" |
| Public property Static member | RebarSystemNumberOfLinesBackDirn1 | "Interior Major Number Of Lines" |
| Public property Static member | RebarSystemNumberOfLinesBackDirn2 | "Interior Minor Number Of Lines" |
| Public property Static member | RebarSystemNumberOfLinesBottomDir1Generic | "Bottom/Interior Major Number Of Lines" |
| Public property Static member | RebarSystemNumberOfLinesBottomDir2Generic | "Bottom/Interior Minor Number Of Lines" |
| Public property Static member | RebarSystemNumberOfLinesBottomDirn1 | "Bottom Major Number Of Lines" |
| Public property Static member | RebarSystemNumberOfLinesBottomDirn2 | "Bottom Minor Number Of Lines" |
| Public property Static member | RebarSystemNumberOfLinesFrontDirn1 | "Exterior Major Number Of Lines" |
| Public property Static member | RebarSystemNumberOfLinesFrontDirn2 | "Exterior Minor Number Of Lines" |
| Public property Static member | RebarSystemNumberOfLinesTopDir1Generic | "Top/Exterior Major Number Of Lines" |
| Public property Static member | RebarSystemNumberOfLinesTopDir2Generic | "Top/Exterior Minor Number Of Lines" |
| Public property Static member | RebarSystemNumberOfLinesTopDirn1 | "Top Major Number Of Lines" |
| Public property Static member | RebarSystemNumberOfLinesTopDirn2 | "Top Minor Number Of Lines" |
| Public property Static member | RebarSystemOverride | "Override Area Reinforcement Settings" |
| Public property Static member | RebarSystemSpacingBackDirn1 | "Interior Major Spacing" |
| Public property Static member | RebarSystemSpacingBackDirn2 | "Interior Minor Spacing" |
| Public property Static member | RebarSystemSpacingBottomDir1Generic | "Bottom/Interior Major Spacing" |
| Public property Static member | RebarSystemSpacingBottomDir2Generic | "Bottom/Interior Minor Spacing" |
| Public property Static member | RebarSystemSpacingBottomDirn1 | "Bottom Major Spacing" |
| Public property Static member | RebarSystemSpacingBottomDirn2 | "Bottom Minor Spacing" |
| Public property Static member | RebarSystemSpacingFrontDirn1 | "Exterior Major Spacing" |
| Public property Static member | RebarSystemSpacingFrontDirn2 | "Exterior Minor Spacing" |
| Public property Static member | RebarSystemSpacingTopDir1Generic | "Top/Exterior Major Spacing" |
| Public property Static member | RebarSystemSpacingTopDir2Generic | "Top/Exterior Minor Spacing" |
| Public property Static member | RebarSystemSpacingTopDirn1 | "Top Major Spacing" |
| Public property Static member | RebarSystemSpacingTopDirn2 | "Top Minor Spacing" |
| Public property Static member | RebarSystemSpanactiveDirn1 | "Bars In Major Direction" |
| Public property Static member | RebarSystemSpanactiveDirn2 | "Bars In Minor Direction" |
| Public property Static member | RebarSystemSpanhookBottomDirn2 | "Hook Angle Bottom" |
| Public property Static member | RebarSystemSpanhookLeftDirn1 | "Hook Angle Left" |
| Public property Static member | RebarSystemSpanhookRightDirn1 | "Hook Angle Right" |
| Public property Static member | RebarSystemSpanhookTopDirn2 | "Hook Angle Top" |
| Public property Static member | RebarSystemTopMajorMatchesBottomMajor | "Top and Bottom Major Layers Match" |
| Public property Static member | RebarSystemTopMajorMatchesTopMinor | "Top Major and Minor Layers Match" |
| Public property Static member | RebarSystemTopMinorMatchesBottomMinor | "Top and Bottom Minor Layers Match" |
| Public property Static member | RebarWorkshopInstructions | "Workshop Instructions" |
| Public property Static member | RectMullionThick | "Thickness" |
| Public property Static member | RectMullionWidth1 | "Width on side 1" |
| Public property Static member | RectMullionWidth2 | "Width on side 2" |
| Public property Static member | ReferenceBaseOnHost | "Reference Base on Host" |
| Public property Static member | ReferencedView | "Referenced View": The view referenced by a section or callout. |
| Public property Static member | ReferenceLineSubcategory | "Subcategory" |
| Public property Static member | ReferenceOtherViewUiRefView | "Reference View": This is used by the UI to allow selection of view reference. |
| Public property Static member | ReferenceOtherViewUiToggle | "Reference Other View": This is used to determine whether reference other view is enable or not. |
| Public property Static member | ReferenceViewerAttrTag | "View Reference Tag" |
| Public property Static member | ReferenceViewerTargetView | "Target view" |
| Public property Static member | ReferenceViewerUiTargetFilter | "Filter": This is used by the UI to filter the list of target views. |
| Public property Static member | ReferenceViewerUiTargetView | "Target view": This is used by the UI to allow selection of target view. It allows the UI to set a filter that is incompatible with the current target view (REFERENCE\_VIEWER\_TARGET\_VIEW). |
| Public property Static member | RefTableElemName | "Key Name" |
| Public property Static member | RefTableParamName | "Parameter Name" |
| Public property Static member | ReinEstBarLength | "Estimated Total Bar Length" |
| Public property Static member | ReinEstBarVolume | "Estimated Reinforcement Volume" |
| Public property Static member | ReinEstNumberOfBars | "Estimated Number of Bars" |
| Public property Static member | ReinforcementVolume | "Reinforcement Volume" |
| Public property Static member | RelatedToMass | "Related to Mass" |
| Public property Static member | RenderPlantHeight | "Height" |
| Public property Static member | RenderPlantName | "Plant Name" |
| Public property Static member | RenderPlantTrimHeight | "Plant Trim Height" |
| Public property Static member | RenderRpcFilename | "Render Appearance" |
| Public property Static member | RenderRpcProperties | "Render Appearance Properties" |
| Public property Static member | RepeatingDetailElement | "Detail" |
| Public property Static member | RepeatingDetailInside | "Inside" |
| Public property Static member | RepeatingDetailLayout | "Layout" |
| Public property Static member | RepeatingDetailNumber | "Number" |
| Public property Static member | RepeatingDetailRotation | "Detail Rotation" |
| Public property Static member | RepeatingDetailSpacing | "Spacing" |
| Public property Static member | RevealProfileParam | "Profile" |
| Public property Static member | RevisionCloudRevision | "Revision" |
| Public property Static member | RevisionCloudRevisionDate | "Revision Date" |
| Public property Static member | RevisionCloudRevisionDescription | "Revision Description" |
| Public property Static member | RevisionCloudRevisionIssuedBy | "Issued by" |
| Public property Static member | RevisionCloudRevisionIssuedTo | "Issued to" |
| Public property Static member | RevisionCloudRevisionNum | "Revision Number" |
| Public property Static member | RevolutionEndAngle | "End Angle" |
| Public property Static member | RevolutionStartAngle | "Start Angle" |
| Public property Static member | RgbBParam | "Blue value for RGB color spec. (for Use with XAML Data Template example)" |
| Public property Static member | RgbGParam | "Green value for RGB color spec. (for Use with XAML Data Template example)" |
| Public property Static member | RgbRParam | "Red value for RGB color spec. (for Use with XAML Data Template example)" |
| Public property Static member | RoofAttrDefaultThicknessParam | "Default Thickness" |
| Public property Static member | RoofAttrThicknessParam | "Thickness" |
| Public property Static member | RoofBaseLevelParam | "Base Level" |
| Public property Static member | RoofConstraintLevelParam | "Reference Level" |
| Public property Static member | RoofConstraintOffsetParam | "Level Offset" |
| Public property Static member | RoofCurveHeightAtWall | "Plate Offset From Base" |
| Public property Static member | RoofCurveHeightOffset | "Offset From Roof Base" |
| Public property Static member | RoofCurveIsSlopeDefining | "Defines Roof Slope" |
| Public property Static member | RoofEaveCutParam | "Rafter Cut" |
| Public property Static member | RoofFacesLocation | "Picked Faces Location" |
| Public property Static member | RoofLevelOffsetParam | "Base Offset From Level" |
| Public property Static member | RoofRafterOrTrussParam | "Rafter or Truss" |
| Public property Static member | RoofSlope | "Slope" |
| Public property Static member | RoofStructureIdParam | "Structure" |
| Public property Static member | RoofUptoLevelOffsetParam | "Cutoff Offset" |
| Public property Static member | RoofUptoLevelParam | "Cutoff Level" |
| Public property Static member | RoomActualExhaustAirflowParam | "Actual Exhaust Airflow" |
| Public property Static member | RoomActualLightingLoadParam | "Actual Lighting Load" |
| Public property Static member | RoomActualLightingLoadPerAreaParam | "Actual Lighting Load per area" |
| Public property Static member | RoomActualPowerLoadParam | "Actual Power Load" |
| Public property Static member | RoomActualPowerLoadPerAreaParam | "Actual Power Load per area" |
| Public property Static member | RoomActualReturnAirflowParam | "Actual Return Airflow" |
| Public property Static member | RoomActualSupplyAirflowParam | "Actual Supply Airflow" |
| Public property Static member | RoomAirChangesPerHourParam | "Air Changes per Hour" |
| Public property Static member | RoomArea | "Area" |
| Public property Static member | RoomAreaPerPersonParam | "Area per Person" |
| Public property Static member | RoomBaseHeatLoadOnParam | "Heat Load Values" |
| Public property Static member | RoomBaseLightingLoadOnParam | "Base Lighting Load on" |
| Public property Static member | RoomBasePowerLoadOnParam | "Base Power Load on" |
| Public property Static member | RoomBaseReturnAirflowOnParam | "Return Airflow" |
| Public property Static member | RoomCalculatedCoolingLoadParam | "Calculated Cooling Load" |
| Public property Static member | RoomCalculatedCoolingLoadPerAreaParam | "Calculated Cooling Load per area" |
| Public property Static member | RoomCalculatedHeatingLoadParam | "Calculated Heating Load" |
| Public property Static member | RoomCalculatedHeatingLoadPerAreaParam | "Calculated Heating Load per area" |
| Public property Static member | RoomCalculatedSupplyAirflowParam | "Calculated Supply Airflow" |
| Public property Static member | RoomCalculatedSupplyAirflowPerAreaParam | "Calculated Supply Airflow per area" |
| Public property Static member | RoomCalculationPoint | "Room Calculation Point" |
| Public property Static member | RoomComputationHeight | "Computation Height" |
| Public property Static member | RoomComputationMethod | "Computation" |
| Public property Static member | RoomConditionTypeParam | "Condition Type" |
| Public property Static member | RoomConstructionSetParam | "Construction Type" |
| Public property Static member | RoomDepartment | "Department" |
| Public property Static member | RoomDesignCoolingLoadParam | "Design Cooling Load" |
| Public property Static member | RoomDesignExhaustAirflowParam | "Specified Exhaust Airflow" |
| Public property Static member | RoomDesignHeatingLoadParam | "Design Heating Load" |
| Public property Static member | RoomDesignLightingLoadParam | "Specified Lighting Load" |
| Public property Static member | RoomDesignLightingLoadPerAreaParam | "Specified Lighting Load per area" |
| Public property Static member | RoomDesignMechanicalLoadPerAreaParam | "Design HVAC Load per area" |
| Public property Static member | RoomDesignOtherLoadPerAreaParam | "Design Other Load per area" |
| Public property Static member | RoomDesignPowerLoadParam | "Specified Power Load" |
| Public property Static member | RoomDesignPowerLoadPerAreaParam | "Specified Power Load per area" |
| Public property Static member | RoomDesignReturnAirflowParam | "Specified Return Airflow" |
| Public property Static member | RoomDesignSupplyAirflowParam | "Specified Supply Airflow" |
| Public property Static member | RoomEditElectricalLoadsParam | "Electrical Loads" |
| Public property Static member | RoomEditPeopleLoadsParam | "People" |
| Public property Static member | RoomFinishBase | "Base Finish" |
| Public property Static member | RoomFinishCeiling | "Ceiling Finish" |
| Public property Static member | RoomFinishFloor | "Floor Finish" |
| Public property Static member | RoomFinishWall | "Wall Finish" |
| Public property Static member | RoomHeight | "Unbounded Height" |
| Public property Static member | RoomLevelId | "Level" |
| Public property Static member | RoomLightingLoadUnitsParam | "Lighting Load Units" |
| Public property Static member | RoomLowerOffset | "Base Offset" |
| Public property Static member | RoomName | "Name" |
| Public property Static member | RoomNumber | "Number" |
| Public property Static member | RoomNumberOfPeopleParam | "Number of People" |
| Public property Static member | RoomOccupancy | "Occupancy" |
| Public property Static member | RoomOccupancyUnitParam | "Occupancy Unit" |
| Public property Static member | RoomOutdoorAirflowParam | "Outdoor Airflow" |
| Public property Static member | RoomOutdoorAirflowStandardParam | "Outdoor Air Method" |
| Public property Static member | RoomOutdoorAirInfoParam | "Outdoor Air Information" |
| Public property Static member | RoomOutdoorAirPerAreaParam | "Outdoor Air per Area" |
| Public property Static member | RoomOutdoorAirPerPersonParam | "Outdoor Air per Person" |
| Public property Static member | RoomPeopleLatentHeatGainPerPersonParam | "Latent Heat Gain per person" |
| Public property Static member | RoomPeopleSensibleHeatGainPerPersonParam | "Sensible Heat Gain per person" |
| Public property Static member | RoomPeopleTotalHeatGainPerPersonParam | "Total Heat Gain per person" |
| Public property Static member | RoomPerimeter | "Perimeter" |
| Public property Static member | RoomPhase | "Phase" |
| Public property Static member | RoomPhaseId | "Phase Id" |
| Public property Static member | RoomPlenumLightingParam | "Plenum Lighting Contribution" |
| Public property Static member | RoomPowerLoadUnitsParam | "Power Load Units" |
| Public property Static member | RoomSpaceTypeParam | "Space Type" |
| Public property Static member | RoomTagOrientationParam | "Orientation" |
| Public property Static member | RoomUpperLevel | "Upper Limit" |
| Public property Static member | RoomUpperOffset | "Limit Offset" |
| Public property Static member | RoomVolume | "Volume" |
| Public property Static member | RouteAnalysisSettingsParam | "Route Analysis Settings" |
| Public property Static member | RoutingPreferenceParam | "Routing Preference" |
| Public property Static member | RvtHostLevel | "Map Levels..." |
| Public property Static member | RvtLevelOffset | "Map Levels..." |
| Public property Static member | RvtLinkFileNameWithoutExt | "File Name" |
| Public property Static member | RvtLinkInstanceName | "Name" |
| Public property Static member | RvtLinkPhaseMap | "Phase Mapping" |
| Public property Static member | RvtLinkReferenceType | "Reference Type" |
| Public property Static member | RvtSourceLevel | "Map Levels..." |
| Public property Static member | ScheduleBaseLevelOffsetParam | "Base Offset" |
| Public property Static member | ScheduleBaseLevelParam | "Base Level" |
| Public property Static member | ScheduleCategory | "Category" |
| Public property Static member | ScheduleEmbeddedParam | "Embedded Schedule" |
| Public property Static member | ScheduleFieldsParam | "Fields" |
| Public property Static member | ScheduleFilterParam | "Filter" |
| Public property Static member | ScheduleFormatParam | "Formatting" |
| Public property Static member | ScheduleGroupParam | "Sorting/Grouping" |
| Public property Static member | ScheduleLevelParam | "Level" |
| Public property Static member | ScheduleSheetAppearanceParam | "Appearance" |
| Public property Static member | ScheduleTopLevelOffsetParam | "Top Offset" |
| Public property Static member | ScheduleTopLevelParam | "Top Level" |
| Public property Static member | ScheduleTypeForBrowser | "Schedule Type" |
| Public property Static member | SectionAttrHeadTag | "Section Head" |
| Public property Static member | SectionAttrTailLength | "Tail length" |
| Public property Static member | SectionAttrTailTag | "Section Tail" |
| Public property Static member | SectionAttrTailWidth | "Tail width" |
| Public property Static member | SectionBrokenDisplayStyle | "Broken Section Display Style" |
| Public property Static member | SectionCoarserScalePulldownImperial | "Hide at scales coarser than" |
| Public property Static member | SectionCoarserScalePulldownMetric | "Hide at scales coarser than" |
| Public property Static member | SectionParentViewName | "Parent View" |
| Public property Static member | SectionShowInOneViewOnly | "Show in" |
| Public property Static member | SectionTag | "Section Tag" |
| Public property Static member | SeekItemId | "Seek Item ID" |
| Public property Static member | SelectionEditableOnly | "Editable only" |
| Public property Static member | SheetApprovedBy | "Approved By" |
| Public property Static member | SheetAssemblyAssemblyCode | "Assembly: Assembly Code" |
| Public property Static member | SheetAssemblyAssemblyDescription | "Assembly: Assembly Description" |
| Public property Static member | SheetAssemblyCost | "Assembly: Cost" |
| Public property Static member | SheetAssemblyDescription | "Assembly: Description" |
| Public property Static member | SheetAssemblyKeynote | "Assembly: Keynote" |
| Public property Static member | SheetAssemblyManufacturer | "Assembly: Manufacturer" |
| Public property Static member | SheetAssemblyModel | "Assembly: Model" |
| Public property Static member | SheetAssemblyName | "Assembly: Name" |
| Public property Static member | SheetAssemblyTypeComments | "Assembly: Type Comments" |
| Public property Static member | SheetAssemblyTypeMark | "Assembly: Type Mark" |
| Public property Static member | SheetAssemblyUrl | "Assembly: URL" |
| Public property Static member | SheetCheckedBy | "Checked By" |
| Public property Static member | SheetCurrentRevision | "Current Revision" |
| Public property Static member | SheetCurrentRevisionDate | "Current Revision Date" |
| Public property Static member | SheetCurrentRevisionDescription | "Current Revision Description" |
| Public property Static member | SheetCurrentRevisionIssued | "Current Revision Issued" |
| Public property Static member | SheetCurrentRevisionIssuedBy | "Current Revision Issued By" |
| Public property Static member | SheetCurrentRevisionIssuedTo | "Current Revision Issued To" |
| Public property Static member | SheetDate | "Date/Time Stamp" |
| Public property Static member | SheetDesignedBy | "Designed By" |
| Public property Static member | SheetDrawnBy | "Drawn By" |
| Public property Static member | SheetFilePath | "File Path" |
| Public property Static member | SheetGuideGrid | "Guide Grid" |
| Public property Static member | SheetHeight | "Sheet Height" |
| Public property Static member | SheetIssueDate | "Sheet Issue Date" |
| Public property Static member | SheetKeyNumber | "Sheet Key Number" |
| Public property Static member | SheetName | "Sheet Name" |
| Public property Static member | SheetNumber | "Sheet Number" |
| Public property Static member | SheetRevisionsOnSheet | "Revisions on Sheet" |
| Public property Static member | SheetScale | "Scale" |
| Public property Static member | SheetScheduled | "Appears In Sheet List" |
| Public property Static member | SheetWidth | "Sheet Width" |
| Public property Static member | ShowArrowheadToCutMark | "Show Arrowhead to Cut Mark" |
| Public property Static member | ShowIconParam | "Flag to display icon in Ribbon Combo Item" |
| Public property Static member | ShowTitle | "Show Title" |
| Public property Static member | SketchGridSpacingParam | "Work Plane Grid Spacing" |
| Public property Static member | SketchPlaneParam | "Work Plane" |
| Public property Static member | SlabEdgeMaterialParam | "Material" |
| Public property Static member | SlabEdgeProfileParam | "Profile" |
| Public property Static member | SlantedColumnBaseCutStyle | "Base Cut Style" |
| Public property Static member | SlantedColumnBaseExtension | "Base Extension" |
| Public property Static member | SlantedColumnGeometryTreatmentBase | "Base Geometry Alignment" |
| Public property Static member | SlantedColumnGeometryTreatmentTop | "Top Geometry Alignment" |
| Public property Static member | SlantedColumnTopCutStyle | "Top Cut Style" |
| Public property Static member | SlantedColumnTopExtension | "Top Extension" |
| Public property Static member | SlantedColumnTypeParam | "Column Style" |
| Public property Static member | SlopeArrowLevelEnd | "Level at Head" |
| Public property Static member | SlopeArrowLevelStart | "Level at Tail" |
| Public property Static member | SlopeEndHeight | "Height Offset at Head" |
| Public property Static member | SlopeStartHeight | "Height Offset at Tail" |
| Public property Static member | SpaceAirChangesPerHour | "Air Changes per Hour" |
| Public property Static member | SpaceAirflowPerAreaParam | "Airflow per area" |
| Public property Static member | SpaceArea | "Area" |
| Public property Static member | SpaceAreaPerPersonParam | "Area per person" |
| Public property Static member | SpaceAssocRoomName | "Room Name" |
| Public property Static member | SpaceAssocRoomNumber | "Room Number" |
| Public property Static member | SpaceCarpetingParam | "Carpeting" |
| Public property Static member | SpaceCoolingSetPoint | "Cooling Set Point" |
| Public property Static member | SpaceDehumidificationSetPoint | "Dehumidification Set Point" |
| Public property Static member | SpaceElecEquipmentRadiantPercentageParam | "Electrical Equipment Radiant" |
| Public property Static member | SpaceHeatingSetPoint | "Heating Set Point" |
| Public property Static member | SpaceHumidificationSetPoint | "Humidification Set Point" |
| Public property Static member | SpaceInfiltrationAirflow | "Infiltration Airflow" |
| Public property Static member | SpaceInfiltrationAirflowPerArea | "Infiltration Airflow per area" |
| Public property Static member | SpaceInfiltrationParam | "Infiltration Airflow per area" |
| Public property Static member | SpaceIsOccupiable | "Occupiable" |
| Public property Static member | SpaceIsPlenum | "Plenum" |
| Public property Static member | SpaceLightingLoadParam | "Lighting Load" |
| Public property Static member | SpaceLightingLoadPerAreaParam | "Lighting Load per area" |
| Public property Static member | SpaceLightingScheduleParam | "Lighting Schedule" |
| Public property Static member | SpaceNameParam | "Name" |
| Public property Static member | SpaceOccupancyScheduleParam | "Occupancy Schedule" |
| Public property Static member | SpaceOutdoorAirflow | "Outdoor Airflow" |
| Public property Static member | SpaceOutdoorAirflowPerArea | "Outdoor Airflow per area" |
| Public property Static member | SpaceOutdoorAirflowPerPerson | "Outdoor Airflow per person" |
| Public property Static member | SpacePeopleActivityLevelParam | "People Activity Level" |
| Public property Static member | SpacePeopleLatentHeatGainPerPersonParam | "Latent Heat Gain per person" |
| Public property Static member | SpacePeopleLoadParam | "Occupancy Load" |
| Public property Static member | SpacePeopleSensibleHeatGainPerPersonParam | "Sensible Heat Gain per person" |
| Public property Static member | SpacePowerLoadParam | "Power Load" |
| Public property Static member | SpacePowerLoadPerAreaParam | "Power Load per area" |
| Public property Static member | SpacePowerScheduleParam | "Power Schedule" |
| Public property Static member | SpaceReferenceLevelParam | "Reference Level" |
| Public property Static member | SpaceVolume | "Volume" |
| Public property Static member | SpaceZoneName | "Zone" |
| Public property Static member | SpacingAppend | "Append Position" |
| Public property Static member | SpacingJustification | "Justification" |
| Public property Static member | SpacingJustificationHoriz | "Justification" |
| Public property Static member | SpacingJustificationn1 | "Justification" |
| Public property Static member | SpacingJustificationn2 | "Justification" |
| Public property Static member | SpacingJustificationU | "Justification" |
| Public property Static member | SpacingJustificationV | "Justification" |
| Public property Static member | SpacingJustificationVert | "Justification" |
| Public property Static member | SpacingLayout | "Layout" |
| Public property Static member | SpacingLayoutHoriz | "Layout" |
| Public property Static member | SpacingLayoutn1 | "Layout" |
| Public property Static member | SpacingLayoutn2 | "Layout" |
| Public property Static member | SpacingLayoutU | "Layout" |
| Public property Static member | SpacingLayoutV | "Layout" |
| Public property Static member | SpacingLayoutVert | "Layout" |
| Public property Static member | SpacingLength | "Spacing" |
| Public property Static member | SpacingLengthHoriz | "Spacing" |
| Public property Static member | SpacingLengthn1 | "Spacing" |
| Public property Static member | SpacingLengthn2 | "Spacing" |
| Public property Static member | SpacingLengthU | "Distance" |
| Public property Static member | SpacingLengthV | "Distance" |
| Public property Static member | SpacingLengthVert | "Spacing" |
| Public property Static member | SpacingNumDivisions | "Number" |
| Public property Static member | SpacingNumDivisionsHoriz | "Number" |
| Public property Static member | SpacingNumDivisionsn1 | "Number" |
| Public property Static member | SpacingNumDivisionsn2 | "Number" |
| Public property Static member | SpacingNumDivisionsU | "Number" |
| Public property Static member | SpacingNumDivisionsV | "Number" |
| Public property Static member | SpacingNumDivisionsVert | "Number" |
| Public property Static member | SpanDirInstParamAngle | "Span Direction" |
| Public property Static member | SpanDirSymParamBottom | "Bottom" |
| Public property Static member | SpanDirSymParamLeft | "Left" |
| Public property Static member | SpanDirSymParamRight | "Right" |
| Public property Static member | SpanDirSymParamTop | "Top" |
| Public property Static member | SpatialFieldMgrCurrentName | "Analysis Configuration" |
| Public property Static member | SpatialFieldMgrDescription | "Description" |
| Public property Static member | SpatialFieldMgrLegendHeight | "Legend Height" |
| Public property Static member | SpatialFieldMgrLegendHorOriginGap | "Legend Horizontal Origin Gap" |
| Public property Static member | SpatialFieldMgrLegendShowConfigName | "Show Configuration Name" |
| Public property Static member | SpatialFieldMgrLegendShowDescription | "Show Description" |
| Public property Static member | SpatialFieldMgrLegendTextType | "Overall Legend Text" |
| Public property Static member | SpatialFieldMgrLegendVertOriginGap | "Legend Vertical Origin Gap" |
| Public property Static member | SpatialFieldMgrLegendWidth | "Legend Width" |
| Public property Static member | SpatialFieldMgrRange | "Data Range" |
| Public property Static member | SpatialFieldMgrResultsVisibility | "Results Visibility" |
| Public property Static member | SpecifySlopeOrOffset | "Specify " |
| Public property Static member | SpotCoordinateBase | "Coordinate Base" |
| Public property Static member | SpotCoordinateBottomPrefix | "Bottom Coordinate Prefix" |
| Public property Static member | SpotCoordinateBottomSuffix | "Bottom Coordinate Suffix" |
| Public property Static member | SpotCoordinateElevationPrefix | "Elevation Prefix" |
| Public property Static member | SpotCoordinateElevationSuffix | "Elevation Suffix" |
| Public property Static member | SpotCoordinateIncludeElevation | "Include Elevation" |
| Public property Static member | SpotCoordinateTopPrefix | "Top Coordinate Prefix" |
| Public property Static member | SpotCoordinateTopSuffix | "Top Coordinate Suffix" |
| Public property Static member | SpotDimLeader | "Leader" |
| Public property Static member | SpotDimLeaderLine | "Leader Line" |
| Public property Static member | SpotDimStyleSlopeUnits | "Units Format" |
| Public property Static member | SpotDimStyleSlopeUnitsAlt | "Alternate Units Format" |
| Public property Static member | SpotElevBase | "Elevation Base" |
| Public property Static member | SpotElevBendLeader | "Leader Shoulder" |
| Public property Static member | SpotElevBotValue | "Bottom Coordinate" |
| Public property Static member | SpotElevDisplayElevations | "Display Elevations" |
| Public property Static member | SpotElevFlipTextVert | "Auto Mirror" |
| Public property Static member | SpotElevIndBottom | "Bottom Indicator" |
| Public property Static member | SpotElevIndElevation | "Elevation Indicator" |
| Public property Static member | SpotElevIndEw | "East / West Indicator" |
| Public property Static member | SpotElevIndNs | "North / South Indicator" |
| Public property Static member | SpotElevIndTop | "Top Indicator" |
| Public property Static member | SpotElevIndType | "Indicator as Prefix / Suffix" |
| Public property Static member | SpotElevIndTypeBottom | "Bottom Indicator as Prefix/Suffix" |
| Public property Static member | SpotElevIndTypeElevation | "Elevation Indicator as Prefix/Suffix" |
| Public property Static member | SpotElevIndTypeTop | "Top Indicator as Prefix/Suffix" |
| Public property Static member | SpotElevLeaderArrowhead | "Leader Arrowhead" |
| Public property Static member | SpotElevLinePen | "Leader Line Weight" |
| Public property Static member | SpotElevLowerPrefix | "Lower Value Prefix" |
| Public property Static member | SpotElevLowerSuffix | "Lower Value Suffix" |
| Public property Static member | SpotElevLowerValue | "Lower Value" |
| Public property Static member | SpotElevRelativeBase | "Relative Base" |
| Public property Static member | SpotElevRotateWithComponent | "Rotate with Component" |
| Public property Static member | SpotElevSingleOrUpperPrefix | "Single/Upper Value Prefix" |
| Public property Static member | SpotElevSingleOrUpperSuffix | "Single/Upper Value Suffix" |
| Public property Static member | SpotElevSingleOrUpperValue | "Single/Upper Value" |
| Public property Static member | SpotElevSymbol | "Symbol" |
| Public property Static member | SpotElevTextHorizOffset | "Text Offset from Symbol" |
| Public property Static member | SpotElevTextLocation | "Text Location" |
| Public property Static member | SpotElevTextOrientation | "Text Orientation" |
| Public property Static member | SpotElevTickMarkPen | "Leader Arrowhead Line Weight" |
| Public property Static member | SpotElevTopValue | "Top Coordinate" |
| Public property Static member | SpotSlopeLeaderLength | "Leader Line Length" |
| Public property Static member | SpotSlopeOffsetFromReference | "Offset from Reference" |
| Public property Static member | SpotSlopePrefix | "Prefix" |
| Public property Static member | SpotSlopeSlopeDirection | "Slope Direction" |
| Public property Static member | SpotSlopeSlopeRepresentation | "Slope Representation" |
| Public property Static member | SpotSlopeSuffix | "Suffix" |
| Public property Static member | SpotTextFromLeader | "Text Offset from Leader" |
| Public property Static member | StairsActualNumberOfRisers | "Actual Number of Risers": The total number of actually created risers in model |
| Public property Static member | StairsActualNumRisers | "Actual Number of Risers" |
| Public property Static member | StairsActualRiserHeight | "Actual Riser Height" |
| Public property Static member | StairsActualTreadDepth | "Actual Tread Depth" |
| Public property Static member | StairsAttrBodyMaterial | "Monolithic Material" |
| Public property Static member | StairsAttrBreakSymInCutline | "Break Symbol in Plan" |
| Public property Static member | StairsAttrCalcEnabled | "Calculation Rules" |
| Public property Static member | StairsAttrCalcMax | "Calculation Rules" |
| Public property Static member | StairsAttrCalcMin | "Calculation Rules" |
| Public property Static member | StairsAttrEqResult | "Calculation Rules" |
| Public property Static member | StairsAttrFirstRiser | "Begin with Riser" |
| Public property Static member | StairsAttrLandingCarriage | "Landing Carriage Height" |
| Public property Static member | StairsAttrLandingsOverlapping | "Landing Overlap" |
| Public property Static member | StairsAttrLastRiser | "End with Riser" |
| Public property Static member | StairsAttrLeftSideStringer | "Left Stringer" |
| Public property Static member | StairsAttrMaxRiserHeight | "Maximum Riser Height" |
| Public property Static member | StairsAttrMinimumTreadDepth | "Minimum Tread Depth" |
| Public property Static member | StairsAttrMonolithicStairs | "Monolithic Stairs" |
| Public property Static member | StairsAttrNosingLength | "Nosing Length" |
| Public property Static member | StairsAttrNosingPlacement | "Apply Nosing Profile" |
| Public property Static member | StairsAttrNumMidStringers | "Middle Stringers" |
| Public property Static member | StairsAttrRightSideStringer | "Right Stringer" |
| Public property Static member | StairsAttrRiserAngle | "Riser Angle" |
| Public property Static member | StairsAttrRiserMaterial | "Riser Material" |
| Public property Static member | StairsAttrRiserMult | "Riser Multiplier" |
| Public property Static member | StairsAttrRisersPresent | "Risers Present" |
| Public property Static member | StairsAttrRiserThickness | "Riser Thickness" |
| Public property Static member | StairsAttrRiserTreadConnect | "Riser to Tread Connection" |
| Public property Static member | StairsAttrRiserType | "Riser Type" |
| Public property Static member | StairsAttrSideStringerTypeParam | "Type of Side Stringers" |
| Public property Static member | StairsAttrStairCalculator | "Calculation Rules" |
| Public property Static member | StairsAttrStairsBottom | "Underside of Winder" |
| Public property Static member | StairsAttrStairsCutOffset | "Extend Below Base" |
| Public property Static member | StairsAttrStringerCarriage | "Stringer Carriage Height" |
| Public property Static member | StairsAttrStringerHeight | "Stringer Height" |
| Public property Static member | StairsAttrStringerMaterial | "Stringer Material" |
| Public property Static member | StairsAttrStringerOffset | "Open Stringer Offset" |
| Public property Static member | StairsAttrStringerThickness | "Stringer Thickness" |
| Public property Static member | StairsAttrTextFont | "Text Font" |
| Public property Static member | StairsAttrTextSize | "Text Size" |
| Public property Static member | StairsAttrTreadFrontProfile | "Nosing Profile" |
| Public property Static member | StairsAttrTreadMaterial | "Tread Material" |
| Public property Static member | StairsAttrTreadMult | "Tread Multiplier" |
| Public property Static member | StairsAttrTreadThickness | "Tread Thickness" |
| Public property Static member | StairsAttrTreadWidth | "Width" |
| Public property Static member | StairsAttrTrimTop | "Trim Stringers at Top" |
| Public property Static member | StairsBaseLevel | "Base Level": The base level of stairs |
| Public property Static member | StairsBaseLevelParam | "Base Level" |
| Public property Static member | StairsBaseOffset | "Base Offset" |
| Public property Static member | StairsCurveType | "Stairs Line Type" |
| Public property Static member | StairsDbgShowAnnotationCutMark | "Cut by Cut Plane" |
| Public property Static member | StairsDbgShowBoundary2d | "Show Stairs' Boundary 2D" |
| Public property Static member | StairsDbgShowBoundary3d | "Show Stairs' Boundary 3D" |
| Public property Static member | StairsDbgShowLandingBoundary | "Show Landing Boundary" |
| Public property Static member | StairsDbgShowLandingFaces | "Show Landing Faces" |
| Public property Static member | StairsDbgShowLandingPath | "Show Landing Path" |
| Public property Static member | StairsDbgShowLeftRunBoundary2d | "Show Run's Left Boundary 2D" |
| Public property Static member | StairsDbgShowLeftRunBoundary3d | "Show Run's Left Boundary 3D" |
| Public property Static member | StairsDbgShowMonolithicSupportCorseGeom | "Show Monolithic Support Corse Geometry" |
| Public property Static member | StairsDbgShowMonolithicSupportGeom | "Show Monolithic Support Geometry" |
| Public property Static member | StairsDbgShowRightRunBoundary2d | "Show Run's Right Boundary 2D" |
| Public property Static member | StairsDbgShowRightRunBoundary3d | "Show Run's Right Boundary 3D" |
| Public property Static member | StairsDbgShowRunCorseGeom | "Show Run Corse Geometry" |
| Public property Static member | StairsDbgShowRunGeom | "Show Run Geometry" |
| Public property Static member | StairsDbgShowRunNosing | "Show Run's Nosings" |
| Public property Static member | StairsDbgShowRunOutlineForPlan | "Show Run Outline For Plan" |
| Public property Static member | StairsDbgShowRunPath2d | "Show Run's Path 2D" |
| Public property Static member | StairsDbgShowRunPath3d | "Show Run's Path 3D" |
| Public property Static member | StairsDbgShowRunRiser | "Show Run's Risers" |
| Public property Static member | StairsDbgShowSupportPath | "Show Support Path" |
| Public property Static member | StairsDbgShowTreadFaces | "Show Run's Tread Faces" |
| Public property Static member | StairsDbgShowTriserCorseGeom | "Show Triser Corse Geometry" |
| Public property Static member | StairsDbgShowTriserGeom | "Show Triser Geometry" |
| Public property Static member | StairsDesiredNumberOfRisers | "Desired Number of Risers": The number of risers is calculated based on stairs height |
| Public property Static member | StairsDesiredNumRisers | "Desired Number of Risers" |
| Public property Static member | StairsDownText | "Down Text" |
| Public property Static member | StairsEnableCalculationRuleChecking | "Enable Calculator Rules Check": Enable calculation rule checking |
| Public property Static member | StairsInstAlwaysUp | "Show Up arrow in all views" |
| Public property Static member | StairsInstDownArrowOn | "Down arrow" |
| Public property Static member | StairsInstDownLabelOn | "Down label" |
| Public property Static member | StairsInstDownLabelText | "Down text" |
| Public property Static member | StairsInstUpArrowOn | "Up arrow" |
| Public property Static member | StairsInstUpLabelOn | "Up label" |
| Public property Static member | StairsInstUpLabelText | "Up text" |
| Public property Static member | StairsLandingBaseElevation | "Relative Height": Height |
| Public property Static member | StairsLandingOverridden | "Overridden": Overridden |
| Public property Static member | StairsLandingStructural | "Structural": Structural |
| Public property Static member | StairsLandingThickness | "Total Thickness": Thickness |
| Public property Static member | StairsLandingtypeHasMonolithicSupport | "Monolithic Support": Monolithic Support |
| Public property Static member | StairsLandingtypeLandingMaterial | "Monolithic Material": Landing Material |
| Public property Static member | StairsLandingtypeStructure | "Structure": Structure |
| Public property Static member | StairsLandingtypeThickness | "Monolithic Thickness": Default thickness |
| Public property Static member | StairsLandingtypeTreadriserType | "Type": Tread/Riser Type |
| Public property Static member | StairsLandingtypeUseSameTriserAsRun | "Same as Run": Same as Run |
| Public property Static member | StairsMinAutomaticLandingDepth | "Minimum Automatic Landing Depth": The minimum depth of automatic landing |
| Public property Static member | StairsMultistoryTopLevelParam | "Multistory Top Level" |
| Public property Static member | StairsMultistoryUpToLevel | "Multistory Top Level": The top level of multi-story stairs |
| Public property Static member | StairsPathFullStepArrow | "Full Step Arrow" |
| Public property Static member | StairsPathStartExtension | "Start Extension" |
| Public property Static member | StairsPathStartFromRiser | "Start from Riser" |
| Public property Static member | StairsRailingAngledConnection | "Angled Joins" |
| Public property Static member | StairsRailingBalusterBottomAngle | "Bottom Cut Angle" |
| Public property Static member | StairsRailingBalusterFamily | "Baluster Family" |
| Public property Static member | StairsRailingBalusterHeight | "Baluster Height" |
| Public property Static member | StairsRailingBalusterIsPost | "Post" |
| Public property Static member | StairsRailingBalusterLength | "Baluster Length" |
| Public property Static member | StairsRailingBalusterOffset | "Baluster Offset" |
| Public property Static member | StairsRailingBalusterPlacement | "Baluster Placement" |
| Public property Static member | StairsRailingBalusterShape | "Baluster Shape" |
| Public property Static member | StairsRailingBalusterSlopeAngle | "Slope Angle" |
| Public property Static member | StairsRailingBalusterSpacing | "Baluster Separation" |
| Public property Static member | StairsRailingBalusterSpacingType | "Baluster Spacing Type (Stair Railing Only)" |
| Public property Static member | StairsRailingBalustersPerTread | "Balusters Per Tread (Stair Railing Only)" |
| Public property Static member | StairsRailingBalusterTopAngle | "Top Cut Angle" |
| Public property Static member | StairsRailingBalusterWidth | "Baluster Width" |
| Public property Static member | StairsRailingBaseLevelParam | "Base Level" |
| Public property Static member | StairsRailingConnection | "Rail Connections" |
| Public property Static member | StairsRailingHeight | "Railing Height" |
| Public property Static member | StairsRailingHeightOffset | "Base Offset" |
| Public property Static member | StairsRailingHeightShiftType | "Use Landing Height Adjustment" |
| Public property Static member | StairsRailingHeightShiftVal | "Landing Height Adjustment" |
| Public property Static member | StairsRailingPlacementOffset | "Offset from Path" |
| Public property Static member | StairsRailingRailHeight | "Rail Height" |
| Public property Static member | StairsRailingRailName | "Name" |
| Public property Static member | StairsRailingRailOffset | "Rail Offset" |
| Public property Static member | StairsRailingRailStructure | "Rail Structure (Non-Continuous)" |
| Public property Static member | StairsRailingShape | "Rail Shape" |
| Public property Static member | StairsRailingTangentConnection | "Tangent Joins" |
| Public property Static member | StairsRailingThickness | "Railing Thickness" |
| Public property Static member | StairsRailingWidth | "Railing Width" |
| Public property Static member | StairsRunActualNumberOfRisers | "Actual Number of Risers": Actual Number of Risers |
| Public property Static member | StairsRunActualNumberOfTreads | "Actual Number of Treads": Actual Number of Treads |
| Public property Static member | StairsRunActualRiserHeight | "Actual Riser Height": Actual Riser Height |
| Public property Static member | StairsRunActualRunWidth | "Actual Run Width": Actual Run Width |
| Public property Static member | StairsRunActualTreadDepth | "Actual Tread Depth": Actual Tread Depth |
| Public property Static member | StairsRunBeginWithRiser | "Begin with Riser": Begin with Riser |
| Public property Static member | StairsRunBottomElevation | "Relative Base Height": Relative height to stairs bottom elevation |
| Public property Static member | StairsRunCcw | "CCW": Revert the run preview |
| Public property Static member | StairsRunCenterMarkVisible | "Center Mark Visible": Center Mark Visible |
| Public property Static member | StairsRunCreateAutoLanding | "With Automatic Landing": Create automatic landing |
| Public property Static member | StairsRunEndWithRiser | "End with Riser": End with Riser |
| Public property Static member | StairsRunExtendBelowRiserBase | "Extend Below Riser Base": Extend Below Base |
| Public property Static member | StairsRunExtendBelowTreadBase | "Extend Below Tread Base": Extend Below Tread Base |
| Public property Static member | StairsRunHeight | "Run Height": Run Height |
| Public property Static member | StairsRunLocationpathJustfication | "Location Line": Location Line |
| Public property Static member | StairsRunOverridden | "Overridden": Overridden |
| Public property Static member | StairsRunStructural | "Structural": Structural |
| Public property Static member | StairsRunTopElevation | "Relative Top Height": Top height of run |
| Public property Static member | StairsRuntypeHasMonolithicSupport | "Monolithic Support": Monolithic Support |
| Public property Static member | StairsRuntypeRunMaterial | "Monolithic Material": Material |
| Public property Static member | StairsRuntypeStructuralDepth | "Structural Depth": Structural Depth |
| Public property Static member | StairsRuntypeStructure | "Structure": Structure |
| Public property Static member | StairsRuntypeTotalDepth | "Total Depth": Total Depth |
| Public property Static member | StairsRuntypeUndersideSurfaceType | "Underside Surface": Underside Surface |
| Public property Static member | StairsRunWidthMeasurement | "Run Width Measurement": Run Width Measurement |
| Public property Static member | StairsRunWinderBeginWithStraight | "Begin with Straight Run": Winder begin with straight run |
| Public property Static member | StairsRunWinderEndWithStraight | "End with Straight Run": Winder end with straight run |
| Public property Static member | StairsShowDownText | "Show Down Text" |
| Public property Static member | StairsShowUpText | "Show Up Text" |
| Public property Static member | StairsStairsHeight | "Desired Stair Height": Stairs unconnected height |
| Public property Static member | StairsStringersPresent | "Stringer Position" |
| Public property Static member | StairsSupportHorizontalOffset | "Lateral Offset": Distance from center or edge of boundary |
| Public property Static member | StairsSupportLandingsupportType | "Landing Support Type": Landing Support Type |
| Public property Static member | StairsSupportLowerEndCut | "Lower End Cut": Lower End Cut |
| Public property Static member | StairsSupportOverridden | "Overridden": Overridden |
| Public property Static member | StairsSupportTrimSupportUpper | "Trim Support at Upper": Trim Support at Upper |
| Public property Static member | StairsSupporttypeFlipSectionProfile | "Flip Section Profile": Flip Section Profile |
| Public property Static member | StairsSupporttypeMaterial | "Material": Material |
| Public property Static member | StairsSupporttypeSectionProfile | "Section Profile": Section Profile |
| Public property Static member | StairsSupporttypeStructuralDepth | "Structural Depth": Structural Depth |
| Public property Static member | StairsSupporttypeStructuralDepthOnLanding | "Structural Depth On Landing": Structural Depth |
| Public property Static member | StairsSupporttypeStructuralDepthOnRun | "Structural Depth On Run": Structural Depth |
| Public property Static member | StairsSupporttypeTopsideSurface | "Topside Surface": Topside Surface |
| Public property Static member | StairsSupporttypeTotalDepth | "Total Depth": Total Depth |
| Public property Static member | StairsSupporttypeUndersideSurface | "Underside Surface": Underside Surface |
| Public property Static member | StairsSupporttypeWidth | "Width": Width |
| Public property Static member | StairsSupportUpperEndCut | "Upper End Cut": Upper End Cut |
| Public property Static member | StairsSupportVerticalOffset | "Vertical Offset": Distance of top plane of edge stringer relative to the plane connecting tread nosing |
| Public property Static member | StairsTextOrientation | "Orientation" |
| Public property Static member | StairsTextType | "Text Type" |
| Public property Static member | StairsTopLevel | "Top Level": The top level of stairs |
| Public property Static member | StairsTopLevelParam | "Top Level" |
| Public property Static member | StairsTopOffset | "Top Offset" |
| Public property Static member | StairsTotalNumberOfRisers | "Total Number of Risers": Total number of risers |
| Public property Static member | StairsTotalNumberOfTreads | "Total Number of Treads": Total number of treads |
| Public property Static member | StairsTriserIsTypeOverridden | "Overridden": (OBSOLETE) Indicate whether selected individual step is governed by default type setting. |
| Public property Static member | StairsTriserNumberBaseIndex | "Tread/Riser Start Number": |
| Public property Static member | StairsTriserRiserMark | "Riser Mark": (OBSOLETE) |
| Public property Static member | StairsTriserRiserNumber | "Riser Number": Count the sequential number of riser in the stair. |
| Public property Static member | StairsTriserTreadMark | "Tread Mark": (OBSOLETE) |
| Public property Static member | StairsTriserTreadNumber | "Tread Number": Count the sequential number of tread in the stair. |
| Public property Static member | StairsTrisertypeBackNosing | "Back Nosing": (OBSOLETE) |
| Public property Static member | StairsTrisertypeFrontNosing | "Front Nosing": (OBSOLETE) |
| Public property Static member | StairsTrisertypeLeftNosing | "Left Nosing": (OBSOLETE) |
| Public property Static member | StairsTrisertypeNosingLength | "Nosing Length" |
| Public property Static member | StairsTrisertypeNosingPlacement | "Apply Nosing Profile" |
| Public property Static member | StairsTrisertypeNosingProfile | "Nosing Profile" |
| Public property Static member | StairsTrisertypeRightNosing | "Right Nosing": (OBSOLETE) |
| Public property Static member | StairsTrisertypeRiser | "Riser" |
| Public property Static member | StairsTrisertypeRiserIsSlanted | "Slanted" |
| Public property Static member | StairsTrisertypeRiserMaterial | "Riser Material" |
| Public property Static member | StairsTrisertypeRiserProfile | "Riser Profile" |
| Public property Static member | StairsTrisertypeRiserStyle | "Riser Type": (OBSOLETE) |
| Public property Static member | StairsTrisertypeRiserThickness | "Riser Thickness" |
| Public property Static member | StairsTrisertypeRiserTreadConnection | "Riser To Tread Connection" |
| Public property Static member | StairsTrisertypeTread | "Tread" |
| Public property Static member | StairsTrisertypeTreadMaterial | "Tread Material" |
| Public property Static member | StairsTrisertypeTreadProfile | "Tread Profile" |
| Public property Static member | StairsTrisertypeTreadThickness | "Tread Thickness" |
| Public property Static member | StairstypeCalcRuleMaxResult | "Max. Result": Calculation Rule Max Result |
| Public property Static member | StairstypeCalcRuleMinResult | "Min. Result": Calculation Rule Min Result |
| Public property Static member | StairstypeCalcRuleRiserMultiplier | "Riser Multiplier": Calculation Rule Riser Multiplier |
| Public property Static member | StairstypeCalcRuleTargetResult | "Target Result": Calculation Rule Target Result |
| Public property Static member | StairstypeCalcRuleTreadMultiplier | "Tread Multiplier": Calculation Rule Tread Multiplier |
| Public property Static member | StairstypeCalculationRules | "Calculation Rules": Calculation Rules |
| Public property Static member | StairstypeConstructionMethod | "Construction Method": |
| Public property Static member | StairstypeCutmarkType | "Cut Mark Type": Cut Mark Type |
| Public property Static member | StairstypeGeomunjoinedEndCutStyle | "Connection Method": Cut Style for Geometrically Unjoined End |
| Public property Static member | StairstypeHasIntermediateSupport | "Middle Support": Whether stairs is assembled |
| Public property Static member | StairstypeHasLeftSupport | "Left Support": |
| Public property Static member | StairstypeHasRightSupport | "Right Support": |
| Public property Static member | StairstypeIntermediateSupportType | "Middle Support Type": Intermediate Support Type |
| Public property Static member | StairstypeIsAssembledStairs | "Assembled Stair": Whether stairs is assembled |
| Public property Static member | StairstypeLandingType | "Landing Type": Landing Type |
| Public property Static member | StairstypeLeftSideSupportType | "Left Support Type": Left Side Support Type |
| Public property Static member | StairstypeLeftSupportLateralOffset | "Left Lateral Offset": |
| Public property Static member | StairstypeMaximumRiserHeight | "Max. Riser Height": Maximum Riser Height |
| Public property Static member | StairstypeMinimumRunWidth | "Minimum Run Width": Minimum Run Width |
| Public property Static member | StairstypeMinimumTreadDepth | "Min. Tread Depth": Minimum Tread Depth |
| Public property Static member | StairstypeMinimumTreadWidthInsideBoundary | "Min. Tread Depth on Winder Inner Boundary": Minimum Tread Width on Inside Boundary |
| Public property Static member | StairstypeNotchCustomWidth | "Custom": |
| Public property Static member | StairstypeNotchExtension | "Notch Extension": |
| Public property Static member | StairstypeNotchHorizontalGap | "Horizontal Gap Distance": |
| Public property Static member | StairstypeNotchThickness | "Notch Thickness": |
| Public property Static member | StairstypeNotchVerticalGap | "Vertical Gap Distance": |
| Public property Static member | StairstypeNotchWidth | "Notch Width": |
| Public property Static member | StairstypeNumberOfIntermediateSupports | "Middle Support Number": Number of intermediate supports |
| Public property Static member | StairstypeRightSideSupportType | "Right Support Type": Right Side Support Type |
| Public property Static member | StairstypeRightSupportLateralOffset | "Right Lateral Offset": |
| Public property Static member | StairstypeRunType | "Run Type": Run Type |
| Public property Static member | StairstypeShowCutline | "Show Cut Line in Plan": Show Cut Line in Plan |
| Public property Static member | StairstypeShowStairPath | "Show Stair Path in Plan": Show Stair Path in Plan |
| Public property Static member | StairstypeShowUpdown | "Show Up/Down in Plan": Show Up/Down in Plan |
| Public property Static member | StairstypeWinderStepFrontMeasurement | "Winder Algorithm": Winder Algorithm |
| Public property Static member | StairsUpText | "Up Text" |
| Public property Static member | StairsWinderpatternFilletInsideCorner | "Fillet on Corner": Fillet on inside corner |
| Public property Static member | StairsWinderpatternMinimumWidthCorner | "Minimum Width on Inside Boundary": Minimum Width on Inside Boundary |
| Public property Static member | StairsWinderpatternMinimumWidthInsideWalkline | "Minimum Width on Inside Walk Line": Minimum width on inside walkline |
| Public property Static member | StairsWinderpatternNumberOfStraightStepsAtBegin | "Parallel Treads at Start": Number of straight steps at the begin of winder |
| Public property Static member | StairsWinderpatternNumberOfStraightStepsAtEnd | "Parallel Treads at End": Number of straight steps at the begin of winder |
| Public property Static member | StairsWinderpatternRadiusInterior | "Fillet Radius": The fillet corner radius on the interior boundary |
| Public property Static member | StairsWinderpatternStairPathOffset | "Inside Walk Line Offset": The offset from inside walk line to interior boundary |
| Public property Static member | StairsWinderpatternWinderStyle | "Winder Style": Winder Style |
| Public property Static member | StartExtension | "Start Extension" |
| Public property Static member | StartJoinCutback | "Start Join Cutback" |
| Public property Static member | StartSymbolType | "Start Symbol Type" |
| Public property Static member | StartYJustification | "Start y Justification" |
| Public property Static member | StartYOffsetValue | "Start y Offset Value" |
| Public property Static member | StartZJustification | "Start z Justification" |
| Public property Static member | StartZOffsetValue | "Start z Offset Value" |
| Public property Static member | SteelElemAnchorAssembly | "Assembly" |
| Public property Static member | SteelElemAnchorDiameter | "Diameter" |
| Public property Static member | SteelElemAnchorGrade | "Grade" |
| Public property Static member | SteelElemAnchorLength | "Length" |
| Public property Static member | SteelElemAnchorOrientation | "Anchor Orientation" |
| Public property Static member | SteelElemAnchorStandard | "Standard" |
| Public property Static member | SteelElemAnchorTotalWeight | "Total Weight" |
| Public property Static member | SteelElemBoltAssembly | "Assembly" |
| Public property Static member | SteelElemBoltCoating | "Coating" |
| Public property Static member | SteelElemBoltDiameter | "Diameter" |
| Public property Static member | SteelElemBoltFinishCalculationAtGap | "Finish Calculation At Gap" |
| Public property Static member | SteelElemBoltGrade | "Grade" |
| Public property Static member | SteelElemBoltGripLength | "Grip Length" |
| Public property Static member | SteelElemBoltGripLengthIncrease | "Grip Length Increase" |
| Public property Static member | SteelElemBoltInverted | "Inverted" |
| Public property Static member | SteelElemBoltLength | "Bolt Length" |
| Public property Static member | SteelElemBoltLocation | "Location" |
| Public property Static member | SteelElemBoltStandard | "Standard" |
| Public property Static member | SteelElemBoltTotalWeight | "Total Weight" |
| Public property Static member | SteelElemCoating | "Coating" |
| Public property Static member | SteelElemContourGapWidth | "Gap Width" |
| Public property Static member | SteelElemContourSide1dist | "Boundary distance 1" |
| Public property Static member | SteelElemContourSide2dist | "Boundary distance 2" |
| Public property Static member | SteelElemCopeAroundAxis | "Around beam axis" |
| Public property Static member | SteelElemCopeAxisAngle | "Tilt angle" |
| Public property Static member | SteelElemCopeDistanceAxis | "Distance from axis" |
| Public property Static member | SteelElemCopeWidthx | "Cutback" |
| Public property Static member | SteelElemCopeXAngle | "Cross-section rotation" |
| Public property Static member | SteelElemCopeZAngle | "Plan rotation" |
| Public property Static member | SteelElemCutLength | "Cut Length" |
| Public property Static member | SteelElemCutType | "Type" |
| Public property Static member | SteelElemExactWeight | "Exact Weight" |
| Public property Static member | SteelElemHoleAlpha | "Taper Angle" |
| Public property Static member | SteelElemHoleAngle | "Chamfer angle" |
| Public property Static member | SteelElemHoleBackTaperThread | "Back taper thread" |
| Public property Static member | SteelElemHoleDefinition | "Hole Definition" |
| Public property Static member | SteelElemHoleDepth | "Hole Depth" |
| Public property Static member | SteelElemHoleDepthOfBoltHead | "Depth of bolt head" |
| Public property Static member | SteelElemHoleDiameter | "Diameter" |
| Public property Static member | SteelElemHoleHeadDiameter | "Head diameter" |
| Public property Static member | SteelElemHoleSlotDirection | "Along side 1" |
| Public property Static member | SteelElemHoleSlotLength | "Length of the slot" |
| Public property Static member | SteelElemHoleTapping | "Right-handed thread" |
| Public property Static member | SteelElemHoleTappingHole | "Tapping hole" |
| Public property Static member | SteelElemHoleType | "Type" |
| Public property Static member | SteelElemPaintArea | "Paint Area" |
| Public property Static member | SteelElemParamBoringout | "Boring out" |
| Public property Static member | SteelElemParamRadius | "Radius" |
| Public property Static member | SteelElemPatternEdgeDistanceX | "Edge distance on side 1" |
| Public property Static member | SteelElemPatternEdgeDistanceY | "Edge distance on side 2" |
| Public property Static member | SteelElemPatternIntermediateDistanceX | "Intermediate distance on side 1" |
| Public property Static member | SteelElemPatternIntermediateDistanceY | "Intermediate distance on side 2" |
| Public property Static member | SteelElemPatternNumber | "Number" |
| Public property Static member | SteelElemPatternNumberX | "Number on side 1" |
| Public property Static member | SteelElemPatternNumberY | "Number on side 2" |
| Public property Static member | SteelElemPatternRadius | "Radius" |
| Public property Static member | SteelElemPatternTotalLength | "Length on side 1" |
| Public property Static member | SteelElemPatternTotalWidth | "Length on side 2" |
| Public property Static member | SteelElemPlateArea | "Area" |
| Public property Static member | SteelElemPlateExactWeight | "Exact Weight" |
| Public property Static member | SteelElemPlateJustification | "Justification" |
| Public property Static member | SteelElemPlateLength | "Length" |
| Public property Static member | SteelElemPlatePaintArea | "Paint Area" |
| Public property Static member | SteelElemPlateShortenAngle | "Angle" |
| Public property Static member | SteelElemPlateShortenCutstraight | "Cut straight" |
| Public property Static member | SteelElemPlateShortenSuction | "Suction" |
| Public property Static member | SteelElemPlateThickness | "Thickness" |
| Public property Static member | SteelElemPlateType | "Type" |
| Public property Static member | SteelElemPlateVolume | "Volume" |
| Public property Static member | SteelElemPlateWeight | "Weight" |
| Public property Static member | SteelElemPlateWidth | "Width" |
| Public property Static member | SteelElemProfileLength | "Length" |
| Public property Static member | SteelElemProfileType | "Profile Type" |
| Public property Static member | SteelElemProfileVolume | "Volume" |
| Public property Static member | SteelElemShearstudDiameter | "Diameter" |
| Public property Static member | SteelElemShearstudGrade | "Grade" |
| Public property Static member | SteelElemShearstudLength | "Length" |
| Public property Static member | SteelElemShearstudStandard | "Standard" |
| Public property Static member | SteelElemShearstudTotalWeight | "Total Weight" |
| Public property Static member | SteelElemShortenAngley | "Angle along height" |
| Public property Static member | SteelElemShortenAnglez | "Angle along width" |
| Public property Static member | SteelElemShortenReflength | "Length" |
| Public property Static member | SteelElemWeight | "Weight" |
| Public property Static member | SteelElemWeldContinuous | "Continuous" |
| Public property Static member | SteelElemWeldDoubleEffectivethroat | "Double Effective Throat" |
| Public property Static member | SteelElemWeldDoublePrepdepth | "Double Preparation Depth" |
| Public property Static member | SteelElemWeldDoubleRootopening | "Double Root Opening" |
| Public property Static member | SteelElemWeldDoubleSurfaceshape | "Double Surface Shape" |
| Public property Static member | SteelElemWeldDoubleText | "Double Text" |
| Public property Static member | SteelElemWeldDoubleThickness | "Double Thickness" |
| Public property Static member | SteelElemWeldDoubleType | "Double Type" |
| Public property Static member | SteelElemWeldDoubleWeldprep | "Double Weld preparation" |
| Public property Static member | SteelElemWeldLength | "Length" |
| Public property Static member | SteelElemWeldLocation | "Location" |
| Public property Static member | SteelElemWeldMainEffectivethroat | "Main Effective Throat" |
| Public property Static member | SteelElemWeldMainPrepdepth | "Main Preparation Depth" |
| Public property Static member | SteelElemWeldMainRootopening | "Main Root Opening" |
| Public property Static member | SteelElemWeldMainSurfaceshape | "Surface Shape" |
| Public property Static member | SteelElemWeldMainText | "Main Text" |
| Public property Static member | SteelElemWeldMainThickness | "Main Thickness" |
| Public property Static member | SteelElemWeldMainType | "Main Type" |
| Public property Static member | SteelElemWeldMainWeldprep | "Main Weld preparation" |
| Public property Static member | SteelElemWeldPitch | "Pitch" |
| Public property Static member | SteelElemWeldPrefix | "Prefix" |
| Public property Static member | SteelElemWeldTextModule | "Text module" |
| Public property Static member | SteelElemXDistance | "Side 1" |
| Public property Static member | SteelElemYDistance | "Side 2" |
| Public property Static member | SteelElemZclipType | "Boundary" |
| Public property Static member | StiffenerClassification | "Classification" |
| Public property Static member | StructConnectionApplyTo | "Apply to" |
| Public property Static member | StructConnectionBeamEnd | "End Connection" |
| Public property Static member | StructConnectionBeamStart | "Start Connection" |
| Public property Static member | StructConnectionColumnBase | "Base Connection" |
| Public property Static member | StructConnectionColumnTop | "Top Connection" |
| Public property Static member | StructConnectionCutback | "Automatic Cutback for Beams and Braces" |
| Public property Static member | StructConnectionTypeName | "Name" |
| Public property Static member | StructFramJoinStatus | "Join Status" |
| Public property Static member | StructuralAnalyticalBeamHorizontalProjectionPlane | "Horizontal Projection" |
| Public property Static member | StructuralAnalyticalBeamRigidLink | "Analytical Links" |
| Public property Static member | StructuralAnalyticalColumnHorizontalProjectionPlane | "Horizontal Projection" |
| Public property Static member | StructuralAnalyticalColumnRigidLink | "Analytical Links" |
| Public property Static member | StructuralAnalyticalHardPoints | "Use hard-points" |
| Public property Static member | StructuralAnalyticalModel | "Enable Analytical Model" |
| Public property Static member | StructuralAnalyticalProjectFloorPlane | "Vertical Projection" |
| Public property Static member | StructuralAnalyticalProjectMemberPlane | "Vertical Projection" |
| Public property Static member | StructuralAnalyticalProjectMemberPlaneColumnBottom | "Bottom Vertical Projection" |
| Public property Static member | StructuralAnalyticalProjectMemberPlaneColumnTop | "Top Vertical Projection" |
| Public property Static member | StructuralAnalyticalTessDeviation | "Maximum discretized offset" |
| Public property Static member | StructuralAnalyticalTessellate | "Approximate curve" |
| Public property Static member | StructuralAnalyzesAs | "Analyze As" |
| Public property Static member | StructuralAssetParam | "Physical Material Asset" |
| Public property Static member | StructuralAttachmentBaseDistance | "Base Attachment Distance" |
| Public property Static member | StructuralAttachmentBaseRatio | "Base Attachment Ratio" |
| Public property Static member | StructuralAttachmentBaseReferencedend | "Base Attachment Referenced End" |
| Public property Static member | StructuralAttachmentBaseType | "Base Attachment Type" |
| Public property Static member | StructuralAttachmentEndLevelReference | "End Attachment Level Reference" |
| Public property Static member | StructuralAttachmentEndRefelementEnd | "End of Attachment to Reference Element" |
| Public property Static member | StructuralAttachmentEndType | "End Attachment Type" |
| Public property Static member | StructuralAttachmentEndValueDistance | "End Attachment Distance" |
| Public property Static member | StructuralAttachmentEndValueElevation | "End Attachment Elevation" |
| Public property Static member | StructuralAttachmentEndValueRatio | "End attachment ratio" |
| Public property Static member | StructuralAttachmentStartLevelReference | "Start Attachment Level Reference" |
| Public property Static member | StructuralAttachmentStartRefelementEnd | "Start of Attachment to Reference Element" |
| Public property Static member | StructuralAttachmentStartType | "Start Attachment Type" |
| Public property Static member | StructuralAttachmentStartValueDistance | "Start Attachment Distance" |
| Public property Static member | StructuralAttachmentStartValueElevation | "Start Attachment Elevation" |
| Public property Static member | StructuralAttachmentStartValueRatio | "Start Attachment Ratio" |
| Public property Static member | StructuralAttachmentTopDistance | "Top Attachment Distance" |
| Public property Static member | StructuralAttachmentTopRatio | "Top Attachment Ratio" |
| Public property Static member | StructuralAttachmentTopReferencedend | "Top Attachment Referenced End" |
| Public property Static member | StructuralAttachmentTopType | "Top Attachment Type" |
| Public property Static member | StructuralBeamCutbackForColumn | "Beam cutback in plan" |
| Public property Static member | StructuralBeamEnd0Elevation | "Start Level Offset" |
| Public property Static member | StructuralBeamEnd1Elevation | "End Level Offset" |
| Public property Static member | StructuralBeamEndAttachmentDistance | "End Attachment Distance" |
| Public property Static member | StructuralBeamEndAttachmentRefcolumnEnd | "End of Attachment to Reference Column" |
| Public property Static member | StructuralBeamEndAttachmentType | "End Attachment Type" |
| Public property Static member | StructuralBeamEndSupport | "Beam End Pocket Seat" |
| Public property Static member | StructuralBeamOrientation | "Orientation" |
| Public property Static member | StructuralBeamStartAttachmentDistance | "Start Attachment Distance" |
| Public property Static member | StructuralBeamStartAttachmentRefcolumnEnd | "Start of Attachment to Reference Column" |
| Public property Static member | StructuralBeamStartAttachmentType | "Start Attachment Type" |
| Public property Static member | StructuralBeamStartSupport | "Beam Start Pocket Seat" |
| Public property Static member | StructuralBendDirAngle | "Cross-Section Rotation" |
| Public property Static member | StructuralBottomReleaseFx | "Base Fx" |
| Public property Static member | StructuralBottomReleaseFy | "Base Fy" |
| Public property Static member | StructuralBottomReleaseFz | "Base Fz" |
| Public property Static member | StructuralBottomReleaseMx | "Base Mx" |
| Public property Static member | StructuralBottomReleaseMy | "Base My" |
| Public property Static member | StructuralBottomReleaseMz | "Base Mz" |
| Public property Static member | StructuralBottomReleaseType | "Base Release" |
| Public property Static member | StructuralBraceRepresentation | "Representation Type" |
| Public property Static member | StructuralCamber | "Camber Size" |
| Public property Static member | StructuralConnectionApprovalStatus | "Approval Status" |
| Public property Static member | StructuralConnectionCodeCheckingStatus | "Code Checking Status" |
| Public property Static member | StructuralConnectionEditRangesOfApplicability | "Modify Ranges of applicability" |
| Public property Static member | StructuralConnectionEditType | "Modify Parameters" |
| Public property Static member | StructuralConnectionInputElements | "Input Elements" |
| Public property Static member | StructuralConnectionModifyConnectionParameters | "Detailed Parameters" |
| Public property Static member | StructuralConnectionNobleStatus | "Noble Status" |
| Public property Static member | StructuralConnectionOverrideType | "Override by Instance" |
| Public property Static member | StructuralConnectionSymbol | "Connection Symbol" |
| Public property Static member | StructuralCopingDistance | "Coping Distance" |
| Public property Static member | StructuralDisplayInHiddenViews | "Display in Hidden Views" |
| Public property Static member | StructuralDisplayInHiddenViewsColumn | "Display in Hidden Views" |
| Public property Static member | StructuralDisplayInHiddenViewsFraming | "Display in Hidden Views" |
| Public property Static member | StructuralElevationAtBottom | "Elevation at Bottom" |
| Public property Static member | StructuralElevationAtBottomCore | "Elevation at Bottom Core" |
| Public property Static member | StructuralElevationAtBottomSurvey | "Elevation at Bottom Survey" |
| Public property Static member | StructuralElevationAtTop | "Elevation at Top" |
| Public property Static member | StructuralElevationAtTopCore | "Elevation at Top Core" |
| Public property Static member | StructuralElevationAtTopSurvey | "Elevation at Top Survey" |
| Public property Static member | StructuralEndReleaseFx | "End Fx" |
| Public property Static member | StructuralEndReleaseFy | "End Fy" |
| Public property Static member | StructuralEndReleaseFz | "End Fz" |
| Public property Static member | StructuralEndReleaseMx | "End Mx" |
| Public property Static member | StructuralEndReleaseMy | "End My" |
| Public property Static member | StructuralEndReleaseMz | "End Mz" |
| Public property Static member | StructuralEndReleaseType | "End Release" |
| Public property Static member | StructuralFamilyCodeName | "Code Name" |
| Public property Static member | StructuralFamilyNameKey | "Family Name Key" |
| Public property Static member | StructuralFloorAnalyzesAs | "Analyze As" |
| Public property Static member | StructuralFloorCoreThickness | "Core Thickness" |
| Public property Static member | StructuralFoundationLength | "Length" |
| Public property Static member | StructuralFoundationThickness | "Foundation Thickness" |
| Public property Static member | StructuralFoundationWidth | "Width" |
| Public property Static member | StructuralFrameCutLength | "Cut Length" |
| Public property Static member | StructuralMaterialParam | "Structural Material" |
| Public property Static member | StructuralMaterialType | "Structural Material Type" |
| Public property Static member | StructuralMemberForces | "Member Forces" |
| Public property Static member | StructuralNumberOfStuds | "Number of studs" |
| Public property Static member | StructuralReferenceLevelElevation | "Reference Level Elevation" |
| Public property Static member | StructuralSectionArea | "Section Area" |
| Public property Static member | StructuralSectionBottomCutHeight | "Bottom Cut Height" |
| Public property Static member | StructuralSectionBottomCutWidth | "Bottom Cut Width" |
| Public property Static member | StructuralSectionCantileverHeight | "Cantilever Height" |
| Public property Static member | StructuralSectionCantileverLength | "Cantilever Length" |
| Public property Static member | StructuralSectionCommonAlpha | "Principal Axes Angle" |
| Public property Static member | StructuralSectionCommonCentroidHoriz | "Centroid Horizontal" |
| Public property Static member | StructuralSectionCommonCentroidVertical | "Centroid Vertical" |
| Public property Static member | StructuralSectionCommonDiameter | "Diameter" |
| Public property Static member | StructuralSectionCommonElasticModulusStrongAxis | "Elastic Modulus strong axis" |
| Public property Static member | StructuralSectionCommonElasticModulusWeakAxis | "Elastic Modulus weak axis" |
| Public property Static member | StructuralSectionCommonHeight | "Height" |
| Public property Static member | StructuralSectionCommonMomentOfInertiaStrongAxis | "Moment of Inertia strong axis" |
| Public property Static member | StructuralSectionCommonMomentOfInertiaWeakAxis | "Moment of Inertia weak axis" |
| Public property Static member | StructuralSectionCommonNominalWeight | "Nominal Weight" |
| Public property Static member | StructuralSectionCommonPerimeter | "Perimeter" |
| Public property Static member | StructuralSectionCommonPlasticModulusStrongAxis | "Plastic Modulus strong axis" |
| Public property Static member | StructuralSectionCommonPlasticModulusWeakAxis | "Plastic Modulus weak axis" |
| Public property Static member | StructuralSectionCommonShearAreaStrongAxis | "Shear Area strong axis" |
| Public property Static member | StructuralSectionCommonShearAreaWeakAxis | "Shear Area weak axis" |
| Public property Static member | StructuralSectionCommonTorsionalModulus | "Torsional Modulus" |
| Public property Static member | StructuralSectionCommonTorsionalMomentOfInertia | "Torsional Moment of Inertia" |
| Public property Static member | StructuralSectionCommonWarpingConstant | "Warping Constant" |
| Public property Static member | StructuralSectionCommonWidth | "Width" |
| Public property Static member | StructuralSectionCprofileFoldLength | "Fold Length" |
| Public property Static member | StructuralSectionHssInnerfillet | "Inner Fillet" |
| Public property Static member | StructuralSectionHssOuterfillet | "Outer Fillet" |
| Public property Static member | StructuralSectionIshapeBoltDiameter | "Bolt Diameter" |
| Public property Static member | StructuralSectionIshapeBoltSpacing | "Bolt Spacing" |
| Public property Static member | StructuralSectionIshapeBoltSpacingBetweenRows | "Bolt Spacing between Rows" |
| Public property Static member | StructuralSectionIshapeBoltSpacingTwoRows | "Bolt Spacing Two Rows" |
| Public property Static member | StructuralSectionIshapeBoltSpacingWeb | "Bolt Spacing web" |
| Public property Static member | StructuralSectionIshapeClearWebHeight | "Clear Web Height" |
| Public property Static member | StructuralSectionIshapeFlangefillet | "Flange Fillet" |
| Public property Static member | StructuralSectionIshapeFlangethickness | "Flange Thickness" |
| Public property Static member | StructuralSectionIshapeFlangethicknessLocation | "Flange Thickness Location" |
| Public property Static member | StructuralSectionIshapeFlangeToeOfFillet | "Flange Toe of Fillet" |
| Public property Static member | StructuralSectionIshapeWebfillet | "Web Fillet" |
| Public property Static member | StructuralSectionIshapeWebheight | "Web Height" |
| Public property Static member | StructuralSectionIshapeWebthickness | "Web Thickness" |
| Public property Static member | StructuralSectionIshapeWebthicknessLocation | "Web Thickness Location" |
| Public property Static member | StructuralSectionIshapeWebToeOfFillet | "Web Toe of Fillet" |
| Public property Static member | StructuralSectionIweldedBottomflangethickness | "Bottom Flange Thickness" |
| Public property Static member | StructuralSectionIweldedBottomflangewidth | "Bottom Flange Width" |
| Public property Static member | StructuralSectionIweldedTopflangethickness | "Top Flange Thickness" |
| Public property Static member | StructuralSectionIweldedTopflangewidth | "Top Flange Width" |
| Public property Static member | StructuralSectionLangleBoltDiameterLongerFlange | "Bolt Diameter Longer Flange" |
| Public property Static member | StructuralSectionLangleBoltDiameterShorterFlange | "Bolt Diameter Shorter Flange" |
| Public property Static member | StructuralSectionLangleBoltSpacing1LongerFlange | "Bolt Spacing 1 Longer Flange" |
| Public property Static member | StructuralSectionLangleBoltSpacing2LongerFlange | "Bolt Spacing 2 Longer Flange" |
| Public property Static member | StructuralSectionLangleBoltSpacingShorterFlange | "Bolt Spacing Shorter Flange" |
| Public property Static member | StructuralSectionLprofileLipLength | "Lip Length" |
| Public property Static member | StructuralSectionNameKey | "Section Name Key" |
| Public property Static member | StructuralSectionPipestandardWalldesignthickness | "Wall Design Thickness" |
| Public property Static member | StructuralSectionPipestandardWallnominalthickness | "Wall Nominal Thickness" |
| Public property Static member | StructuralSectionShape | "Section Shape" |
| Public property Static member | StructuralSectionSigmaProfileBendWidth | "Bend Width" |
| Public property Static member | StructuralSectionSigmaProfileMiddleBendWidth | "Middle Bend Length" |
| Public property Static member | StructuralSectionSigmaProfileTopBendWidth | "Top Bend Length" |
| Public property Static member | StructuralSectionSlopedFlangeAngle | "Sloped Flange Angle" |
| Public property Static member | StructuralSectionSlopedWebAngle | "Sloped Web Angle" |
| Public property Static member | StructuralSectionTopCutHeight | "Top Cut Height" |
| Public property Static member | StructuralSectionTopCutWidth | "Top Cut Width" |
| Public property Static member | StructuralSectionTopWebFillet | "Top Web Fillet" |
| Public property Static member | StructuralSectionZprofileBottomFlangeLength | "Bottom Flange Length" |
| Public property Static member | StructuralStartReleaseFx | "Start Fx" |
| Public property Static member | StructuralStartReleaseFy | "Start Fy" |
| Public property Static member | StructuralStartReleaseFz | "Start Fz" |
| Public property Static member | StructuralStartReleaseMx | "Start Mx" |
| Public property Static member | StructuralStartReleaseMy | "Start My" |
| Public property Static member | StructuralStartReleaseMz | "Start Mz" |
| Public property Static member | StructuralStartReleaseType | "Start Release" |
| Public property Static member | StructuralStickSymbolLocation | "Stick Symbol Location" |
| Public property Static member | StructuralTopReleaseFx | "Top Fx" |
| Public property Static member | StructuralTopReleaseFy | "Top Fy" |
| Public property Static member | StructuralTopReleaseFz | "Top Fz" |
| Public property Static member | StructuralTopReleaseMx | "Top Mx" |
| Public property Static member | StructuralTopReleaseMy | "Top My" |
| Public property Static member | StructuralTopReleaseMz | "Top Mz" |
| Public property Static member | StructuralTopReleaseType | "Top Release" |
| Public property Static member | StructuralWallBottomProjectionPlane | "Bottom Vertical Projection" |
| Public property Static member | StructuralWallProjectionSurface | "Horizontal Projection" |
| Public property Static member | StructuralWallTopProjectionPlane | "Top Vertical Projection" |
| Public property Static member | SupportHandClearance | "Hand Clearance" |
| Public property Static member | SupportHeight | "Height" |
| Public property Static member | SurfaceArea | "Surface Area" |
| Public property Static member | SurfacePatternIdParam | "Surface fill pattern" |
| Public property Static member | SurfacePerimeter | "Perimeter" |
| Public property Static member | SweepBaseFloorSubcategoryId | "Subcategory of Floors" |
| Public property Static member | SweepBaseOffset | "Horizontal Profile Offset" |
| Public property Static member | SweepBaseRoofSubcategoryId | "Subcategory of Roofs" |
| Public property Static member | SweepBaseVertOffset | "Vertical Profile Offset" |
| Public property Static member | SweepMaxSegAngle | "Maximum Segment Angle" |
| Public property Static member | SweepTrajSegmented | "Trajectory Segmentation" |
| Public property Static member | SymbolFamilyAndTypeNamesParam | "Family and Type" |
| Public property Static member | SymbolFamilyNameParam | "Family Name" |
| Public property Static member | SymbolIdParam | "Type Id" |
| Public property Static member | SymbolNameParam | "Type Name" |
| Public property Static member | SystemEquipmentSets | "Equipment Sets" |
| Public property Static member | SystemsAnalysisReportFolder | "Reports Folder Path" |
| Public property Static member | SystemsAnalysisReportStyle | "Report Style" |
| Public property Static member | SystemZoneLevelId | "Level" |
| Public property Static member | TagAngleParam | "Angle" |
| Public property Static member | TagElementCount | "Host Count" |
| Public property Static member | TagElevationBase | "Elevation Base" |
| Public property Static member | TagLeaderType | "Leader Type" |
| Public property Static member | TagNoBreakParamStrings | "Wrap between parameters only" |
| Public property Static member | TagOnPlacementUi | "Tag on Placement" |
| Public property Static member | TagOrientationParam | "Orientation" |
| Public property Static member | TagSampleText | "Sample Text" |
| Public property Static member | TagTag | "Label" |
| Public property Static member | TemplateName | "Template" |
| Public property Static member | TerminationExtensionLength | "Extension Length" |
| Public property Static member | TextAlignHorz | "Horizontal Align" |
| Public property Static member | TextAlignment | "Text Alignment" |
| Public property Static member | TextAlignVert | "Vertical Align" |
| Public property Static member | TextBackground | "Background" |
| Public property Static member | TextBoxVisibility | "Show Border" |
| Public property Static member | TextColor | "Color" |
| Public property Static member | TextDistToLine | "Text Offset" |
| Public property Static member | TextFont | "Text Font" |
| Public property Static member | TextPosition | "Text Position" |
| Public property Static member | TextSize | "Text Size" |
| Public property Static member | TextStyleBold | "Bold" |
| Public property Static member | TextStyleFont | "Font" |
| Public property Static member | TextStyleItalic | "Italic" |
| Public property Static member | TextStyleSize | "Size" |
| Public property Static member | TextStyleUnderline | "Underline" |
| Public property Static member | TextTabSize | "Tab Size" |
| Public property Static member | TextText | "Text" |
| Public property Static member | TextWidthScale | "Width Factor" |
| Public property Static member | ThermalMaterialParamCompressibility | "Compressibility" |
| Public property Static member | ThermalMaterialParamElectricalResistivity | "Electrical Resistivity" |
| Public property Static member | ThermalMaterialParamEmissivity | "Emissivity" |
| Public property Static member | ThermalMaterialParamGasViscosity | "Gas Viscosity" |
| Public property Static member | ThermalMaterialParamLiquidViscosity | "Liquid Viscosity" |
| Public property Static member | ThermalMaterialParamPermeability | "Permeability" |
| Public property Static member | ThermalMaterialParamPorosity | "Porosity" |
| Public property Static member | ThermalMaterialParamReflectivity | "Reflectivity" |
| Public property Static member | ThermalMaterialParamSpecificHeatOfVaporization | "Specific Heat of Vaporization" |
| Public property Static member | ThermalMaterialParamTransmitsLight | "Transmits Light" |
| Public property Static member | ThermalMaterialParamVaporPressure | "Vapor Pressure" |
| Public property Static member | TickMarkPen | "Tick Mark Line Weight" |
| Public property Static member | TilePatternFamrefComponentExtents | "Component Extents" |
| Public property Static member | TilePatternGridCellsX | "Number of horizontal cells" |
| Public property Static member | TilePatternGridCellsY | "Number of vertical cells" |
| Public property Static member | TilePatternGridUnitX | "Horizontal spacing" |
| Public property Static member | TilePatternGridUnitY | "Vertical spacing" |
| Public property Static member | Tilt | "Tilt" |
| Public property Static member | TitleFont | "Font" |
| Public property Static member | TitleSize | "Size" |
| Public property Static member | TitleStyleBold | "Bold" |
| Public property Static member | TitleStyleItalic | "Italic" |
| Public property Static member | TitleStyleUnderline | "Underline" |
| Public property Static member | TopographyLinkName | "Link Name" |
| Public property Static member | TopographyLinkPath | "Saved Path" |
| Public property Static member | ToposolidAttrThicknessParam | "Thickness" |
| Public property Static member | ToposolidElevationAtBottom | "Elevation at Bottom" |
| Public property Static member | ToposolidElevationAtTop | "Elevation at Top" |
| Public property Static member | ToposolidHeightabovelevelParam | "Height Offset From Level" |
| Public property Static member | ToposolidStructureIdParam | "Structure" |
| Public property Static member | ToposolidTypeDefaultThicknessParam | "Default Thickness" |
| Public property Static member | TrapMullWidth | "Center Width" |
| Public property Static member | TrussBearingChordTopBottomParam | "Bearing Chord" |
| Public property Static member | TrussElementAngleParam | "Rotation Angle" |
| Public property Static member | TrussElementBearingJustParam | "Bearing Vertical Justification" |
| Public property Static member | TrussElementClassParam | "Engineering Type" |
| Public property Static member | TrussElementCreateBottomParam | "Create Bottom Chord" |
| Public property Static member | TrussElementCreateTopParam | "Create Top Chord" |
| Public property Static member | TrussElementEnd0Elevation | "Start Level Offset" |
| Public property Static member | TrussElementEnd1Elevation | "End Level Offset" |
| Public property Static member | TrussElementReferenceLevelParam | "Reference Level" |
| Public property Static member | TrussElementRotateChordsWithTruss | "Rotate Chords With Truss" |
| Public property Static member | TrussElementSpanParam | "Span" |
| Public property Static member | TrussElementStickJustParam | "Stick Symbol Location" |
| Public property Static member | TrussElementTagNewMembersView | "Tag new members in view" |
| Public property Static member | TrussFamilyBottomChordAngleParam | "Angle" |
| Public property Static member | TrussFamilyBottomChordEndReleaseType | "End Release" |
| Public property Static member | TrussFamilyBottomChordStartReleaseType | "Start Release" |
| Public property Static member | TrussFamilyBottomChordStructuralTypesParam | "Structural Framing Type" |
| Public property Static member | TrussFamilyBottomChordVerticalProjectionParam | "Analytical Vertical Projection" |
| Public property Static member | TrussFamilyDiagWebAngleParam | "Angle" |
| Public property Static member | TrussFamilyDiagWebEndReleaseType | "End Release" |
| Public property Static member | TrussFamilyDiagWebStartReleaseType | "Start Release" |
| Public property Static member | TrussFamilyDiagWebStructuralTypesParam | "Structural Framing Type" |
| Public property Static member | TrussFamilyTopChordAngleParam | "Angle" |
| Public property Static member | TrussFamilyTopChordEndReleaseType | "End Release" |
| Public property Static member | TrussFamilyTopChordStartReleaseType | "Start Release" |
| Public property Static member | TrussFamilyTopChordStructuralTypesParam | "Structural Framing Type" |
| Public property Static member | TrussFamilyTopChordVerticalProjectionParam | "Analytical Vertical Projection" |
| Public property Static member | TrussFamilyTransformationParam | "Web Orientation" |
| Public property Static member | TrussFamilyVertWebAngleParam | "Angle" |
| Public property Static member | TrussFamilyVertWebEndReleaseType | "End Release" |
| Public property Static member | TrussFamilyVertWebStartReleaseType | "Start Release" |
| Public property Static member | TrussFamilyVertWebStructuralTypesParam | "Structural Framing Type" |
| Public property Static member | TrussFamilyWebsHaveSymbolicCutbackParam | "Webs have symbolic cutback" |
| Public property Static member | TrussHeight | "Truss Height" |
| Public property Static member | TrussLength | "Truss Length" |
| Public property Static member | TrussNonBearingOffsetParam | "Non Bearing Offset" |
| Public property Static member | TypeWallClosure | "Wall Closure" |
| Public property Static member | UniformatCode | "Assembly Code" |
| Public property Static member | UniformatDescription | "Assembly Description" |
| Public property Static member | ViewAnalysisDisplayStyle | "Default Analysis Display Style" |
| Public property Static member | ViewAnalysisResultsVisibility | "Analysis Display Settings" |
| Public property Static member | ViewAssociatedAssemblyInstanceId | "Associated Assembly Instance" |
| Public property Static member | ViewBackClipping | "Depth Clipping" |
| Public property Static member | ViewCameraOrientation | "Locked Orientation" |
| Public property Static member | ViewCameraPosition | "Camera Position" |
| Public property Static member | ViewCleanJoins | "Wall Join Display" |
| Public property Static member | ViewDependency | "Dependency" |
| Public property Static member | ViewDepth | "View Depth" |
| Public property Static member | ViewDescription | "Title on Sheet" |
| Public property Static member | ViewDesignOptionsConfig | "Design Option Configuration" |
| Public property Static member | ViewDetailLevel | "Detail Level" |
| Public property Static member | ViewDiscipline | "Discipline" |
| Public property Static member | Viewer3dRenderSettings | "Rendering Settings" |
| Public property Static member | ViewerAnnotationCropActive | "Annotation Crop" |
| Public property Static member | ViewerBoundActiveBottom | "Bottom Clip Active" |
| Public property Static member | ViewerBoundActiveFar | "Far Clip Active" |
| Public property Static member | ViewerBoundActiveLeft | "Left Clip Active" |
| Public property Static member | ViewerBoundActiveNear | "Near Clip Active" |
| Public property Static member | ViewerBoundActiveRight | "Right Clip Active" |
| Public property Static member | ViewerBoundActiveTop | "Top Clip Active" |
| Public property Static member | ViewerBoundFarClipping | "Far Clipping" |
| Public property Static member | ViewerBoundOffsetBottom | "Bottom Clip Offset" |
| Public property Static member | ViewerBoundOffsetFar | "Far Clip Offset" |
| Public property Static member | ViewerBoundOffsetLeft | "Left Clip Offset" |
| Public property Static member | ViewerBoundOffsetNear | "Near Clip Offset" |
| Public property Static member | ViewerBoundOffsetRight | "Right Clip Offset" |
| Public property Static member | ViewerBoundOffsetTop | "Top Clip Offset" |
| Public property Static member | ViewerCropRegion | "Crop View" |
| Public property Static member | ViewerCropRegionDisabled | "Crop View" |
| Public property Static member | ViewerCropRegionVisible | "Crop Region Visible" |
| Public property Static member | ViewerDetailNumber | "Detail Number" |
| Public property Static member | ViewerEyeElevation | "Eye Elevation" |
| Public property Static member | ViewerIsReference | "Is a Reference" |
| Public property Static member | ViewerModelClipBoxActive | "Section Box" |
| Public property Static member | ViewerOptionVisibility | "Visible In Option" |
| Public property Static member | ViewerPerspective | "Projection Mode" |
| Public property Static member | ViewerReferenceLabel | "Reference Label" |
| Public property Static member | ViewerReferenceLabelText | "Reference Label" |
| Public property Static member | ViewerSheetNumber | "Sheet Number" |
| Public property Static member | ViewerShowUncropped | "Show uncropped" |
| Public property Static member | ViewerTargetElevation | "Target Elevation" |
| Public property Static member | ViewerVolumeOfInterestCrop | "Scope Box" |
| Public property Static member | ViewFamily | "Family" |
| Public property Static member | ViewFamilyAndTypeSchedules | "Family and Type" |
| Public property Static member | ViewFamilySchedules | "Family" |
| Public property Static member | ViewFixedSketchPlane | "None" |
| Public property Static member | ViewGraphSchedBottomLevel | "Bottom Level" |
| Public property Static member | ViewGraphSchedGridAppearance | "Grid Appearance" |
| Public property Static member | ViewGraphSchedGroupSimilar | "Group Similar Locations" |
| Public property Static member | ViewGraphSchedHiddenLevels | "Hidden Levels" |
| Public property Static member | ViewGraphSchedLevelRelativeBaseType | "Elevation Base for Levels" |
| Public property Static member | ViewGraphSchedLocationsHigh | "Column Locations End" |
| Public property Static member | ViewGraphSchedLocationsLow | "Column Locations Start" |
| Public property Static member | ViewGraphSchedMaterialTypes | "Material Types" |
| Public property Static member | ViewGraphSchedNumberColumns | "Column Locations per Segment" |
| Public property Static member | ViewGraphSchedOffGrid | "Include Off-Grid Columns" |
| Public property Static member | ViewGraphSchedRowsCount | "Segments in Viewport" |
| Public property Static member | ViewGraphSchedRowsFrom | "Segment Start in Viewport" |
| Public property Static member | ViewGraphSchedTextAppearance | "Text Appearance" |
| Public property Static member | ViewGraphSchedTitle | "Title" |
| Public property Static member | ViewGraphSchedTopLevel | "Top Level" |
| Public property Static member | ViewGraphSchedTotalColumns | "Total Column Locations" |
| Public property Static member | ViewGraphSchedTotalRows | "Total Segments" |
| Public property Static member | ViewGraphSchedUnitsFormat | "Off-Grid Units Format" |
| Public property Static member | ViewGraphSunPath | "Sun Path" |
| Public property Static member | ViewGraphSunPathSize | "Sun path size (%)" |
| Public property Static member | ViewModelDisplayMode | "Display Model" |
| Public property Static member | ViewName | "View Name" |
| Public property Static member | ViewPartsVisibility | "Parts Visibility" |
| Public property Static member | ViewPhase | "Phase" |
| Public property Static member | ViewPhaseFilter | "Phase Filter" |
| Public property Static member | ViewportAttrLabelTag | "Title" |
| Public property Static member | ViewportAttrOrientationOnSheet | "Rotation on Sheet" |
| Public property Static member | ViewportAttrShowBox | "Show Box" |
| Public property Static member | ViewportAttrShowExtensionLine | "Show Extension Line" |
| Public property Static member | ViewportAttrShowLabel | "Show Title" |
| Public property Static member | ViewportDetailNumber | "Detail Number" |
| Public property Static member | ViewportPositioning | "Viewport Positioning" |
| Public property Static member | ViewportScale | "View Scale" |
| Public property Static member | ViewportSheetName | "Sheet Name" |
| Public property Static member | ViewportSheetNumber | "Sheet Number" |
| Public property Static member | ViewportView | "View" |
| Public property Static member | ViewportViewName | "View Name" |
| Public property Static member | ViewReferencingDetail | "Referencing Detail" |
| Public property Static member | ViewReferencingSheet | "Referencing Sheet" |
| Public property Static member | ViewScale | "Scale Value 1:" |
| Public property Static member | ViewScaleCustomname | "Display Name" |
| Public property Static member | ViewScaleHavename | "Display Name" |
| Public property Static member | ViewScalePulldownImperial | "View Scale" |
| Public property Static member | ViewScalePulldownMetric | "View Scale" |
| Public property Static member | ViewSchemaSettingForBuilding | "Color Scheme" |
| Public property Static member | ViewSchemaSettingForSystem | "System Color Schemes" |
| Public property Static member | ViewSchemaSettingForSystemTemplate | "System Color Schemes" |
| Public property Static member | ViewSheetViewportInfo | "Viewport" |
| Public property Static member | ViewShowGrids | "Show Grids" |
| Public property Static member | ViewShowHiddenLines | "Show Hidden Lines" |
| Public property Static member | ViewShowMassing | "Show Mass" |
| Public property Static member | ViewSlantedColumnSymbolOffset | "Column Symbolic Offset" |
| Public property Static member | ViewSolarstudyAnimationSpeedText | "Loop animation speed" |
| Public property Static member | ViewSolarstudyAnimationSpeedValue | "Loop animation speed" |
| Public property Static member | ViewSolarstudyCurrentStudyTypeIndex | "Study type" |
| Public property Static member | ViewSolarstudyIsLightingStudyType | "Lighting study" |
| Public property Static member | ViewSolarstudyIsMultidayStudyType | "Multi-day study" |
| Public property Static member | ViewSolarstudyIsSingledayStudyType | "Single day study" |
| Public property Static member | ViewSolarstudyIsStillimageStudyType | "Still image study" |
| Public property Static member | ViewSolarstudyLightingAltitudeText | "Lighting altitude text" |
| Public property Static member | ViewSolarstudyLightingAltitudeValue | "Lighting altitude" |
| Public property Static member | ViewSolarstudyLightingAzimuthText | "Lighting azimuth text" |
| Public property Static member | ViewSolarstudyLightingAzimuthValue | "Lighting azimuth" |
| Public property Static member | ViewSolarstudyLightingPresetIndex | "Lighting presets combo" |
| Public property Static member | ViewSolarstudyMultidayDatetimeText | "Multi-day date and time text" |
| Public property Static member | ViewSolarstudyMultidayFrameText | "Multi-day frame text" |
| Public property Static member | ViewSolarstudyMultidayFrameValue | "Multi-day frame" |
| Public property Static member | ViewSolarstudyMultidayPresetIndex | "Multi-day presets combo" |
| Public property Static member | ViewSolarstudyShadowsIntensityText | "Shadows intensity text" |
| Public property Static member | ViewSolarstudyShadowsIntensityValue | "Shadows intensity" |
| Public property Static member | ViewSolarstudySingledayDatetimeText | "Single day date and time text" |
| Public property Static member | ViewSolarstudySingledayFrameText | "Single day frame text" |
| Public property Static member | ViewSolarstudySingledayFrameValue | "Single day frame" |
| Public property Static member | ViewSolarstudySingledayPresetIndex | "Single day presets combo" |
| Public property Static member | ViewSolarstudyStillDateText | "Still date text" |
| Public property Static member | ViewSolarstudyStillDateValue | "Still date" |
| Public property Static member | ViewSolarstudyStillPresetIndex | "Still presets combo" |
| Public property Static member | ViewSolarstudyStillTimeText | "Still time text" |
| Public property Static member | ViewSolarstudyStillTimeValue | "Still time" |
| Public property Static member | ViewSolarstudySunIntensityText | "Sun intensity text" |
| Public property Static member | ViewSolarstudySunIntensityValue | "Sun intensity" |
| Public property Static member | ViewTemplate | "View Template" |
| Public property Static member | ViewTemplateForSchedule | "View Template" |
| Public property Static member | ViewType | "Family and Type" |
| Public property Static member | ViewTypeSchedules | "Type" |
| Public property Static member | ViewUnderlayBottomId | "Range: Base Level" |
| Public property Static member | ViewUnderlayOrientation | "Underlay Orientation" |
| Public property Static member | ViewUnderlayTopId | "Range: Top Level" |
| Public property Static member | ViewVisibleCategories | "Visibility/Graphics Overrides" |
| Public property Static member | VisGraphicsAnalyticalModel | "V/G Overrides Analytical Model" |
| Public property Static member | VisGraphicsAnnotation | "V/G Overrides Annotation" |
| Public property Static member | VisGraphicsCoordinationModel | "V/G Overrides Coordination Model" |
| Public property Static member | VisGraphicsDesignoptions | "V/G Overrides Design Options" |
| Public property Static member | VisGraphicsFilters | "V/G Overrides Filters" |
| Public property Static member | VisGraphicsImport | "V/G Overrides Import" |
| Public property Static member | VisGraphicsModel | "V/G Overrides Model" |
| Public property Static member | VisGraphicsPointClouds | "V/G Overrides Point Clouds" |
| Public property Static member | VisGraphicsRvtLinks | "V/G Overrides RVT Links" |
| Public property Static member | VisGraphicsWorksets | "V/G Overrides Worksets" |
| Public property Static member | VoidCutsGeometry | "Cuts Geometry" |
| Public property Static member | VolumeCut | "Cut" |
| Public property Static member | VolumeFill | "Fill" |
| Public property Static member | VolumeNet | "Net cut/fill" |
| Public property Static member | VolumeOfInterestName | "Name" |
| Public property Static member | VolumeOfInterestViewsVisible | "Views Visible" |
| Public property Static member | WalkthroughFramesCount | "Walkthrough Frames" |
| Public property Static member | WallAlignKeyRefParam | "Location line to align" |
| Public property Static member | WallAttrDefheightParam | "Default height" |
| Public property Static member | WallAttrHeightParam | "Height" |
| Public property Static member | WallAttrRoomBounding | "Room Bounding" |
| Public property Static member | WallAttrWidthParam | "Width" |
| Public property Static member | WallBaseConstraint | "Base Constraint" |
| Public property Static member | WallBaseHeightParam | "Base height" |
| Public property Static member | WallBaseOffset | "Base Offset" |
| Public property Static member | WallBottomExtensionDistParam | "Base Extension Distance" |
| Public property Static member | WallBottomIsAttached | "Base is Attached" |
| Public property Static member | WallCrossSection | "Cross-Section" |
| Public property Static member | WallHeightType | "Top Constraint" |
| Public property Static member | WallKeyRefParam | "Location Line" |
| Public property Static member | WallLocationLineOffsetParam | "Location Line Offset" |
| Public property Static member | WallSingleSlantAngleFromVertical | "Angle From Vertical" |
| Public property Static member | WallStructuralSignificant | "Structural" |
| Public property Static member | WallStructuralUsageParam | "Structural Usage" |
| Public property Static member | WallStructureIdParam | "Structure" |
| Public property Static member | WallSweepCutByInsertsParam | "Cut by Inserts" |
| Public property Static member | WallSweepCutsWallParam | "Cuts Wall" |
| Public property Static member | WallSweepDefaultSetbackParam | "Default Setback" |
| Public property Static member | WallSweepLevelParam | "Level" |
| Public property Static member | WallSweepOffsetParam | "Offset From Level" |
| Public property Static member | WallSweepOrientation | "Orientation" |
| Public property Static member | WallSweepProfileParam | "Profile" |
| Public property Static member | WallSweepWallOffsetParam | "Offset From Wall" |
| Public property Static member | WallSweepWallSubcategoryId | "Subcategory of Walls" |
| Public property Static member | WallTaperedExteriorInwardAngle | "Exterior Angle" |
| Public property Static member | WallTaperedInteriorInwardAngle | "Interior Angle" |
| Public property Static member | WallTaperedUseInstanceAngles | "Enable Angle Overrides" |
| Public property Static member | WallTaperedWidthAtBottom | "Bottom Width" |
| Public property Static member | WallTaperedWidthAtTop | "Top Width" |
| Public property Static member | WallTopExtensionDistParam | "Top Extension Distance" |
| Public property Static member | WallTopIsAttached | "Top is Attached" |
| Public property Static member | WallTopOffset | "Top Offset" |
| Public property Static member | WallTypeDefaultTaperedExteriorInwardAngle | "Default Exterior Angle" |
| Public property Static member | WallTypeDefaultTaperedInteriorInwardAngle | "Default Interior Angle" |
| Public property Static member | WallTypeWidthMeasuredAt | "Width Measured At" |
| Public property Static member | WallUserHeightParam | "Unconnected Height" |
| Public property Static member | WindowTypeId | "Type Mark" |
| Public property Static member | WitnsLineExtension | "Witness Line Extension" |
| Public property Static member | WitnsLineGapToElt | "Witness Line Gap to Element" |
| Public property Static member | WitnsLineTickMark | "Witness Line Tick Mark" |
| Public property Static member | WrappingAtEndsParam | "Wrapping at Ends" |
| Public property Static member | WrappingAtInsertsParam | "Wrapping at Inserts" |
| Public property Static member | YJustification | "y Justification" |
| Public property Static member | YOffsetValue | "y Offset Value" |
| Public property Static member | YzJustification | "yz Justification" |
| Public property Static member | ZJustification | "z Justification" |
| Public property Static member | ZOffsetValue | "z Offset Value" |
| Public property Static member | ZoneAirVolumeCalculationTypeParam | "Air Volume Calculation Type" |
| Public property Static member | ZoneArea | "Occupied Area" |
| Public property Static member | ZoneAreaGross | "Gross Area" |
| Public property Static member | ZoneCalculatedAreaPerCoolingLoadParam | "Calculated Area per Cooling Load" |
| Public property Static member | ZoneCalculatedAreaPerHeatingLoadParam | "Calculated Area per Heating Load" |
| Public property Static member | ZoneCalculatedCoolingLoadParam | "Calculated Cooling Load" |
| Public property Static member | ZoneCalculatedCoolingLoadPerAreaParam | "Calculated Cooling Load per area" |
| Public property Static member | ZoneCalculatedHeatingLoadParam | "Calculated Heating Load" |
| Public property Static member | ZoneCalculatedHeatingLoadPerAreaParam | "Calculated Heating Load per area" |
| Public property Static member | ZoneCalculatedHydronicCoolingflowParam | "Calculated Hydronic Cooling Flow" |
| Public property Static member | ZoneCalculatedHydronicHeatingflowParam | "Calculated Hydronic Heating Flow" |
| Public property Static member | ZoneCalculatedSupplyAirflowParam | "Calculated Supply Airflow" |
| Public property Static member | ZoneCalculatedSupplyAirflowPerAreaParam | "Calculated Supply Airflow per area" |
| Public property Static member | ZoneCoilBypassPercentageParam | "Coil Bypass" |
| Public property Static member | ZoneCoolingAirTemperatureParam | "Cooling Air Temperature" |
| Public property Static member | ZoneCoolingInformationParam | "Cooling Information" |
| Public property Static member | ZoneCoolingSetPointParam | "Cooling Set Point" |
| Public property Static member | ZoneDehumidificationSetPointParam | "Dehumidification Set Point" |
| Public property Static member | ZoneHeatingAirTemperatureParam | "Heating Air Temperature" |
| Public property Static member | ZoneHeatingInformationParam | "Heating Information" |
| Public property Static member | ZoneHeatingSetPointParam | "Heating Set Point" |
| Public property Static member | ZoneHumidificationSetPointParam | "Humidification Set Point" |
| Public property Static member | ZoneLevelId | "Level" |
| Public property Static member | ZoneLevelOffset | "Level Offset" |
| Public property Static member | ZoneLevelOffsetTop | "Top Offset" |
| Public property Static member | ZoneName | "Name" |
| Public property Static member | ZoneOaRatePerAchParam | "Outdoor Air Rate / Air Changes per Hour" |
| Public property Static member | ZoneOutdoorAirInformationParam | "Outdoor Air Information" |
| Public property Static member | ZoneOutsideAirPerAreaParam | "Outdoor Air per Area" |
| Public property Static member | ZoneOutsideAirPerPersonParam | "Outdoor Air per Person" |
| Public property Static member | ZonePerimeter | "Perimeter" |
| Public property Static member | ZonePhase | "Phase" |
| Public property Static member | ZonePhaseId | "Phase Id" |
| Public property Static member | ZoneServiceTypeParam | "Service Type" |
| Public property Static member | ZoneSpaceOutdoorAirOptionParam | "Space Outdoor Air Option" |
| Public property Static member | ZoneUseAirChangesPerHourParam | "Use Air Changes Per Hour" |
| Public property Static member | ZoneUseDehumidificationSetpointParam | "Use Dehumidification Set Point" |
| Public property Static member | ZoneUseHumidificationSetpointParam | "Use Humidification Set Point" |
| Public property Static member | ZoneUseOutsideAirPerAreaParam | "Use Outside Air Per Area" |
| Public property Static member | ZoneUseOutsideAirPerPersonParam | "Use Outside Air Per Person" |
| Public property Static member | ZoneVolume | "Occupied Volume" |
| Public property Static member | ZoneVolumeGross | "Gross Volume" |

# See Also

ParameterTypeId Class

Autodesk.Revit.DB Namespace